Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-console.po
Languages: fr

source: Using the WAPT console
fr: Utiliser la console WAPT

source: Installing the WAPT agent on the devices in your Organization
fr: Installer l'agent WAPT sur les postes utilisateur de votre Organisation

source: If you have not done so already, install the WAPT agent on a computer.
fr: Si vous ne l'avez pas déjà fait, installer l'agent WAPT sur un poste utilisateur.

source: The installation of the WAPT agent on computers will register them on the WAPT inventory server.
fr: L'installation de l'agent WAPT sur un client va enclencher l'enregistrement du client dans l'inventaire du serveur WAPT.

source: The hosts will then appear in the WAPT console.
fr: Le client apparaîtra alors dans la console WAPT.

source: To install the WAPT agent manually on a computer, download the WAPT agent from https://wapt_server/wapt/waptagent.exe then launch its installation.
fr: Pour installer l'agent WAPT manuellement sur un poste client, télécharger l'agent WAPT : https://wapt/wapt/waptagent.exe puis lancer son installation.

source: Download the WAPT agent to be deployed on computers
fr: Télécharger l'agent WAPT à déployer sur les clients

source: If you have skipped the step for creating the WAPT agent, return to the documentation on :ref:`installing the WAPT agent <install_waptagent>`.
fr: Si vous avez sauté l'étape de création de l'agent WAPT, visitez la documentation pour :ref:`créer et déployer l'agent WAPT <install_waptagent>`.

source: On your **management computer**, hosts are displayed in the WAPT console.
fr: Sur votre **poste de management**, dans la console :program:`waptconsole.exe` doit apparaître le client dans la console.

source: Inventory of hosts registered with WAPT
fr: Inventaire des clients enregistrés dans WAPT

source: If a host does not appear in the console after having installed the WAPT agent, open the Windows command line utility :program:`cmd.exe` on the host and type :command:`wapt-get register`.
fr: Si le poste ne remonte pas directement dans la console à l'issue de l'installation de l'agent, taper manuellement la commande ``wapt-get register -S`` sur le client.

source: Duplicating packages from external repositories
fr: Dupliquer des paquets

source: Package duplication principles
fr: Principe de duplication de paquets

source: Duplicating a WAPT package consists of:
fr: La duplication consiste à :

source: importing an existing WAPT package from an external repository;
fr: importer un paquet WAPT existant depuis un dépôt externe ;

source: changing its prefix (for example from *tis* to *test*);
fr: changer le préfixe (par exemple de *tis* à *test*) ;

source: resigning the WAPT package with the :term:`Administrator`'s private key to allow the deployment of the duplicated package on your WAPT equipped hosts;
fr: re-signer le paquet avec votre clé privée d':term:`Administrateur` pour permettre le déploiement du paquet dupliqué sur vos postes clients ;

source: finally, uploading it on the main WAPT repository;
fr: et enfin, uploader celui-ci sur votre dépôt WAPT ;

source: By importing a package in your repository and signing it, you then become responsible for that package and for what it does. **It has been signed with your own private key**.
fr: En important un paquet dans votre dépôt, vous devenez responsable de ce paquet. **Il est signé avec votre signature**.

source: **Tranquil IT** disclaims any liability if you choose to use WAPT packages retrieved from her repositories. Without a support contract, Tranquil IT does not guarantee the suitability of the package for your own particular use case, nor do they guarantee the ability of the package to comply with your :term:`Organization`'s internal security policies.
fr: **Tranquil IT** décline toute responsabilité si vous utilisez des paquets WAPT récupérés depuis ses dépôts. Sans contrat de support, elle n'offre aucune garantie sur l'adéquation du paquet à votre usage ou la capacité du paquet à être conforme à aux politiques internes de sécurité de votre :term:`Organisation`.

source: go to the :guilabel:`Private repository` tab;
fr: se rendre dans l'onglet :guilabel:`Dépôt privé` ;

source: Available software displayed in the WAPT console
fr: Logiciels disponibles dans les dépôts dans la console WAPT

source: Every software package version available on the WAPT repository is shown.
fr: On obtient tous les paquets logiciels présents sur le dépôt WAPT.

source: If no package has been imported, the list is empty. Only the *test-waptupgrade* package will be present if the WAPT agent has been generated previously. Visit the documentation on :ref:`creating a WAPT agent <create_WAPT_agent>`.
fr: Si aucun paquet n'a été importé, cette liste sera vide. Seul le paquet *test-waptupgrade* sera présent :ref:`si l'agent WAPT a été généré précédemment <create_WAPT_agent>`. Consultez la documentation pour :ref:`créer un agent WAPT <créer_WAPT_agent>`.

source: Two options are available to import packages:
fr: Deux possibilités existent pour importer des paquets :

source: Import a package from an external repository on the Internet
fr: Importer depuis internet

source: That first method allows you to download packages directly from a WAPT repository external to your :term:`Organization`.
fr: Cette première méthode permet de télécharger des paquets directement depuis un dépôt WAPT extérieur à votre :term:`Organisation`.

source: To import from a different repository than Tranquil IT, define a new repository address in the WAPT console preferences. For example: http://wapt.otherorganization.com/wapt/.
fr: Pour importer depuis un dépôt différent de celui de Tranquil IT, indiquer dans les préférences l'adresse d'un autre dépôt WAPT. Par exemple : https://wapt.autredomaine.local/wapt/.

source: If no repository is set, the repository https://wapt.tranquil.it/wapt will be implicitly set.
fr: Si aucun dépôt n'est renseigné, la valeur https://wapt.tranquil.it/wapt sera la valeur implicite.

source: Starting with WAPT 1.3.12.13, **external repository SSL/ TLS certificates are verified by default**.
fr: A partir de la version 1.3.12.13, la vérification de la validité du certificat SSL / TLS du dépôt extérieur est **activée par défaut**.

source: click on :guilabel:`Import from Internet`;
fr: cliquer sur :guilabel:`Importer` depuis internet ;

source: Import a package from Internet
fr: Importer un paquet depuis internet

source: The grid view displays the list of available packages on the remote repository.
fr: La liste affiche les paquets disponibles sur le serveur distant.

source: to import a package, select a package then :menuselection:`Right-click --> Import`;
fr: pour importer un paquet, sélectionner un paquet puis :menuselection:`clic-droit --> importer` ;

source: Imported WAPT package in your local WAPT repository
fr: Importer un paquet dans le dépôt

source: validate the duplication in your local repository;
fr: valider la duplication dans le dépôt local ;

source: Confirm the duplication of the package
fr: Confirmer la duplication du paquet

source: click on :guilabel:`Yes` to confirm the duplication;
fr: cliquer sur :guilabel:`Oui` pour confirmer ;

source: the download of the package starts ...
fr: le téléchargement démarre ...

source: Progress of the package duplication process
fr: Progression de la duplication du paquet

source: then, enter your private key password...
fr: entrer le mot de passe de votre clé privée...

source: Enter the password for unlocking the private key
fr: Entrer le mot de passe de la clé privée

source: The WAPT console confirms that the package has been duplicated in your local WAPT repository.
fr: La console confirme la duplication du paquet dans le dépôt WAPT local.

source: Confirmation of successful duplication
fr: Confirmation de la réussite de la duplication

source: The package then appears in your local WAPT repository with your Organization's prefix.
fr: Le paquet apparaît bien dans le dépôt WAPT local avec le préfixe de votre Organisation.

source: WAPT console displaying the duplicated package
fr: Console WAPT affichant le paquet dupliqué

source: If the verification of the package signature is enabled, the public certificate of the signer must be located in one of the following folders:
fr: Si la vérification de la signature du paquet lors de l'import depuis Internet est activée, le certificat public doit être présent dans un des dossiers suivants :

source: If the certificate is not found in one of these two folders, then the following error will occur and the package will not be imported.
fr: Si ce n'est pas le cas, l'erreur suivante se produira et empêchera l'import du paquet depuis ce dépôt.

source: Error while validating the signature of the external repository
fr: Erreur lors de la validation de la signature du dépôt extérieur

source: Editing a package before importing it
fr: Editer un paquet avant de l'importer

source: Starting with WAPT 1.3.12.13, it is now possible to edit a package downloaded from an external repository before importing it in your main WAPT repository.
fr: Avec la sortie de WAPT 1.3.12.13, il est désormais possible d'éditer directement un paquet depuis le dépôt externe avant de l'importer dans le dépôt local.

source: To achieve this, choose instead the second option :guilabel:`Download and Edit` to import the package from an external WAPT repository.
fr: Pour cela, choisir la deuxième option :guilabel:`Télécharger et éditer` lors de l'import du paquet depuis Internet.

source: Process for importing and editing a package
fr: Procédure pour télécharger et éditer un paquet

source: :program:`PyScripter`, if installed, opens the WAPT package.
fr: L'éditeur :program:`PyScripter`, si installé au préalable, s'ouvre alors avec le projet WAPT du paquet.

source: Please refer to the documentation on :ref:`creating WAPT packages from scratch <creating_WAPT_packages>`.
fr: Voir la documentation pour savoir comment :ref:`créer des paquets WAPT <creating_WAPT_packages>`.

source: Importing a WAPT package from a file
fr: Importer depuis un fichier

source: That second method allows you to import a :file:`.wapt` file from any medium.
fr: Cette deuxième méthode permet d'indiquer un fichier :file:`.wapt` stocké sur n'importe quel support.

source: click on :guilabel:`Import from File`;
fr: cliquer sur :guilabel:`Importer` depuis un fichier ;

source: Import from a file
fr: Importer à partir d'un fichier

source: select the file to import;
fr: sélectionner le fichier pour l'importer ;

source: Select the file to import
fr: Sélectionner le fichier à importer

source: click on :guilabel:`Open` to import the file;
fr: cliquer sur :guilabel:`Ouvrir` pour importer le fichier ;

source: File imported successfully
fr: Importation du fichier réussie

source: Changing the prefix and re-signing a WAPT package
fr: Changer le préfixe et re-signer le paquet

source: When importing, the changing of the prefix and the re-signing of the WAPT package are transparent and automatic.
fr: Lors d'un import, le changement de préfixe et la re-signature sont transparents et automatiques.

source: Once the package is ready, the WAPT package is uploaded onto the main WAPT repository.
fr: Une fois que le paquet est prêt, il est transféré vers le dépôt WAPT local.

source: Deploying WAPT packages from the WAPT console
fr: Déployer des paquets depuis la console

source: edit the host onto which you want to deploy a WAPT package;
fr: éditer le poste sur lequel le logiciel sera déployé ;

source: Selecting multiple hosts using common shortcut keys :kbd:`Control-A` or :kbd:`Shift-Arrow` is possible.
fr: La sélection multiple en utilisant les touches habituelles :kbd:`Control-A` :kbd:`Shift-Flèche` est possible.

source: Select the host to configure
fr: Sélectionner le poste à configurer

source: A window opens, on the right side appears the list of packages available on the local WAPT repository, and on the left side it shows the list of packages currently assigned to the host.
fr: Une fenêtre s'ouvre, à droite apparaît la liste des paquets disponibles sur le dépôt WAPT local et à gauche la liste des paquets actuellement attribués au poste.

source: drag and drop packages from the right pane to the left pane;
fr: glisser-déposer le paquet souhaité depuis l'encart de droite vers l'encart de gauche ;

source: Drag and drop the package on the host or the selection of hosts
fr: Glisser-déposer le paquet sur le poste ou la sélection de postes

source: clicking on :guilabel:`Save and Apply to hosts` will launch the installation of the package(s) immediately on the selected host(s) that are connected to the WAPT Server;
fr: cliquer sur :guilabel:`Enregistrer et Appliquer à la machine` lance immédiatement l'installation sur le poste concerné ;

source: clicking on :guilabel:`Save` will save the current configuration. Upgrading of the packages will occur during the WAPT agents' next update cycle;
fr: cliquer sur :guilabel:`Enregistrer` pour enregistre la nouvelle configuration. La mise à jour sera appliquée au prochain cycle de mises à jour de l'agent WAPT ;

source: Save and apply configuration on selected host(s)
fr: Enregistrer et appliquer la configuration à la machine

source: Update launched
fr: Mise à jour lancée

source: To launch the installation of WAPT packages, click successively on :guilabel:`Update available packages` then :guilabel:`Apply updates`.
fr: Pour lancer l'installation des paquets, cliquer successivement sur :guilabel:`Lancer la mise à jour des paquets disponibles` puis :guilabel:`Lancer l'installation des paquets`.

source: Applying updates
fr: Lancer la mise à jour des paquets disponibles

source: The installation of the WAPT package(s) is launched on the selected host(s) connected to the WAPT Server.
fr: L'installation du paquet WAPT se lance sur le poste ou les postes sélectionnés.
