Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/command-line-interface/command-line-interface-common-usage.po
Languages: fr

source: Using the more common functions in WAPT with the command line
fr: Utiliser les fonctions les plus courantes de la ligne de commande

source: command line, WAPT, CLI, special commands, update, upgrade, search, install, remove, clean
fr: ligne de commande, WAPT, CLI, command line, invite de commande Windows, commandes spéciales, update, upgrade, search, install, remove, clean, documentation

source: The :command:`update` command allow to update the list of available packages.
fr: La commande :command:`update` permet de mettre à jour la liste des paquets disponibles.

source: The local WAPT agent will download :file:`Packages` file from the private repository and compare it to its local database.
fr: L'agent WAPT local télécharge le fichier :file:`Packages` depuis le dépôt et le compare avec sa base de données.

source: If new updates are available, the WAPT agent switches the packages status to **TO-UPGRADE**;
fr: si des mises à jour sont disponibles, l'agent bascule alors les paquets concernés dans l'état **TO-UPDATE** ;

source: If new software have been added on the repository, they become downloadable by the WAPT agent;
fr: si de nouveaux logiciels ont été ajoutés sur le dépôt, ils deviennent téléchargeables sur le poste client ;

source: The :command:`update` command does not download packages, it only updates the local database of packages.
fr: L'action :command:`update` ne télécharge pas les paquets, elle met uniquement à jour la base locale des paquets.

source: The command :code:`wapt-get update` returns:
fr: La commande :code:`wapt-get update` renvoie :

source: The command :command:`wapt-get upgrade` allows to launch the installation of packages waiting to be upgraded or waiting to be installed.
fr: La commande :command:`upgrade` lance l'installation des paquets en attente de mise à jour ou d'installation.

source: The local WAPT agent downloads if necessary WAPT packages in its local cache then installs them.
fr: L'agent WAPT local télécharge si nécessaire les paquets WAPT dans son cache local puis installe les paquets.

source: It's strongly advised to launch a :command:`wapt-get update` command before launching a :command:`wapt-get upgrade` command;
fr: Il est recommandé de lancer un :command:`update` avant de lancer un :command:`upgrade` ;

source: Without previously launching a :command:`update`, the WAPT agent will install nothing;
fr: Sans un :command:`update` préalable, l'agent WAPT n'installera rien ;

source: The command :code:`wapt-get upgrade` returns:
fr: La commande :code:`wapt-get upgrade` renvoie :

source: The :command:`search` command allows to search for one or more package in the repositories.
fr: La commande :command:`search` permet de rechercher un ou des paquet(s) sur les dépôt enregistrés.

source: The search command takes one argument to be looked up in package name and description.
fr: La recherche prend un argument en paramètre. Cet argument servira à chercher dans le nom du paquet et dans sa description.

source: The command :code:`wapt-get search "Firefox"` returns:
fr: La commande :code:`wapt-get install tis-firefox` renvoie :

source: Package name
fr: Nom du package

source: Plateform
fr: Plateforme

source: Mozilla Firefox Web Browser in French
fr: Navigateur Web Firefox Français

source: Mozilla Firefox Web Browser in English
fr: Mozilla Web Browser Web Firefox English

source: Adobe Flashplayer for Firefox
fr: Adobe Flashplayer pour Firefox

source: The :command:`install` command launches the installation of a package.
fr: La commande :command:`install` lance l'installation d'un paquet.

source: The command takes on argument. That argument is the package name with the repository prefix.
fr: La commande prend un argument en paramètre. Cet argument est le nom du paquet contenant le préfixe.

source: To install Mozilla Firefox, the command is :code:`wapt-get install <prefix>-firefox`.
fr: Pour l'installation de Mozilla Firefox il faudra taper la commande :code:`wapt-get install <prefix>-firefox`.

source: If the package has not been downloaded to cache, :command:`install` will first download the package to cache, then it will install it.
fr: Si le paquet n'est pas téléchargé au préalable, la commande :command:`install` téléchargera préalablement le paquet en cache.

source: Installing a WAPT package with :command:`install` does not add the package as a dependency to the host.
fr: L'installation d'un paquet WAPT avec :command:`install` n'ajoute pas le paquet en dépendance au poste.

source: The package is installed on the machine, but if the computer is re-imaged, the package will not be reinstalled automatically.
fr: Il est installé sur la machine, mais en cas de réinstallation du poste il ne sera pas réinstallé automatiquement.

source: The command :code:`wapt-get install tis-firefox` returns:
fr: La commande :code:`wapt-get install tis-firefox` renvoie :

source: The :command:`remove <package name>` command removes a package.
fr: La commande :command:`remove` lance la désinstallation d'un paquet.

source: To remove Mozilla Firefox, the command is :command:`wapt-get remove <prefix>-firefox`.
fr: Pour désinstaller Mozilla Firefox il faudra taper la commande : :command:`wapt-get remove <prefix>-firefox`.

source: Removing a WAPT package with :command:`remove` does not remove the package dependency on the host.
fr: La désinstallation d'un paquet WAPT avec :command:`remove` ne supprime pas la dépendance entre le paquet machine et le paquet.

source: **The package will effectively be uninstalled from the machine, but it will automatically be reinstalled on the next :command:`upgrade`.**
fr: Le paquet sera effectivement désinstallé de la machine, mais il sera réinstallé automatiquement lors du prochain :command:`upgrade`.

source: To completely remove a package from a host, do a :command:`remove` for the targeted package, then edit the host configuration via the WAPT console to remove the package dependency on the host.
fr: Afin de supprimer totalement un paquet d'un poste il faut faire un :command:`remove` puis éditer la configuration de la machine via la console et supprimer la dépendance au paquet.

source: The command :code:`wapt-get remove tis-firefox` returns:
fr: La commande :code:`wapt-get remove tis-firefox` renvoie :

source: The :command:`clean` command removes packages from the :file:`C:\\Program Files (x86)\\wapt\\cache` folder.
fr: La commande :command:`clean` supprime du cache les paquets dans le répertoire :file:`C:\Program Files (x86)\wapt\cache`.

source: The :command:`clean` command is launched after each upgrade to save disk space.
fr: La commande :command:`clean` est lancée à chaque fin de mise à jour pour économiser le stockage sur le disque dur de la machine.

source: The command :code:`wapt-get clean` returns:
fr: La commande :code:`wapt-get clean` renvoie :
