Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security/enable-check-certificate.po
Languages: fr

source: Securing the communications between the agent and the WAPT Server
fr: Sécruriser la communication entre l'agent et le serveur WAPT

source: pinning, certificate pinning, bundle, wapt-get.ini, Certificate Authority, enable-check-certificate, WAPT, documentation
fr: épingler, épinglage de certificat, paquet, wapt-get.ini, Certificat d'Authorité, enable-check-certificate, WAPT, documentation

source: Activating the verification of the SSL / TLS certificate
fr: Activer la vérification du certificat SSL / TLS

source: When running the WAPT Server post-configuration script, the script will generate a self-signed certificate in order to enable HTTPS communications.
fr: Lorsque le script post-configuration est lancé sur le serveur WAPT, le script va générer un certificat auto-signé afin d'activer les communications HTTPS.

source: The WAPT agent checks the HTTPS server certificate according to the ``verify_cert`` value in section ``[global]`` in :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`.
fr: L'agent WAPT vérifie que le certificat du serveur renseigné dans l'option ``verify_cert`` de la section ``[global]`` dans le fichier :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini` corresponde.

source: To quickly and easily enable verification of the https certificate, you can use the *Pinning* method.
fr: Pour activer rapidement et simplement la vérification du certificat htts, vous pouvez utiliser la méthode d'*Épinglage*

source: Pinning the certificate
fr: Épingler le certificat

source: The *pinning of certificate* consists of verifying the SSL/ TLS certificate with a well defined and restricted bundle.
fr: L'*épinglage de certificat* consiste à vérifier le certificat SSL/ TLS à l'aide de la définition d'un paquet bien défini et restrictif.

source: This method is the easiest when using a self-signed certificate.
fr: Cette méthode est la plus simple concernant les certificats auto-signés.

source: For this, you need to launch the following commands in the Windows :program:`cmd.exe` shell (with elevated privileges if :abbr:`UAC (User Account Control)` is active).
fr: Pour cela, vous aurez besoin de lancer la commande suivante dans la console Windows :program:`cmd.exe` (avec élévation de privilèges si les :abbr:`UAC (User Account Control)` sont activées).

source: If you already have a Windows :program:`cmd.exe` shell open, close it and open a new shell so to take into account the updated environment variables:
fr: Si vous avez déjà une console Windows :program:`cmd.exe` d'ouverte, fermez-là et ouvrez-en une nouvelle afin de prendre en compte la mise à jour des variables d'environnement:

source: Validate the certificate with :command:`wapt-get update`
fr: Validez le certificat avec :command:`wapt-get update`

source: When you have executed the :command:`update` command, make sure that everything has gone well, and if in doubt check :ref:`error_run_check_cert`.
fr: Lorsque vous avez exécuté la commande :command:`update`, assurez-vous que tout ce soit bien déroulé et en cas de doute, vérifiez :ref:`error_run_check_cert`.

source: the command *enable-check-certificate* downloads the certificate :file:`srvwapt.mydomain.lan.crt` in the folder :file:`C:\\Program Files (x86)\\WAPT\\ssl\\server`;
fr: La commande *enable-check-certificate* va télécharger le certificat :file:`srvwapt.mydomain.lan.crt` dans le dossier :file:`C:\\Program Files (x86)\\WAPT\\ssl\\server`;

source: it then modifies the file :file:`wapt-get.ini` to specify the value ``verify_cert`` = :file:`C:\\Program Files (x86)\\wapt\\ssl\\server\\srvwapt.mydomain.lan.crt`;
fr: cela va alors modifier le fichier :file:`wapt-get.ini` avec de spécifiée la valeur ``verify_cert`` = :file:`C:\\Program Files (x86)\\wapt\\ssl\\server\\srvwapt.mydomain.lan.crt`;

source: the WAPT agent will now verify certificates using the pinned certificate;
fr: l'agent WAPT va désormais vérifier les certificats en utilisant le certificat épinglé;

source: If you use the *certificate pinning* method, be reminded to archive the :file:`/opt/wapt/waptserver/ssl` folder on your WAPT Server.
fr: Si vous utilisez la méthode d'*épinglage de certificat*, n'oubliez pas de sauvegarder le dossier :file:`/opt/wapt/waptserver/ssl` sur votre serveur WAPT.

source: The file will have to be restored on your server if you migrate or upgrade your WAPT Server, if you want the WAPT agents to continue to be able to establish trusted HTTPS connections.
fr: Le fichier devra être restauré sur votre serveur si vous migrez ou mettez à jour votre seveur WAPT, si vous voulez que les agents WAPT continuent d'avoir une connexion HTTPS sécurisée.

source: How to use a commercial certificate or certificates provided by your organization?
fr: Comment utiliser le ou les certificat(s) founi(s) par votre organisation ?

source: If the pinning method does not suit you, you can replace the self-signed certificate generated during the installation of :program:`WAPT`.
fr: Si la méthode d'épinglage ne vous convient pas, vous pouvez remplacer le certificat auto-signé généré pendant l'installation de :program:`WAPT`.

source: Replace the old certificate with the new one in the folder :file:`/opt/wapt/waptserver/ssl/` (linux) or :file:`c:\\wapt\\waptserver\\ssl\\` (windows).
fr: Remplacez l'ancien certificat avec le nouveau dans le dossier :file:`/opt/wapt/waptserver/ssl/` (linux) ou :file:`c:\\wapt\\waptserver\\ssl\\` (windows).

source: The new key pair must be in PEM encoded Base64 format
fr: La nouvelle paire de clé doit être une PEM encodée en Base64

source: **Special case where your certificate has been signed by an internal Certificate Authority**
fr: **Cas spécifique où votre certificat a été signé par un Certificat d'Authorité** interne

source: Certificates issued by an internal :term:`Certificate Authority` must have the complete certificate chain up to the :term:`Certificate Authority`'s certificate.
fr: Les certificats issus d'un :term:`Certificat d'Authorité` interne doit avoir la chaîne complète jusqu'au :term:`Certificat d'Authorité`.

source: You can manually add the certificate chain up to the Certificate Authority to the certificate that will be used by :program:`Nginx`.
fr: Vous pouvez ajouter la chaîne du Certificat d'Authorité manuellement au certificat qui sera utilisé par :program:`Nginx`."

source: Example: :code:`echo srvwapt.mydomain.lan.crt ca.crt > cert.pem`
fr: Exemple : :code:`echo srvwapt.mydomain.lan.crt ca.crt > cert.pem`

source: For linux servers it is also necessary to reset the :abbr:`ACLs (Access Control List)`:
fr: Pour les serveurs Linux, il est nécessaire d'aussi réinitialiser les :abbr:`ACLs (Access Control List)`:

source: restart :program:`Nginx` to take into account the new certificates;
fr: redémarrer :program:`Nginx` pour qu'il prenne en compte les nouveaux certificats;

source: Configuring the WAPT agent
fr: Configurer l'agent WAPT

source: For a commercial certificate you can set ``verify_cert`` = 1 in :file:`wapt-get.ini`.
fr: Pour un certificat commercial, vous pouvez paramétrer ``verify_cert`` = 1 dans :file:`wapt-get.ini`.

source: For a certificate issued by an internal Certificate Authority, you must place the certificate in the :file:`C:\\Program Files (x86)\\wapt\\ssl\\server\\ca.crt` folder and specify the certificate path in ``verify_cert`` in the agent's :file:`wapt-get.ini`.
fr: Pour un certificat issu d'un Certificat d'Authorité interne, vous devez placer le certificat dans le dossier :file:`C:\\Program Files (x86)\\wapt\\ssl\\server\\ca.crt` et renseigner le chemin du certificat dans ``verify_cert`` dans le :file:`wapt-get.ini`. de l'agent.

source: To apply the new configuration to your entire fleet, you can regenerate a WAPT agent with the appropriate settings.
fr: Pour appliquer la nouvelle configuration à tout votre parc, vous pouvez regénérer unagent WAPT avec les options appropriées.

source: Verifying the certificate in the WAPT console
fr: Vérifier les certificats dans la console WAPT

source: When the WAPT console first starts, it reads the content of :file:`C:\\Program Files (x86)\\WAPT\\wapt-get.ini` and it builds its configuration file :file:`C:\\Users\\admin\\AppData\\Local\\waptconsole\\waptconsole.ini`.
fr: Lorsque la console WAPT se lance pour la première fois, elle va lire le contenu de :file:`C:\\Program Files (x86)\\WAPT\\wapt-get.ini` et va créer son fichier de configuration dans :file:`C:\\Users\\admin\\AppData\\Local\\waptconsole\\waptconsole.ini`.

source: This properly sets the ``verify_cert`` attribute for the HTTPS communication between the WAPT console and the WAPT Server.
fr: Cela va configurer correctement l'attribut ``verify_cert`` pour les communications HTTPS entre la console WAPT et le serveur WAPT.
