Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/migration13-16/index.po
Languages: fr

source: Upgrading from WAPT 1.3 to 1.6
fr: Mettre à jour WAPT de 1.3 vers 1.6

source: documentation, WAPT, 1.3, 1.6, migration, upgrade,upgrading, 1.3.13
fr: Documentation, WAPT, 1.3, 1.6, migration

source: Two methods are available:
fr: Deux méthode sont à votre disposition :

source: the :ref:`minimal upgrade <minimal_upgrade>` consists of just migrating the WAPT packages without the inventory. It is the simpler method;
fr: La :ref:`mise à jour minimale <minimal_upgrade>` qui consiste à ne migrer que les paquets logiciel sans conserver l'inventaire ;

source: the :ref:`full upgrade <full_upgrade>` consists of migrating all data from the old WAPT Server;
fr: La :ref:`mise à jour complète <full_upgrade>` qui permet de migrer entièrement toutes les données de l'ancien serveur ;

source: Whether option 1 or 2 is chosen, there are two prerequisites:
fr: Quelque soit votre choix, deux prérequis sont nécessaire :

source: For the upgrade to work well, your Organization's WAPT **agents must all be in version 1.3.13 before upgrading** to 1.6. If not, the *waptupgrade* package will not work correctly. Otherwise, you may upgrade using GPOs;
fr: Pour que la mise à jour fonctionne correctement, les postes de votre parc doivent **tous** être en 1.3.13 avant de passer en version 1.6, dans le cas contraire, le paquet :program:`waptupgrade` ne fonctionnera pas correctement. A défaut, il vous reste la possibilité de faire une upgrade à travers le déploiement par GPO ;

source: **all** your machines to be upgraded must have the *waptupgrade* package installed;
fr: Les machines à mettre à jour doivent toutes avoir également installé le paquet *waptupgrade* ;

source: Tranquil IT offers fixed price contracts to help you upgrade from 1.3 to 1.6; you may contact us by calling +33(0)240 975 755.
fr: Des forfaits de mise à jour WAPT 1.3 vers WAPT 1.6 sont disponibles auprès de notre équipe commerciale au +33 (0) 240 975 755.

source: Minimal upgrade
fr: Mettre à jour à minima

source: This procedure also allows you to easily migrate your WAPT Server from Windows to Linux and vice versa.
fr: Cette procédure permet également la bascule facile d'un serveur WAPT Windows à Linux ou de Linux à Windows.

source: This procedure is the simplest.
fr: Cette procédure est la procédure la plus simple.

source: The minimal upgrade consists of migrating only WAPT base and group packages. Neither the inventory nor the host-packages will be kept.
fr: La migration à minima consiste à ne migrer que les paquets WAPT logiciels et groupes sans conserver le contenu de la base de données ni les paquets machines.

source: all informations stored in the WAPT database come from the WAPT agents, so no information will be lost;
fr: toutes les informations de la base de données viennent des postes, on ne perd aucune information d'inventaire ;

source: the inventory database will rebuild itself when the WAPT agent 1.6 equipped computers will re-register with the WAPT Server;
fr: la base de données d'inventaire se reconstruira au fur et à mesure que les postes redémarreront avec l'agent WAPT 1.6 et se ré-enregistreront ;

source: you will have to re-affect the packages to the hosts (no stress, it will not remove the software that are already installed);
fr: il faudra réattribuer les logiciels aux machines (pas de panique, cela ne désinstallera pas les paquets WAPT déjà installés) ;

source: you will just lose temporarily the list of your computers in the WAPT console;
fr: cette procédure fait perdre temporairement l'affichage des machines dans la console ;

source: this procedure does not allow to upgrade with the :program:`waptupgrade` package;
fr: cette procédure ne permet pas la mise à jour avec le paquet :program:`waptupgrade` ;

source: Complete upgrade
fr: Mise à jour majeure complète

source: This procedure upgrades completely your Organization's WAPT setup from 1.3 to 1.6 because it will migrate the database and WAPT base, group and host packages.
fr: Cette procédure est la procédure la plus complète car elle permet de migrer la base de donnée et les paquet WAPT machine, groupe et logiciels.

source: Upgrading the WAPT console and the WAPT agents
fr: Mettre à jour la console WAPT et les agents WAPT
