Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/migration13-16/migration-minima.po
Languages: fr

source: Migrating more easily from WAPT 1.3 to 1.6
fr: Migrer plus simplement de WAPT 1.3 à 1.6

source: upgrade, upgrading, WAPT, 1.3, 1.6, simple procedure, documentation
fr: migration, WAPT, 1.3, 1.6, Windows, documentation

source: This procedure is simpler than a complete migration, but some non essential data may be lost, breaking the chain of traceability.
fr: Cette procédure est plus simple qu'une migration complète, mais certaines données non essentielles peuvent être perdues, cassant la chaîne de traçabilité.

source: backup the WAPT files in:
fr: sauvegarder les paquets WAPT présents dans :

source: Linux: :file:`/var/www/wapt/` or :file:`/var/www/html/wapt/`;
fr: Linux : :file:`/var/www/wapt/` ou :file:`/var/www/html/wapt/` ;

source: Windows: :file:`C:\\wapt\waptserver\\repository\\wapt`;
fr: Windows : :file:`C:\\wapt\\waptserver\epository\\wapt` ;

source: Installing and re-importing the WAPT packages
fr: Installer WAPT et réimporter les paquets

source: If you are using a Windows based WAPT Server in 1.3.13, you must uninstall your 1.3.13 version before installing the 1.6 version.
fr: Si vous venez d'une version Windows 1.3.13 de WAPT, vous devez déinstaller la version 1.3.13 avant d'installer la version 1.6.

source: You may now follow the same procedure to do a :ref:`normal installation of the WAPT Server <installing_WAPT_Server>`.
fr: Vous pouvez maintenant suivre la procédure d'installation normale pour :ref:`installer un serveur WAPT <installing_WAPT_Server>`.

source: The WAPT Server must have the same DNS name as the previous WAPT Server (or the same IP if your WAPT agents find their WAPT Server using its IP address).
fr: Le serveur WAPT doit répondre au même nom DNS que l'ancienne installation (avoir la même IP si vos agents fonctionnent par IP).

source: If you want the :program:`waptupgrade` package to work, you will have to follow the procedure :ref:`to generate the necessary keys <key-regenerate>`.
fr: Si vous voulez que le paquet **waptupgrade fonctionne**, il vous faudra suivre la procédure pour :ref:`regénérer les clés <key-regenerate>`.

source: Stop at the section on **re-signing the packages on the repository**.
fr: Arrêter vous à la section **Re-signer les paquets du dépôt**.

source: Once the installation has finished, you may re-import all the WAPT packages that were saved using the :guilabel:`Import from file` button in the :guilabel:`Private repository` tab.
fr: Une fois l'installation terminée, vous pouvez ré-importer tous les paquets WAPT sauvegardés avec :guilabel:`Importer depuis un fichiers` dans l'onglet :guilabel:`Dépôt Privé`.

source: This operation will re-sign all the WAPT packages.
fr: Cette opération va re-signer tous les paquets.

source: Installing the new WAPT agent 1.6 on your computers
fr: Installer le nouvel agent WAPT 1.6 sur les postes

source: :ref:`recreate the WAPT agent <create_WAPT_agent>`, which will automatically upload the :program:`waptupgrade` package;
fr: relancer maintenant la :ref:`create_WAPT_agent` ce qui uploadera automatiquement un paquet **waptupgrade** ;

source: then, :ref:`update the GPO for deploying the WAPT agent <install_waptagent>`;
fr: puis vous pouvez mettre à jour la Stratégie de Groupe de Déploiement de l'agent WAPT en suivant la procédure pour :ref:`déployer les agents WAPT <install_waptagent>` ;

source: the :program:`waptupgrade` package will then automatically install on the computers that already had the package and finally, the WAPT agent will automatically upgrade when the computer shuts down;
fr: le paquet :program:`waptupgrade` s'installera ensuite automatiquement sur les poste qui l'avait déjà et l'agent WAPT se mettra à jour automatiquement à l'arrêt du poste ;
