Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-replication/wapt-replicate-to-multiple-repositories/syncthing-share-setup.po
Languages: fr

source: Those actions must be run on WAPT Server.
fr: Ces actions sont à effectuer sur le serveur WAPT.

source: In the list of shared folders (:guilabel:`Shares`):
fr: Dans la liste des dossiers partagés (:guilabel:`Partage`) :

source: add a shared folder with :menuselection:`Add a Share`;
fr: ajouter un dossier partagé avec :menuselection:`Add a Share` ;

source: fill in the path to the directory to be shared, ex: :file:`/var/www/wapt/`;
fr: renseigner le chemin du dossier à partager, ex : :file:`/var/www/wapt/` ;

source: in the scroll-down menu :menuselection:`Directory Type --> Only Send`;
fr: dans le menu déroulant :menuselection:`Type de partage --> Envoyer seulement` ;

source: in the scroll-down menu :menuselection:`File Recovery Order --> Older First`;
fr: dans le menu déroulant :menuselection:`Ordre de récupération des fichiers --> Les plus anciens en premier` ;

source: redo the same operation for wapt-host: :file:`/var/www/wapt-host/`;
fr: recommencer l'opération pour wapt-host: :file:`/var/www/wapt-host/` ;

source: add the remote repository to WAPT Server's Syncthing:
fr: ajouter la machine distante :

source: Once Syncthing has been installed on the main and remote repositories, recover the remote repository's ID (:menuselection:`Actions --> Show My ID`).
fr: Une fois Syncthing installé sur les deux appareils, récupérer l'ID de l'appareil distant (:menuselection:`Actions --> afficher mon ID`).

source: This unique identifier appears like
fr: Cet identifiant unique est de la forme

source: On the main repository, in the list of remote devices (:guilabel:`Other Devices`):
fr: Sur le serveur maître, dans la liste des appareils (:guilabel:`Autres appareils`) :

source: add the remote repository with :menuselection:`Add a Device`;
fr: :menuselection:`Ajouter un appareil` ;

source: fill in the ID of the remote repository;
fr: renseigner l'ID du dépôt distant ;

source: tick the checkbox for the shared folder :guilabel:`wapt` and :guilabel:`wapt-host`;
fr: cocher les partages :guilabel:`wapt` et :guilabel:`wapt-host` ;

source: On the remote repository, follow these steps:
fr: Sur le dépôt distant effectuer les actions suivantes :

source: the remote device receives a Syncthing notification that it has been approved and added to the main device's replication schedule;
fr: l'appareil distant reçoit une notification d'approbation d'ajout par l'appareil maître ;

source: the client receives a popup form asking to accept the synchronized shares :file:`wapt` and :file:`wapt-host`;
fr: le client reçoit ensuite une popup pour accepter les partages synchronisés :file:`wapt` et :file:`wapt-host` ;

source: The replication is now operational.
fr: La réplication est maintenant mise en place.
