Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver_update/migration13-16/migration_old_new_server.po
Languages: fr

source: Upgrading the WAPT Server in version 1.3 to a more recent x64 Linux distribution
fr: Mettre à jour le serveur WAPT 1.3 vers une version récente Linux x64

source: upgrade, WAPT, 1.3.13, x64, Linux, Debian, CentOS, RedHat, documentation
fr: mettre à jour, WAPT, 1.3.13, x64, Linux, Debian, CentOS, RedHat, documentation

source: Under Linux, you may save your MongoDB inventory with the command :code:`mongodump --db wapt --archive=/root/wapt.dump`.
fr: Sous Linux, vous devez sauvegarder toute votre base d'inventaire MongoDB avec la commande :code:`mongodump --db wapt --archive=/root/wapt.dump`.

source: if the :command:`mongodump` command is not available, you may install the utility with :code:`apt-get install mongo-tools`.
fr: Si la commande mongodump n'est pas disponible, vous pouvez l'installer avec la commande :code:`apt-get install mongo-tools`.

source: Launching :command:`mongodump` creates a :file:`dump` file, save it.
fr: Lorsque la commande :command:`mongodump` est lancée, un fichier :file:`dump` est créé, vous devez le sauvegarder.

source: You must also save your WAPT base and host packages. They are stored in :file:`/var/www/wapt/` and :file:`/var/www/wapt-host/`.
fr: Vous devez également sauvegarder vos paquets WAPT machine et logiciel. Ils sont stockés dans :file:`/var/www/wapt/` et :file:`/var/www/wapt-host/`.

source: When you will install your new x64 based WAPT Server, you will have to reinstall WAPT 1.3.13 before upgrading to 1.6:
fr: Lorsque vous allez installer votre nouveau serveur WAPT, vous devrez ré-installer une version 1.3.13 de WAPT avant de faire l'upgrade en version 1.6 :

source: https://www.wapt.fr/en/doc-1.3/Installation/waptserver/linux/index.html
fr: https://www.wapt.fr/fr/doc-1.3/Installation/waptserver/linux/index.html

source: You will now restore the WAPT base and host packages previously saved in :file:`/var/www/wapt/` and :file:`/var/www/wapt-host/` of your new x64 based WAPT Server.
fr: Vous allez ensuite pouvoir restaurer les paquets WAPT sauvegardés précédemment dans les dossiers :file:`/var/www/wapt/` et :file:`/var/www/wapt-host/` de votre nouveau serveur.

source: To restore the MongDB dump file, you may execute the command :code:`mongorestore /root/dump`.
fr: Pour restaurer la base MongoDB créée précédemment vous devez exécuter la commande :code:`mongorestore /root/dump`.

source: You may now follow the classic procedure to upgrade from 1.3.13 to 1.6:
fr: Vous pouvez maintenant suivre la procédure classique de mise à jour de WAPT 1.3.13 vers 1.6 :

source: for :ref:`Debian Linux <upgrade_1.3_1.6_debian>`;
fr: pour :ref:`Debian Linux <upgrade_1.3_1.6_debian>` ;

source: for :ref:`CentOS/ RedHat <upgrade_1.3_1.6_centos>`;
fr: pour :ref:`CentOS / RedHat <upgrade_1.3_1.6_centos>` ;
