Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver_update/migration13-16/suite-upgrade.po
Languages: fr

source: Finishing the upgrade process from 1.3.13 to 1.6
fr: Fin de la procédure de mise à jour 1.3.13 vers 1.6

source: backup, backing up, restoring, restore, server, WAPT, private key, Code Signing, waptupgrade, documentation
fr: Sauvegarder, Restaurer, serveur, WAPT, clé privée, Code Signing, waptupgrade, documentation

source: Defining a password for the Administrator's private key
fr: Définir un mot de passe sur la clé privée

source: The WAPT console has lost the path to the private key, it is normal because in 1.3 the WAPT console was pointing to the private key. Now in 1.5, the WAPT console points to the certificate associated with the private key.
fr: La console a perdu le chemin vers sa clé privée, c'est normal dans la version 1.3, la console pointait vers la clé privée. Depuis la version 1.5, la console pointe vers le certificat associé à la clé.

source: Go to :menuselection:`Tools --> Preferences --> Path to personal certificate`, then fill in the path to the new certificate.
fr: Rendez-vous donc dans :menuselection:`Outils --> Préférences --> Chemin du certificat personnel` et sélectionner le certificat issue de votre clé privée existante :

source: Select the private key certificate
fr: Sélectionner le certificate de la clé privée

source: WAPT 1.6 requires to protect the private key with a password to sign packages and actions.
fr: WAPT 1.6 nécessite un mot de passe sur la clé privée utilisée pour la signature des paquets et des actions.

source: In the WAPT console, go to :menuselection:`Tools --> Change the password of the private key`, then select your certificate and enter a password for your private key.
fr: Dans la console, aller dans :menuselection:`Outils --> Changer le mot de passe de la clé privée` puis sélectionnez votre certificat et choisissez un mot de passe pour la clé privée.

source: Generating a *Code Signing* certificate
fr: Générer un certificat *Code Signing*

source: WAPT 1.6 differentiates **Code Signing** certificates from simple **SSL** certificates.
fr: WAPT 1.6 différencie maintenant les certificats **Code Signing** des certificats **SSL** simples.

source: It is therefore necessary to regenerate a **Code Signing** certificate.
fr: Il faut donc regénérer un nouveau certificat **Code Signing**.

source: By default, WAPT 1.6 Community generates self-signed **Code Signing** certificates.
fr: Par défaut, WAPT 1.6 Community Edition génère des certificats Code Signing autosignés.

source: You must insure that the old certificate in :file:`C:\private\mykey.crt` and the key :file:`C:\private\mykey.pem` are present in :file:`C:\private`.
fr: Vous devez vous assurer que l'ancien certificat :file:`c:\\private\\wapt-private.crt` et la clé :file:`c:\\private\\wapt-private.pem` sont présents dans :file:`c:\\private`.

source: For packages to be deployed on the :term:`Organization`'s computers, all packages will have to be re-signed with a *Code Signing* certificate.
fr: Pour permettre l'installation des paquets sur les ordinateurs de l':term:`Organisation`, il faudra donc resigner tous les paquets en utilisant un certificat *Code Signing*.

source: To create the *Code Signing* certificate, in the WAPT console go to :menuselection:`Tools --> Generate a certificate`.
fr: Pour créer ce certificat, dans la console WAPT aller dans :menuselection:`Outils -->Générer un Certificat`.

source: Code Signing certificate
fr: Certificat Code Signing

source: Normally, you will not have to recreate a new key. Only the certificate will have to be changed. **You must enter the path to your key** (ex: :file:`C:\private\mykey.pem`).
fr: Normalement, vous n'avez pas à recréer une nouvelle clé. Seul le certificat sera changé. Dans chemin de la clé, **vous devez indiquer** votre clé :file:`c:\private\wapt-private.pem`.

source: Do not make changes to the informations on the certificate. If any information is changed, then you will not be able to migrate from 1.3.13 to 1.6 using the :program:`waptupgrade` procedure.
fr: Ne modifiez pas les informations du certificat. Si cette information est modifée, la mise à jour 1.3.13 vers 1.6 ne pourra pas être faite avec WAPT et le paquet :program:`waptupgrade` ne fonctionnera pas !

source: The WAPT console now asks you whether the new certificate should be added to the :file:`ssl` folder of the local WAPT agent, you can accept.
fr: La console vous demande maintenant si ce nouveau certificat doit être ajouté dans le dossier :file:`ssl` de l'agent WAPT, vous pouvez accepter.

source: Now that you have generated your new key you must now change the path to your personal certificate. The WAPT console must now point to this new certificate.
fr: Maintenant que vous avez généré votre nouvelle clé, vous devez à nouveau modifier le chemin vers le certificat personnel. La console doit maintenant pointer vers ce nouveau certificat.

source: New Code Signing certificate
fr: Nouveau certificat Code Signing

source: You may now delete the old certificate.
fr: Vous pouvez maintenant supprimer l'ancien certificat.

source: Re-signing the packages on your WAPT repositories
fr: Re-signer les paquets du dépôt

source: **All WAPT 1.3.13 must be re-signed** because WAPT 1.6 packages must be signed with a *Code Signing* certificate and hashed with sha256.
fr: **Les paquets 1.3.13 doivent être re-signés** avec la nouvelle procédure 1.6 qui intègre le certificat *Code-Signing* dans le paquet et utilise l'algorithme de hachage sha256.

source: You must temporarily copy your private key (:file:`.pem`) and the *Code Signing* certificate (:file:`.crt`) on your Linux based WAPT Server using :program:`WinSCP` or an equivalent tool.
fr: Transférer temporairement votre clé privée (:file:`.pem`) et le certificat **Code-Signing** (:file:`.crt`) sur le serveur WAPT en utilisant :program:`WinSCP` ou un utilitaire équivalent.

source: Temporarily upload your Code Signing certificate on the WAPT server
fr: Téléchargez temporairement votre certificat Code Signing sur le serveur WAPT

source: Then, connect with SSH to the Linux WAPT Server and re-sign all WAPT *base* packages with the new certificate:
fr: Se connecter en SSH sur le serveur, re-signer les paquets *base* en précisant le chemin du certificat :

source: The WAPT Server :term:`SuperAdmin` password is requested to access the database so to do the matching between :term:`FQDN` and their corresponding :term:`UUID` .
fr: Le mot de passe :term:`SuperAdmin` du serveur est demandé pour accéder à la base de données pour établir la correspondance entre les :term:`FQDN` et les :term:`UUID`.

source: Rename host packages with the UUID nomenclature:
fr: Renommer les paquets machine au format de nommage UUID :

source: The private key now password protected, the password is requested for signing the packages.
fr: La clé privée étant désormais protégée par un mot de passe, le mot de passe est demandé pour re-signer les paquets.

source: **DO NOT FORGET** to delete the private key (.pem) from the WAPT Server!
fr: N'oubliez pas de **SUPPRIMER la clé** (:file:`.pem`) du serveur après avoir re-signé les paquets !

source: Then, open a session on the Windows machine hosting the WAPT Server and re-sign all WAPT base packages with the new certificate:
fr: Se connecter en SSH sur le serveur, re-signer les paquets *base* en précisant le chemin du certificat :

source: The WAPT Server :term:`SuperAdmin` password is requested to access the database so to do the matching between FQDNs and their corresponding UUIDs.
fr: Le mot de passe :term:`SuperAdmin` du serveur est demandé pour accéder à la base de données.

source: Rename *host* packages with the UUID nomenclature:
fr: Renommer les paquets *host* au format de nommage UUID :

source: Generating the PostgreSQL database table for the group packages
fr: Générer la table des dépendances groupe

source: In WAPT 1.3, group filtering was done by scanning the :file:`Packages` index file in the :file:`wapt-host` folder of the WAPT Server.
fr: Dans la version 1.3 de WAPT, le filtrage par groupe était effectué en parcourant le fichier :file:`Packages` du dossier :file:`wapt-host` du serveur.

source: For performance reasons, the filtering is now done by querying a PostgreSQL database table. The table will fill in automatically as WAPT agents register with the WAPT Server 1.6.
fr: Pour des raisons de performance, ce filtrage est maintenant géré en parcourant une table PostgreSQL. Cette table sera alimentée au fur et à mesure en version WAPT 1.6.

source: To quickly regenerate the database table, the trick is to create a temporary group *mig-temp*.
fr: Pour regénérer rapidement cette table, l'astuce consiste a créer un groupe *mig-temp* dans WAPT.

source: You may then apply the *mig-temp* package to all WAPT clients from the WAPT console (:kbd:`CTRL+A` in the inventory, then :menuselection:`Right-click --> Add dependencies` and select the package *mig-temp*).
fr: Vous pouvez ensuite appliquer le paquet *mig-temp* à tous les clients WAPT depuis la console WAPT (:kbd:`CTRL+A` dans l'inventaire, puis :menuselection:`Clic droit --> Ajouter en dépendance` et sélectionnez le paquet *mig-temp*).

source: You may now revert the operation (:kbd:`CTRL+A` in the inventory, then :menuselection:`Right-click --> Remove dependencies` and select the package *mig-temp*).
fr: Faire l'opération inverse. (:kbd:`CTRL+A` dans l'inventaire, puis :menuselection:`Clic-droit --> Supprimer des dépendances` et sélectionner *mig-tempo*).

source: The filtering of groups should be operational again.
fr: Le filtrage groupe devrait à nouveau fonctionner.

source: Ugrading WAPT agents
fr: Mettre à jour les clients WAPT

source: You may now follow the procedure to :ref:`create the new WAPT agent <create_WAPT_agent>`.
fr: Vous pouvez maintenant suivre la :ref:`procédure pour créer l'agent WAPT <create_WAPT_agent>` !!

source: The version update implies a change in the way packages are signed.
fr: Le changement de branche modifie le mode de signature.

source: If you update from 1.3.13, the WAPT package :program:`waptupgrade` should install correctly if you check the box :guilabel:`sign waptupgrade with sha256 AND sha1` while generating the WAPT agent.
fr: Si vous mettez à jour depuis la version 1.3.13, le paquet :program:`waptupgrade` devrait s'installer correctement si vous cochez la case :guilabel:`signer waptupgrade en sha256 ET sha1` lors de la génération de l'agent wapt.

source: If your WAPT agents are in a version that is less than 1.3.13, the package :program:`waptupgrade` **will not work**.
fr: Si vos agents sont dans une version inférieure à 1.3.13, le paquet :program:`waptupgrade` **ne fonctionnera pas**.

source: You may choose instead to use a :command:`waptdeploy` GPO to :ref:`deploy the new WAPT agent on your installed base of PCs <install_waptagent>`.
fr: Vous pouvez mettre en place une GPO :command:`waptdeploy` pour :ref:`déployer le nouvel agent WAPT sur votre parc <install_waptagent>`.

source: Installing waptupgrade on the computers
fr: Lancer l'installation de waptupgrade sur les clients

source: With version 1.6, it is no longer possible to directly contact WAPT agents in an inferior version from the WAPT console.
fr: Dans la version 1.6 il n'est plus possible de contacter les clients < 1.6 depuis la console WAPT.

source: To allow you to install the *waptupgrade* package on 1.3.13 computers, we have designed a small script.
fr: Pour vous permettre de lancer l'installation du paquet *waptupgrade* sur les 1.3 nous avons prévu un petit script.

source: You may thus launch the script:
fr: Vous pouvez donc lancer ce script :
