Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-replication/wapt-work-with-repositories/index.po
Languages: fr

source: Multi-repository is now supported by WAPT. This functionality is useful in several use cases:
fr: Le multi-dépôt est maintenant géré par WAPT ; cette fonctionnalité est utile dans différents cas :

source: to use a secondary private repository, hosting business application packages, independently of your main repository;
fr: pour utiliser un dépôt privé servant à héberger les applications métier propres à la structure en complément d'un autre dépôt ;

source: to have remote repositories closer to users in a multi-site architecture scenario;
fr: pour avoir des dépôts privés à proximité des utilisateurs dans un scénario multi-établissements ;

source: to allow the usage of an open repository and a secondary repository with restricted access (licensed software..);
fr: pour permettre l'usage de dépôts hébergeant des applications en libre service et des dépôts avec restrictions d'accès (logiciels soumis à licences ...) ;

source: Multi-repository WAPT architecture
fr: Le multi-dépôts avec WAPT

source: When using repositories with different signers, the additional signer's public certificates must be added to :file:`C:\\Program Files (x86)\\wapt\\ssl`. You then must deploy WAPT agent with both keys.
fr: Dans le cas où les paquets peuvent être signés avec deux clés privées différentes, il faudra ajouter les différents certificats publics dans le dossier :file:`C:\Program Files (x86)\wapt\ssl` de l'agent WAPT déployé.

source: Please refer to the documentation to :ref:`create the WAPT agent <create_WAPT_agent>`.
fr: Voir la documentation :ref:`pour créer l'agent WAPT <create_WAPT_agent>`.

source: Configuring the WAPT agents
fr: Paramétrer les agents WAPT

source: *repositories* parameter:
fr: paramètre *repositories* :

source: The parameter *repository* in the ``[global]`` section of the :file:`wapt-get.ini` file allows to set several options for package repositories, for example *private* and *tranquilit* sections here, where their settings are set in additional sections of that file.
fr: Le paramètre *repositories*, dans la section ``[global]`` permet de consulter plusieurs dépôts, par exemple ``[private]`` et ``[tranquilit]`` ici, dont les paramètres sont à indiquer dans des sections supplémentaires en fin du fichier :file:`wapt-get.ini`.

source: settings of secondary repositories
fr: paramètres des dépôts secondaires :

source: With that configuration, WAPT clients will now see packages from the main repository and from the secondary repository.
fr: Avec cette configuration, le client verra maintenant les paquets disponibles sur le dépôt secondaire en plus du dépôt principal.

source: The WAPT agents will look for updates on both repositories.
fr: L'agent WAPT ira rechercher des mises à jours dans les deux dépôts.

source: Packages from the secondary repository will also be visible using the web interface http://127.0.0.1:8088 on WAPT equipped devices.
fr: Les paquets du dépôt secondaire sont également visibles sur l'interface web http://127.0.0.1:8088 du poste équipé de l'agent WAPT.

source: Configuring the WAPT console with several private repositories
fr: Paramétrer la console WAPT avec plusieurs dépôts privés

source: After having configured the WAPT agent for using multiple repositories, we can make the two repositories show up in the WAPT console.
fr: Après avoir paramétré les agents WAPT pour utiliser deux dépôts, on peut faire apparaître ces deux dépôts simultanément dans la console.

source: To do so, modify :file:`%appdata%\local\waptconsole\waptconsole.ini` file:
fr: Pour cela, modifier le fichier :file:`%appdata%\..\local\waptconsole\\waptconsole.ini` :
