Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/waptagent/index.po
Languages: fr

source: Building the WAPT agent installer
fr: Générer l'installeur de l'agent WAPT

source: waptagent.exe, installeur, InnoSetup, documentation, WAPT
fr: waptagent.exe, installeur, InnoSetup, WAPT, documentation

source: Choosing the mode to uniquely identify the WAPT agents
fr: Choisir le mode d'identification unique des agents WAPT

source: In WAPT you can choose the unique identification mode of the agents.
fr: Dans WAPT, vous pouvez choisir le mode d'identification unique des agents.

source: When a WAPT agent registers the server must know if it is a new machine or if it is a machine already registered.
fr: Lorsqu'un agent WAPT s'enregistre, le serveur doit savoir s'il s'agit d'une nouvelle machine ou s'il s'agit d'une machine déjà enregistrée.

source: For this, the WAPT server looks at the unique number "UUID" in the inventory.
fr: Pour cela, le serveur WAPT examine le numéro unique "UUID" dans l'inventaire.

source: WAPT offers 3 modes of operation to help you distinguish between hosts, it is up to you to choose the mode that best suits you.
fr: Le WAPT propose 3 modes de fonctionnement pour vous aider à distinguer vos machines, c'est à vous de choisir le mode qui vous convient le mieux.

source: When choosing a mode of operation it is difficult to change it, think carefully!
fr: Lorsqu'on choisit un mode de fonctionnement, il est difficile de le changer, donc réfléchissez le bien !

source: Identifying the WAPT agents by their BIOS UUID (serial number)
fr: Identification des agents WAPT par leur BIOS UUID (numéro de série)

source: This mode of operation makes it possible to identify the machines in the console in a physical manner.
fr: Ce mode de fonctionnement permet d'identifier les machines de la console de manière physique.

source: If you replace a computer and give the new computer the same name as the previous one, you will have two computers that will appear in the WAPT console since you will have physically two different computers.
fr: Si vous remplacez un ordinateur et vous donnez au nouvel ordinateur le même nom que le précédent, vous aurez deux ordinateurs qui apparaîtront dans la console WAPT puisque vous aurez physiquement deux ordinateurs différents.

source: Some vendors do crappy work and assign the same BIOS UUIDs to entire batches of computers. In this case, WAPT will only see one computer ...
fr: Certains fabricants font de la merde et attribuent les mêmes UUID BIOS à des lots entiers d'ordinateurs. Dans ce cas, le WAPT ne verra qu'un seul ordinateur ...

source: Identifying the WAPT agent by host name
fr: Identification de l'agent WAPT par son nom d'hôte

source: This mode of operation is similar to that in Active Directory. The machines are identified by their hostname.
fr: Ce mode de fonctionnement est similaire à celui d'Active Directory. Les machines sont identifiées par leur nom d'hôte.

source: This mode does not work if several machines in your fleet share the same name. We all know it should not happen!!
fr: Ce mode ne fonctionne pas si plusieurs machines de votre parc portent le même nom. Nous savons tous que cela ne devrait pas arriver !!

source: Identifying the WAPT agents with a randomly generated UUID
fr: Identifier les agents WAPT avec un UUID généré de manière aléatoire

source: This mode of operation allows PCs to be identified by their WAPT installation. Each installation of WAPT generates a unique random number. If you uninstall WAPT and then reinstall it, you will see a new pc appear in your console.
fr: Ce mode de fonctionnement permet d'identifier les PC par leur installation WAPT. Chaque installation de WAPT génère un numéro aléatoire unique. Si vous désinstallez WAPT de l'ordinateur puis vous réinstallez WAPT, alors vous verrez apparaître un nouveau PC dans votre console.

source: The :program:`waptagent` binary is an InnoSetup installer.
fr: L'installeur :program:`waptagent` est un installeur InnoSetup.

source: Once the WAPT console has been installed on the :term:`Administrator` computer, we have all files required to build the WAPT agent installer.
fr: Une fois la console WAPT installée sur le poste de l':term:`Administrateur`, on dispose de tous les fichiers nécessaires pour compiler l'installeur WAPT :

source: files that will be used during building of the WAPT agent are located in :file:`C:\\Program Files (x86)\\wapt`;
fr: les fichiers qui seront utilisés pour créer l'installeur se trouvent dans le répertoire d'installation :file:`C:\Program Files (x86)\wapt` ;

source: installer source files (:file:`.iss` files) are located in :file:`C:\\Program Files (x86)\\wapt\\waptsetup`;
fr: C:\\Program Files (x86)\\wapt\\

source: Before building the WAPT agent, please verify the public certificate(s) in :file:`C:\\Program Files (x86)\\wapt\\ssl`.
fr: C:\\Program Files (x86)\\wapt\\

source: If you wish to deploy other public certificates on your :term:`Organization`'s computers that are equipped with WAPT, you will have to copy them in that folder.
fr: Si vous souhaitez déployer d'autres certificats publics sur les ordinateurs de l':term:`Organisation` équipés de WAPT, il faudra les copier dans ce dossier.

source: **DO NOT COPY the private key** of any :term:`Administrator` in :file:`C:\\Program Files (x86)\\wapt`.
fr: **NE PAS COPIER votre clé privée** d\':term:`Administrateur` dans :file:`C:\\Program Files (x86)\wapt`.

source: This folder is used when building the WAPT agent and the private keys would then be deployed on all the computers.
fr: Ce dossier est utilisé pour créer l'agent WAPT et votre clé privée se retrouverait déployée sur l'ensemble du parc.

source: In the WAPT console, go to :menuselection:`Tools --> Build the WAPT agent`.
fr: dans la console WAPT, ouvrir :menuselection:`Outils --> Créer un agent WAPT` ;

source: Generate the WAPT agent from the console
fr: Générateur l'agent WAPT à partir de la console

source: fill in the informations that are necessary for the installer:
fr: renseigner les informations nécessaires à l'installeur :

source: the field :guilabel:`Public certificate`: **required**;
fr: le champ **obligatoire** :guilabel:`Certificat public` ;

source: example : :file:`C:\\private\\mydomain.crt`
fr: exemple : :file:`C:\\private\\mydomain.crt`

source: the field :guilabel:`Address of the WAPT repository`: **required**;
fr: le champ :guilabel:`Adresse du dépôt WAPT` : **obligatoire** ;

source: example : https://srvwapt.mydomain.lan/wapt
fr: exemple : https://srvwapt.mydomain.lan/wapt

source: the field :guilabel:`Address of the WAPT Server`: **required**;
fr: le champ :guilabel:`Adresse du serveur WAPT` : **obligatoire** ;

source: example : https://srvwapt.mydomain.lan
fr: exemple : https://srvwapt.mydomain.lan

source: the checkbox :guilabel:`Verify the WAPT Server HTTPS certificate`;
fr: la case à cocher :guilabel:`Vérifier le certificat HTTPS du serveur` ;

source: the field :guilabel:`Path to the bundle of certificates` to verify the HTTPS certificate of the WAPT Server;
fr: le champ :guilabel:`Chemin du bundle de certificats` pour vérifier le certificat HTTPS du serveur ;

source: the checkbox :guilabel:`Use Kerberos for registering WAPT agents`;
fr: la case à cocher :guilabel:`Utiliser Kerberos pour l'enregistrement` initial des agents WAPT avec le serveur ;

source: the field :guilabel:`Organization` to identify the origin of WAPT packages;
fr: le champ :guilabel:`Organisation` pour identifier l'origine des paquets ;

source: the field :guilabel:`Sign waptupgrade with both sha256 and sha1` can be ignored because it is only useful when upgrading from version 1.3;
fr: le champ :guilabel:`Signer waptupgrade en sha256 et sha1` peut maintenant être ignoré car il n'est utile que lors d'une mise à jour depuis une version 1.3 vers 1.5 ;

source: the field :guilabel:`Use computer FQDN for UUID` and :guilabel:`Use random host UUID (for buggy BIOS)` (see explanation in the previous paragraph of this documentation);
fr: le champ :guilabel:`Utilise le FQDN de l'ordinateur comme UUID` et :guilabel:`Utilise un UUID aléatoire (for buggy BIOS)` (voir explication dans le paragraphe précédent de cette documentation) ;

source: the field :guilabel:`Enable AD Groups` enables the installation of profile packages based on the Active Directory groups of which the machine is a member. **This feature can degrade the performance of WAPT**;
fr: le champ :guilabel:`Activer les groupes AD` permet l'installation de paquets de profil basés sur les groupes Active Directory dont la machine est membre. **Cette fonctionnalité peut dégrader les performances du WAPT** ;

source: the field :guilabel:`Append host's profiles` allows to define a list of WAPT packages to install obligatorily;
fr: le champ :guilabel:`Ajouter au profil de machine` permet de définir une liste de paquets WAPT à installer obligatoirement ;

source: the field :guilabel:`Automatic periodic packages audit scheduling` define the frequency at which the WAPT agent checks whether it has audits to perform;
fr: le champ :guilabel:`Programmation des audits de paquet` définit la fréquence à laquelle l'agent WAPT vérifie s'il a des audits à effectuer ;

source: Windows update section, refer to :ref:`this article on configuring WAPTWUA on the WAPT agent <wapt_wua_agent>`;
fr: Pour les mises à jour Windows, voir :ref:`cet article sur la configuration de WAPTWUA sur l'agent WAPT <wapt_wua_agent>` ;

source: The checkbox **Use Kerberos for the initial registration** must be checked **ONLY IF** you have followed the documentation on **Configuring the Kerberos authentication**.
fr: La case **Utiliser l'enregistrement kerberos pour l'enregistrement initial** doit être activé **UNIQUEMENT** si vous avez suivi la documentation **Configurer l'authentification Kerberos**.

source: The checkbox **Verify the WAPT Server HTTPS certificate**must be checked **ONLY IF** you have followed the documentation on **Activating the verification of the SSL / TLS certificate**.
fr: La case **Utiliser l'enregistrement kerberos pour l'enregistrement initial** doit être activé **UNIQUEMENT** si vous avez suivi la documentation **Configurer l'authentification Kerberos**.

source: Fill in the informations on your Organisation
fr: Renseigner les informations sur l'Organisation

source: provide the password for unlocking the private key:
fr: renseignez le mot de passe de la clé privée :

source: Provide the password for unlocking the private key
fr: Entrer le mot de passe de la clé privée

source: Progression of WAPT agent installer building
fr: Progression de la création de l'installeur de l'agent WAPT

source: Once the WAPT agent installer has finished building, a confirmation dialog pops up indicating that the :program:`waptagent` binary has been successfully uploaded to https://srvwapt/wapt/.
fr: Une fois la compilation terminée, une confirmation s'affiche informant que le :program:`waptagent` a bien été chargé sur https://srvwapt.mydomain.lan/wapt/.

source: Confirmation of the WAPT agent loading onto WAPT repository
fr: Confirmation du chargement de l'agent WAPT sur le serveur WAPT

source: A warning shows up indicating that the GPO hash value should be changed. GPOs may be used to deploy the WAPT agent on your Organization's computer.
fr: Un avertissement apparaît pour rappeler de changer la valeur du hash dans la GPO de déploiement de l'agent WAPT.

source: Updating the WAPT agents
fr: Mettre à jour les agents WAPT

source: The ``test-waptupgrade`` package has also been uploaded on the repository.
fr: Le paquet ``test-waptupgrade`` a également été chargé sur le dépôt.

source: The ``test-waptupgrade`` package contains the WAPT agent with arguments specified during the installation of WAPT on your Administrator's computer.
fr: Ce paquet WAPT contient l'agent WAPT avec les paramètres spécifiés lors de l'installation.

source: New WAPT agent in the repository
fr: Nouvel agent dans le dépôt WAPT

source: This package is a standard WAPT package designed to upgrade WAPT agents on client machines.
fr: Ce paquet permettra de mettre à jour les agents WAPT du parc lorsqu'une mise à jour de l'agent WAPT sera rendue disponible.

source: Upgrading the WAPT agents using the *xxx-waptupgrade* package is a two step process:
fr: Mettre à niveau les agents WAPT à l'aide du paquet *xxx-waptupgrade* est un processus en deux étapes :

source: first the package copies the new :file:`waptagent.exe` file on the client computer and creates a new scheduled task that will run :program:`waptagent.exe` with predefined installation flags two minutes after the creation of the scheduled task. At that point the package itself is installed and the inventory on the server shows the package installation as *OK*, with correct version installed, but the inventory will still show the old version as the agent is not yet updated.
fr: le paquet copie d'abord le nouveau fichier :file:`waptagent.exe` sur l'ordinateur client et crée une nouvelle tâche programmée qui exécutera :program:`waptagent.exe` deux minutes après la création de la tâche programmée. À ce moment, le paquet lui-même sera installé et l'inventaire sur le serveur indiquera que l'installation du paquet est *OK*, avec la version correcte installée, mais l'inventaire affichera toujours l'ancienne version car l'agent n'aura pas encore été mis à jour.

source: From an administrator point of view, looking at the console you will see the following steps:
fr: Du point de vue d'un administrateur, en regardant la console, vous verrez les étapes suivantes :

source: *xxx-waptupgrade* is installed, the machine is up to date from a package list point of view, but the version in the inventory is still the old version of the WAPT agent;
fr: *xxx-waptupgrade* est installé, la machine est à jour du point de vue de la liste des paquets, mais la version dans l'inventaire est toujours l'ancienne version de l'agent WAPT ;

source: after two minutes the computer connectivity status switches to *disconnected* as the WAPT agent is updated;
fr: après deux minutes, l'état de la connectivité de l'ordinateur passe à *déconnecté* pendant que l'agent WAPT est mis à jour ;

source: after around two minutes the client computer gets back up online in the console and updates its inventory and shows the new version;
fr: après environ deux minutes, l'ordinateur client se remet en ligne dans la console, met à jour son inventaire et affiche la nouvelle version ;

source: What can go wrong during the upgrades
fr: Ce qui peut mal se passer lors des mises à niveau

source: the most common issue with the upgrading process is the local antivirus blocking the installation (WAPT is a software installer that keeps a websocket opened to a central management server, so this behavior may be flagged as suspicious by an antivirus, even though this method is the basis of end point management...). **If you have an issue when deploying the upgrade, please check your antivirus console and whitelist the waptagent.exe**. Another option is to re-sign the :program:`waptagent.exe` binary if your organisation has an internal code signing certificate;
fr: le problème le plus courant lors du processus de mise à niveau est le blocage de l'installation par un antivirus local (le WAPT est un installateur de logiciels qui maintient une fenêtre Web ouverte sur un serveur de gestion central, ce comportement peut donc être signalé comme suspect par un antivirus, même si cette méthode est à la base de la gestion des points finaux...). **Si vous avez un problème lors du déploiement de la mise à jour, veuillez vérifier votre console antivirus et mettre en liste blanche le waptagent.exe**. Une autre option est de re-signer le binaire :program:`waptagent.exe` si votre organisation possède un certificat de signature de code interne ;

source: the second most common issue is that for some reasons another program is locking a :mimetype:`DLL` that ships with WAPT. This can happen with poorly designed software installers that pick up the local %PATH% variable first and then find WAPTs own openssl or python DLL;
fr: le deuxième problème le plus courant est que, pour certaines raisons, un autre programme verrouille un :mimetype:`DLL` qui est livré avec le WAPT. Cela peut arriver avec des installateurs de logiciels mal conçus qui commencent par prendre la variable locale %PATH% et qui trouvent ensuite des DLL openssl ou python propres embarquées avec WAPT ;

source: the third most common issue is a defective Windows install that does not run scheduled tasks properly, and yes we have seen this!!
fr: le troisième problème le plus courant est une installation de Windows défectueuse qui n'exécute pas correctement les tâches programmées, et oui nous avons déjà vu ça !!
