Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-exe/index.po
Languages: fr

source: Simple .exe package
fr: Packager des paquets \*.exe simples

source: Variation compared to MSI
fr: Variation par rapport aux MSI

source: Since WAPT version 1.3.12, a new method for quickly building WAPT packages from the WAPT console has been made available.
fr: Depuis la version 1.3.12 de WAPT, une nouvelle méthode de création rapide de paquets depuis la console WAPT est devenue disponible.

source: This part of the documentation is still actual, we recommend however that you use the WAPT console to instantiate your package templates, see :ref:`creation_paquets_console`.
fr: Cette documentation est toujours d'actualité, nous vous conseillons cependant d'utiliser l'interface graphique pour instancier vos modèles de paquets. voir : :ref:`creation_paquets_console`.

source: download the exe installer from a reliable source;
fr: obtenir l'installeur exe depuis une source sûre ;

source: Download the installer in exe format (for example: `Firefox ESR x64 <https://download.mozilla.org/?product=firefox-45.6.0esr-SSL&os=win64&langerr>`_):
fr: Télécharger l'installeur au format \*.exe (par exemple `Firefox ESR x64 <https://download.mozilla.org/?product=firefox-esr-latest-ssl&os=win64&lang=fr>`_) :

source: look up documentation relating to silent flags;
fr: rechercher la documentation associée pour les flags silencieux ;

source: On the `Official Mozilla website <https://wiki.mozilla.org/Installer:Command_Line_Arguments>`_;
fr: sur le site de la `Fondation Mozilla <https://wiki.mozilla.org/Installer:Command_Line_Arguments>`_ ;

source: other methods for finding information on silent flags:
fr: autres méthodes pour récupérer le flag silencieux :

source: `WPKG packages repository <https://wpkg.org/Firefox#Firefox_19_-_45_.28For_current_versions_of_WPKG.29>`_;
fr: dépôt de `paquets WPKG <https://wpkg.org/Firefox#Firefox_19_-_45_.28For_current_versions_of_WPKG.29>`_ ;

source: `Chocolatey packages repository <https://chocolatey.org/packages/FirefoxESR>`_;
fr: dépôt de `paquets Chocolatey <https://chocolatey.org/packages/FirefoxESR>`_ ;

source: search on the Internet with the search terms: *Firefox silent install*;
fr: recherche Internet avec le terme "Firefox silent install" ;

source: create a base template from the EXE file
fr: Créer un template de base de paquet à partir de l'EXE

source: start up a Windows Command Line utility :program:`cmd.exe` as :term:`Local Administrator`;
fr: lancer une invite de commande (cmd.exe) en mode :term:`Administrateur Local` ;

source: Launching the Windows Command Line utility as Local Administrator
fr: Lancement de l'invite de commande Windows en tant qu'Administrateur Local

source: create a WAPT package template;
fr: créer un projet de paquet logiciel ;

source: Example with Mozilla Firefox ESR:
fr: **Exemple avec Mozilla Firefox ESR** :

source: PyScripter loads up and opens open the \*.exe package project.
fr: :program:`PyScripter` s'ouvre ensuite avec le projet du paquet \*.exe.

source: PyScripter opening with focus on the *control* file
fr: PyScripter affichant le fichier *control*

source: check the *control* file content;
fr: Vérifier le fichier *control*

source: Mozilla Firefox-ESR doesn't comply to industry standards and returns an erroneous version number (it appears to be the installer packaging software version number).
fr: Mozilla Firefox-ESR ne répond pas aux standards et retourne un numéro de version erroné (il s'agit du numéro de version du logiciel qui créé l'installeur).

source: Original *control* file
fr: Fichier *control* d'origine

source: Modified *control* file
fr: Fichier *control* modifié

source: It is to be noted that a sub-version *-1* has been added. It is the packaging version of WAPT package.
fr: Une sous-version *-1* a été ajoutée. C'est la version de packaging du paquet WAPT.

source: It allows the Package Developer to release several WAPT package versions of the same software.
fr: Cela permet de ne pas modifier la version réelle du logiciel quand on pousse par exemple une nouvelle configuration du même logiciel sur le parc.

source: check the *setup.py* file
fr: vérifier le fichier *setup.py*

source: WAPT has added a generic silent */VERYSILENT* flag that may or may not work with Mozilla Firefox ESR.
fr: WAPT a mis un flag silencieux générique */VERYSILENT* qui ne fonctionne peut-être pas avec Mozilla Firefox ESR.

source: In that case, we will replace the suggested silent flag with the one that we found in the Mozilla documentation.
fr: Dans ce cas il convient d'indiquer le bon flag silencieux que nous avons recherché précédemment :

source: make changes to the code in the :file:`setup.py` file accordingly;
fr: changer le code du fichier :file:`setup.py` en conséquence ;

source: save the package;
fr: enregistrer le paquet ;

source: Managing the uninstallation
fr: Gérer la désinstallation

source: With an exe installer, the *uninstall key* is not available until the software has been installed once.
fr: Avec un exe, la clé de désinstallation n'est pas disponible sans avoir installé le logiciel une première fois.

source: The *uninstall key* is available in the Windows registry:
fr: Cette clé est disponible dans la base de registre :

source: open a Windows Command Line :program:`cmd.exe` prompt;
fr: ouvrir une invite de commande Windows ;

source: retrieve the software *uninstall key* with :code:`wapt-get list-registry firefox`
fr: récupérer la clé de désinstallation avec :code:`wapt-get list-registry firefox`

source: copy the *uninstall key* **UninstallKey**: *Mozilla Firefox 45.4.0 ESR (x64 en)*;
fr: copier la clé de désinstallation **UninstallKey** : *Mozilla Firefox 52.6.0 ESR (x64 fr)* ;

source: make changes to the :file:`setup.py` file with the correct *uninstall key*;
fr: modifier en conséquence le script :program:`setup.py` avec la clé de désintallation correcte ;

source: The *UninstallKey* must be the exact same as the one listed with :command:`list-registry` command. The *UninstallKey* may be a GUID such as *95160000-0052-040C-0000-0000000FF1CE*, a GUID with bracketed characters, *{95160000-0052-040C-0000-0000000FF1CE}*, or simply a character string such as *Git_is1* or *Mozilla Firefox 52.6.0 ESR (x64 fr)*.
fr: La clé de désinstallation doit être exactement la même que celle listée avec la commande `list-registry`. La clé de désinstallation peut être un GUID tel que *9516000000-0052-040C-0000-0000000FF1CE*, un GUID avec des caractères entre crochets, *{95160000-0052-040C-0000-0000000FF1CE}*, ou simplement une chaîne de caractères comme *Git_is1* ou *Mozilla Firefox 52.6.0 ESR (x64fr)*.

source: relaunch the package setup to set the correct *uninstall key* in the local WAPT database;
fr: relancer l'installation du paquet afin que la clé de désinstallation soit prise en compte dans la base de données locale WAPT ;

source: test uninstalling the package;
fr: tester la désinstallation du paquet ;

source: launch a :guilabel:`remove` from PyScripter :guilabel:`Run Configurations`;
fr: lancer un :command:`remove` du paquet depuis le panneau :guilabel:`Run Configurations` de :program:`PyScripter` ;

source: After uninstallation, the software is correctly removed
fr: À l'issue de la désinstallation, le programme est désinstallé.

source: We can notice the correct uninstallation by launching again the :command:`wapt-get list-registry` command.
fr: On pourra vérifier l'absence de clé de registre de désinstallation en relançant la commande :command:`wapt-get list-registry`.

source: Specific case of a non-silent uninstaller
fr: Cas particulier d'un désinstalleur non-silencieux

source: It sometimes occurs that the software installs silently, but does not uninstall silently.
fr: Il arrive dans certains cas que le programme s'installe silencieusement mais que le désinstalleur ne s'exécute pas silencieusement.

source: In that precise case it is necessary to override the :command:`uninstall()` function.
fr: Dans ce cas précis on va surcharger la fonction :command:`uninstall()`.

source: Example with Mozilla Firefox:
fr: Exemple avec Mozilla Firefox si cela était nécessaire :

source: In the :command:`uninstall()` function, it is not possible to call for files included inside the WAPT package. To call files from the package, it is necessary to copy/ paste the files in a temporary directory during package installation.
fr: Dans la fonction :command:`uninstall()`, on ne peut pas appeler des fichiers contenus dans le paquet WAPT. Pour les appeler, il faudra avoir copié les fichiers dans un répertoire local de la machine lors de l'installation du paquet.

source: Build and upload the package
fr: Construire et charger le paquet WAPT

source: Once the installation and the de-installation are configured and tested and the package is customized to your satisfaction, you may build and upload your new WAPT package onto your WAPT repository.
fr: Une fois l'installation et la désinstallation configurées et testées vous pouvez effectuer un :command:`build-upload` pour charger votre nouveau paquet WAPT sur votre dépôt.
