Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/wapt-deploy/index.po
Languages: fr

source: Deploying the WAPT agent for Windows
fr: Déployer l'agent WAPT

source: waptagent.exe, waptsetup.exe, deployment, deploy, deploying, documentation, WAPT
fr: waptagent.exe, waptsetup.exe, déployer

source: Two methods are available to deploy the :program:`waptagent.exe`.
fr: Deux méthodes sont possibles pour déployer l'utilitaire :program:`waptagent.exe`.

source: The first method is manual and the procedure must be applied on each machine.
fr: La première est manuelle et la procédure doit être appliquée sur chaque machine.

source: The second one is automated and relies on :abbr:`GPO (Group Policy Objects)`.
fr: La deuxième est automatique et s'appuie sur les :abbr:`GPO (Group Policy Objects / Stratégies de Groupes)`.

source: The :program:`waptagent.exe` installer is available at http://<wapt.mydomain.lan>/wapt/waptagent.exe.
fr: L'installeur :program:`waptsetup.exe` est disponible à l'adresse suivante : https://wapt.mydomain.lan/wapt/waptagent.exe

source: If you do not sign the :program:`waptagent.exe` installer with a commercial ``Code Signing`` certificate or a ``Code Signing`` certificate issued by the :term:`Certificate Authority` of your Organization after having generated it, web browsers will show a warning message when downloading the installer. To remove the warning message, you must sign the :mimetype:`.exe` with a ``Code Signing`` certificate that can be verified by a CA bundle stored in the machine's certificate store.
fr: Si vous ne signez pas le fichier :file:`waptagent.exe` avec un certificat ``Code Signing`` commercial ou bien issu par l':term:`Autorité de Certification` de votre Organisation après l'avoir généré, les navigateurs web provoqueront un message d'alerte lors du téléchargement. Pour supprimer ce message d'alerte, il faut signer le fichier :file:`.exe` avec un certificat ``Code Signing`` reconnu par le bundle de CA installé dans la magasin de certificats de la machine.

source: When to deploy the WAPT agent manually?
fr: Dans quelles situations déployer WAPT manuellement ?

source: Manual deployment method is efficient in these cases:
fr: La méthode manuelle de déploiement est efficace dans les situations suivantes :

source: testing WAPT;
fr: tester WAPT ;

source: using WAPT in an organization with a small number of computers, etc;
fr: maintenir à jour un petit parc de PC dans une petite entreprise, une association, etc ;

source: Deploying waptagent.exe automatically
fr: Déployer manuellement l'agent WAPT

source: This operation requires :term:`Local Administrator` rights on the local computer.
fr: Cette manipulation requiert les droits d':term:`Administrateur Local` sur la machine.

source: Installing *waptagent.exe*
fr: Installer *waptagent.exe*

source: choose the language and click on :guilabel:`Next` to go to next step;
fr: choisir la langue pour l'installation puis cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: Choose the installation language
fr: Choisir la langue pour l'installation

source: accept the license terms and click on :guilabel:`Next` to go to next step;
fr: accepter la licence puis cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: Accepting the EULA
fr: Accepter la licence

source: choose the installation directory and click on :guilabel:`Next` to go to next step;
fr: choisir le répértoire d'installation puis cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: Select the installation folder for the WAPT agent
fr: Sélectionner le répertoire d'installation de l'agent WAPT

source: choose the additional parameters and click on :guilabel:`Next` to go to next step;
fr: choisir les tâches complémentaires puis cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: leave :guilabel:`Force-reinstall VC++ enabled` checked. If the option box is ticked it is because its installation is necessary.
fr: Laisser coché :guilabel:`Force-reinstall VC++`. Si l'option est cochée, c'est que l'installation du composant est nécessaire.

source: Choose the installer's options
fr: Choisir les options d'installation

source: choose the WAPT repository and the WAPT Server and click on :guilabel:`Next` to go to next step;
fr: choisir le dépôt et le serveur puis cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: Choose the WAPT repository and server
fr: Choisir le dépôt et le serveur WAPT

source: install the WAPT agent by clicking on :guilabel:`Install`;
fr: installer l'agent WAPT en cliquant sur :guilabel:`Installer` ;

source: Summary of installation options
fr: Fenêtre récapitulative des options d'installation

source: wait for the installation of the WAPT agent to finish, then click on :guilabel:`Finish` to exit;
fr: attendre la fin de l'installation de l'agent WAPT puis cliquer sur :guilabel:`Fin` pour terminer ;

source: Installation in progress
fr: Progression de l'installation

source: The installation of the WAPT agent is finished. With :program:`cmd.exe`, launch a :command:`register` to register the machine with the WAPT Server and an :command:`update` to display the list of available WAPT packages.
fr: L'installation est terminée, avec :program:`cmd.exe`, lancer un :command:`register` pour enregistrer la machine sur le serveur WAPT et un :command:`update` pour afficher la liste des paquets WAPT disponibles.

source: End of WAPT agent installation
fr: Fin de l'installation de l'agent WAPT

source: tick :guilabel:`Register this host on WAPT Server` to register the computer on the WAPT inventory server;
fr: cocher :guilabel:`Enregistrer cet ordinateur dans le serveur WAPT` pour enregistrer l'ordinateur dans l'inventaire central WAPT ;

source: tick :guilabel:`Update package list from repository` to update the list of available packages;
fr: cocher :guilabel:`"Mettre à jour la liste des paquets disponibles sur le dépôt principal` pour télécharger la liste des paquets disponibles ;

source: To manage your Organization's WAPT clients, visit the :ref:`documentation on using the WAPT console <using_the_WAPT_console>`.
fr: Pour gérer les client WAPT, voir :ref:`Comment utiliser la console WAPT <using_the_WAPT_console>`.

source: Deploying automatically the WAPT agents
fr: Déployer automatiquement les agents WAPT

source: Technical pre-requisites
fr: Pré-requis techniques

source: Advanced network and system administration knowledge is required to achieve this procedure. A properly configured network will ensure its success.
fr: Des connaissances avancées en administration de réseau et de système sont nécessaires pour réaliser cette procédure. Un réseau correctement configuré assurera son succès.

source: When to deploy the WAPT agent automatically? The following method is useful in these cases:
fr: La méthode décrite dans cette section est particulièrement efficace dans les situations suivantes :

source: a large organization with many computers;
fr: vous gérez un grand parc de machines ;

source: a Samba Active Directory or Microsoft Active Directory for which you have enough administration privileges;
fr: vous disposez d'un domaine SaMBa Active Directory ou Microsoft Active Directory pour lequel vous avez des droits d'administration suffisants ;

source: the security and the traceability of actions are important to you or to your :term:`Organization`;
fr: la sécurité et la traçabilité des actions est importante pour vous ou pour votre :term:`Organisation` ;

source: or just simply, you prefer to act with your head instead of your feet ;)
fr: ou bien tout simplement, vous préférez agir avec votre tête plutôt qu'avec vos pieds ;) ;

source: Deploying the WAPT agents silently
fr: Déployer l'agent WAPT silencieusement

source: Without waptdeploy
fr: Sans waptdeploy

source: :program:`waptagent.exe` is an *InnoSetup* installer, it can be executed with these silent switches:
fr: Le :program:`waptagent` est un installeur *InnoSetup*, il peut donc être déployé silencieusement avec les arguments suivants :

source: Additional arguments available for waptdeploy
fr: Arguments supplémentaires disponibles pour waptdeploy

source: Settings
fr: Paramètre

source: Value
fr: Valeur

source: Domain in :file:`wapt-get.ini` filled in during installation
fr: Domaine dans :file:`wapt-get.ini` renseigné lors de l'installation

source: URL of the WAPT server in :file:`wapt-get.ini` filled in during installation
fr: URL du serveur WAPT dans :file:`wapt-get.ini` renseigné lors de l'installation

source: URL of the WAPT repository in :file:`wapt-get.ini` filled in during installation
fr: URL du dépôt WAPT dans :file:`wapt-get.ini` renseigné lors de l'installation

source: Group of WAPT packages to install by default
fr: Groupe de paquets WAPT à installer par défaut

source: 1 or relative path :file:`ssl\\server\\srvwapt.mydomain.lan.crt`
fr: 1 ou chemin relatif :file:`ssl\server\srvwapt.mydomain.lan.crt`

source: Value of ``verify_cert`` entered during installation
fr: Valeur de ``verify_cert`` renseigné lors de l'installation

source: path to a bundle to copy to :file:`ssl\server`
fr: chemin vers un bundle à copier dans :file:`ssl\server`

source: Certificate bundle for https connections (to be defined by ``verify_cert``)
fr: Bundle de certificats pour les connexions https (à définir par ``verify_cert``)

source: path to a certificate bundle to copy into :file:`ssl`
fr: chemin vers un bundle à copier dans ssl

source: Certificate bundle for verifying package signatures
fr: Bundle de certificats pour vérifier la signature des paquets

source: The :file:`iss` file for the InnoSetup installer is available here: :file:`C:\\Program Files (x86)\\wapt\\waptsetup\\waptsetup.iss`.
fr: Le fichier :file:`iss` de l'installeur InnoSetup est disponible ici : :file:`C:\Program Files (x86)\wapt\waptsetup\waptsetup.iss`.

source: You may choose to adapt it to your specific needs. Once modified, you'll just have to recreate a :program:`waptagent`.
fr: Vous pouvez l'adapter à vos besoins spécifiques. Une fois modifié il suffira de relancer la création d'un :program:`waptagent`.

source: To learn more about the options available with *InnoSetup*, visit `this documentation <http://www.jrsoftware.org/ishelp/index.php?topic=setupcmdline.us>`_.
fr: Pour voir les nombreuses options disponibles avec *InnoSetup*, rendez-vous sur la `documentation InnoSetup <https://www.jrsoftware.org/ishelp/index.php?topic=setupcmdline>`_.

source: With waptdeploy
fr: Avec waptdeploy

source: :program:`waptdeploy` is a small binary that:
fr: Le :program:`waptdeploy` est un petit exécutable qui :

source: checks the version of the WAPT agent;
fr: teste la version installée de WAPT ;

source: downloads via https the :program:`waptagent.exe` installer;
fr: télécharge par https l'installeur :program:`waptagent.exe` ;

source: launches the silent installer with arguments (checked options defined during the compilation of the WAPT agent);
fr: lance l'installeur en mode silencieux avec les options sélectionnées à la création du waptagent ;

source: updates the WAPT Server with the WAPT agent status (WAPT version, package status);
fr: mettre à jour le serveur avec le statut de la machine (version WAPT, situation des packages) ;

source: :program:`waptdeploy` must be started as :term:`Local Administrator`, that is why we advise you to use a GPO.
fr: :program:`waptdeploy` doit être lancé en tant qu':term:`Administrateur Local`, d'où l'utilisation d'une GPO.

source: Creating a GPO to deploy the WAPT agents
fr: Créer la GPO de déploiement avec WAPTdeploy

source: Download :file:`waptdeploy.exe` by visiting: http://wapt.tranquil.it/wapt/releases/latest/waptdeploy.exe.
fr: Télécharger :program:`waptdeploy.exe` ici : https://wapt.tranquil.it/wapt/releases/latest/waptdeploy.exe.

source: Creating the GPO
fr: Créer la GPO

source: create a new group strategy called **install_wapt** on the Active Directory server (Microsoft or Samba-AD);
fr: créer une nouvelle stratégie de groupe **install_wapt** sur le serveur Active Directory (Microsoft ou SaMBa-AD) ;

source: add a new strategy: :menuselection:`Computer configuration --> Strategies --> Windows configuration --> Scripts --> Startup --> Add`;
fr: ajouter la stratégie : :menuselection:`Configuration Ordinateur --> Stratégies --> Paramètres Windows --> Scripts --> Démarrage --> Ajouter` ;

source: Creating a group strategy to deploy the WAPT agent
fr: Créer une stratégie de groupe pour déployer l'agent WAPT

source: click on :guilabel:`Browse` to select the :file:`waptdeploy.exe` script;
fr: cliquer sur :guilabel:`Parcourir` pour sélectionner le script :program:`waptdeploy.exe` ;

source: Finding the waptdeploy.exe file on your computer
fr: Rechercher le script waptdeploy.exe

source: copy :file:`waptdeploy.exe` in the destination folder;
fr: copier :program:`waptdeploy` dans le dossier ;

source: Selecting the waptdeploy.exe script
fr: Sélectionner le script waptdeploy.exe

source: click on :guilabel:`Open` to import the :file:`waptdeploy.exe` script;
fr: cliquer sur :guilabel:`Ouvrir` pour importer le script :program`waptdeploy.exe` ;

source: click on :guilabel:`Open` to confirm the importation of the :program:`waptdeploy` binary;
fr: cliquer sur :guilabel:`Ouvrir` pour confirmer l'importation du script :program:`waptdeploy` ;

source: Passing arguments
fr: Renseigner les arguments

source: Starting with version 1.3.7, it is necessary to provide the checksum of the :file:`waptagent.exe` as an argument to the *waptdeploy* GPO.
fr: À partir de la version 1.3.7, il est nécessaire de placer un checksum dans les paramètres de scripts.

source: This will prevent the remote machine from executing an erroneous/ corrupted :program:`waptagent` binary.
fr: Ceci permet de s'assurer que le :program:`waptdeploy` ne lancera pas un installeur falsifié ou corrompu.

source: Parameters and :program:`waptagent.exe` checksum to use for the *waptdeploy* GPO are available on the WAPT Server by visiting https://<wapt.mydomain.lan>.
fr: Les paramètres complets à utiliser for the *waptdeploy*ainsi que le checksum du :program:`waptagent.exe` sont désormais disponibles sur la page d'accueil du serveur WAPT local à l'adresse https://srvwapt.mydomain.lan/.

source: Web console of the WAPT Server
fr: Console Web du serveur WAPT

source: copy the required parameters;
fr: copier les paramètres indiqués ;

source: add the *waptdeploy* script to the startup GPO
fr: Ajouter le script *waptdeploy* à la GPO de démarrage

source: click on :guilabel:`OK` to go on to the next step;
fr: cliquer sur :guilabel:`OK` pour passer à l'étape suivante ;

source: WAPTdeploy GPO to be deployed on next startup
fr: GPO WAPTdeploy to be deployed on next startup

source: apply resulting GPO strategy to the Organization's Computers :abbr:`OU (Organizational Units)`;
fr: appliquer la stratégie sur l'OU qui contient les ordinateurs de l':abbr:`UO (:term:`Unité Organisationnelle`)` ;

source: Forces the installation of :program:`waptagent.exe` even if the WAPT agent is already installed
fr: Force l'installation de :program:`waptagent` même s'il est déjà installé.

source: https://wapt/wapt/waptagent.exe
fr: http://wapt/wapt/waptagent.exe

source: Gives explicitly the WAPT agent URL/path to use to download the WAPT agent
fr: Donne explicitement le chemin / l\'url de téléchargement de l'agent à installer.

source: Sets :program:`waptagent` installation tasks
fr: Indique les tâches pour le programme d'installation :program:`waptagent`. Par défaut, toutes les tâches sont activées

source: Timeout for installing the WAPT agent.
fr: Timeout pour l'installation de l'agent WAPT.

source: Passing additional parameters to :program:`waptagent`
fr: Passer des arguments supplémentaires à :program:`waptagent`

source: Launching waptdeploy with a scheduled task
fr: Lancer waptdeploy avec une tâche planifiée

source: For :program:`waptdeploy` to work best, you may execute the GPO upon computer shutdown;
fr: Pour un bon fonctionnement de :program:`waptdeploy`, vous pouvez aussi exécuter la même GPO à l'arrêt de l'ordinateur ;

source: You may also choose to launch :program:`waptdeploy` using a scheduled task that has been set by GPO.
fr: Vous pouvez également lancer :program:`waptdeploy` avec une tâche planifiée installée par GPO.

source: This method is particularly effective for deploying WAPT on workstations when the network is neither available on starting up or shutting down.
fr: Ce mode de fonctionnement est particulièrement efficace pour déployer WAPT sur des Postes Client où le réseau n'est ni disponible au démarrage ni disponible à l'arrêt.

source: The method consists of using a GPO to copy :file:`waptdeploy.exe` and :file:`waptagent.exe`:
fr: La méthode consiste à utiliser une GPO "Copie de fichier", copiez les fichiers :file:`waptdeploy.exe` et :file:`waptagent.exe` :

source: Source : :file:`\\mydomain.lan\\netlogon\\waptagent.exe`
fr: Source : :file:`\mydomain.lan\netlogon\waptagent.exe` Destination : :file:`C:\windows\temp\waptagent.exe`

source: Destination : :file:`C:\\windows\\temp\\waptagent.exe`
fr: Source : :file:`\mydomain.lan\netlogon\waptagent.exe` Destination : :file:`C:\windows\temp\waptagent.exe`

source: WAPT agent installation progress
fr: Propriétés affichant la copie des fichiers

source: copy :file:`waptdeploy.exe` and :file:`waptagent.exe` in the netlogon share of your Active Directory Server;
fr: Copier :file:`waptdeploy.exe` et :file:`waptagent.exe` dans le partage netlogon sur votre serveur Active Directory.

source: then create a GPO to set up a scheduled task that will launch :program:`waptdeploy`:
fr: Créer ensuite une GPO de tâche planifiée qui lancera :program:`waptdeploy` :

source: Task installation properties
fr: Propriétés de la tâche d'installation

source: choose a time after which the scheduled task will trigger and set the re-triggering of the task every 30 minutes until success:
fr: Préciser ensuite une heure de lancement et préciser que la tâche doit être répétée toutes les 30 minutes ou jusqu'à sa réussite :

source: Advanced properties of the installation task
fr: Propriétés avancées de la tâche d'installation

source: allow the scheduled task to start even if the device is powered on battery:
fr: autorise que la tâche puisse démarrer même sur batterie :

source: Power settings
fr: Configuration de la gestion de l'alimentation
