Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/role-separation/index.po
Languages: fr

source: Differentiating Administrators in WAPT
fr: Différencier les Administrateurs dans WAPT

source: role level, WAPT, Certificate Authority, Code Signing, Administrator, Package Developer, Package Deployer, CA, documentation
fr: niveaux de rôle, WAPT, Certificat CA, Code Signing, Administrateur, Gestionnaire de Déploiement, Authorité de Certification (CA), documentation

source: Differentiating the role level in WAPT
fr: Différencier les niveaux de rôle dans WAPT

source: Feature only available with WAPT Enterprise
fr: Cette fonctionnalité est uniquement disponible avec la version **Enterprise**

source: WAPT offers the possibility to differentiate administrator roles based on a :abbr:`PKI (Public Key Infrastructure)` to sign packages and actions.
fr: WAPT offre la possibilité de différencier les rôles des administrateurs en basant leurs identités sur une :abbr:`PKI (Public Key Infrastructure)` pour signer les paquets et les actions.

source: The following description of roles differentiation is temporary as it will evolve in the near future.
fr: La description suivante de la différenciation des rôles est temporaire car elle va évoluer dans un avenir proche.

source: WAPT admin users roles differentiation
fr: Différenciation des rôles des utilisateurs administrateurs de WAPT

source: There are three cases:
fr: Il y a trois cas :

source: Private key + certificate types
fr: Clé privée + types de certificats

source: Key usages
fr: Principaux usages

source: Simple private key + certificate
fr: Clé privée simple + certificat

source: Allows authentication on WAPT console + interactions with WAPT agents
fr: Permet l'authentification sur la console WAPT + les interactions avec les agents WAPT

source: Developer private key + certificate
fr: Clé privée du développeur + certificat

source: Allows authentication on WAPT console + interactions with WAPT agents + package signing
fr: Permet l'authentification sur la console WAPT + interactions avec les agents WAPT + signature de paquets WAPT

source: Certificate Authority (CA) private key + certificate
fr: Clé privée de l'autorité de certification (CA) + certificat

source: Allows authentication + interactions + package signing + private key issuing
fr: Permet l'authentification + les interactions + la signature de paquets + la délivrance de nouvelles clés privées

source: Common WAPT install will generate a CA private key by default, allowing private key issuing for developers and package signing.
fr: Une installation standard de WAPT générera une clé privée de CA par défaut, permettant l'émission de nouvelles clés privées pour les développeurs et les déployeurs de paquets WAPT.

source: It is possible to emit a Certificate Authority for each subsidiaries. It is then possible to issue a personal private key and its corresponding certificate to each IT admins.
fr: Il est possible d'émettre une Autorité de Certification intermédiaire pour chaque filiale. Il est alors possible de délivrer une clé privée personnelle et son certificat correspondant à chaque administrateur informatique.

source: By looking at the above schematics, we can deduce the following conclusion:
fr: En examinant les schémas ci-dessus, nous pouvons en déduire la conclusion suivante :

source: WAPT agents in HQ can be managed by HQ IT team and cannot be managed by subsidiaries IT teams;
fr: Les agents WAPT du siège de l'Organisation peuvent être gérés par l'équipe informatique du siège et ne peuvent pas être gérés par les équipes informatiques des filiales ;

source: WAPT agents in the subsidiary having both certificates, from HQ and subsidiary, can be managed by local IT team and by HQ IT team;
fr: Les agents WAPT de la filiale ayant les deux certificats, celui du siège et celui de la filiale, peuvent être gérés par l'équipe informatique locale et par l'équipe informatique du siège ;

source: The usage of an existing PKI is possible, WAPT Console comes with a simple certificate generator.
fr: L'utilisation d'une PKI existante est possible, la console WAPT est livrée avec un simple générateur de certificats.

source: Generating a new certificate
fr: Générer un nouveau certificat

source: Generating a new self-signed certificate
fr: Générer un certificat auto-signé

source: Generating the Certificate Authority (CA)
fr: Générer l'Authorité de Certification (CA)

source: When installing WAPT, you are asked to create a :mimetype:`.pem` / :mimetype:`.crt` pair by checking the boxes :guilabel:`Certificate CA` and :guilabel:`Code Signing`.
fr: Lors de l'installation de WAPT, il vous est demandé de créer une paire :mimetype:`.pem` / :mimetype:`.crt` en cochant les cases :guilabel:`Certificat CA` et :guilabel:`Code Signing`.

source: This crt/ pem pair will allow to sign WAPT packages and new certificates.
fr: Ce couple crt / pem permettra de signer des paquets WAPT et de nouveaux certificats.

source: Generating a new certificate with the Certificate Authority
fr: Générer un nouveau certificat avec la CA

source: To create a new pem/ crt pair from the private key, click on :guilabel:`Create a certificate`.
fr: Pour générer un nouveau couple crt / pem à partir de la clé privée, cliquer sur :guilabel:`Créer un certificat`.

source: The new certificate will not be a self-signed certificate;
fr: Le nouveau certificat ne sera pas un certificat auto-signé ;

source: This new certificate will be signed by the AC (the key generated at the time of the first installation of WAPT);
fr: Ce nouveau certificat sera signé par la CA (la clé générée lors de la première installation) ;

source: You must then fill in the :guilabel:`AC's certificate` and the :guilabel:`AC's key`.
fr: Vous devez donc renseigner le :guilabel:`Certificat de la CA`** et la :guilabel:`Clé de la CA`.

source: When generating the new pem/ crt pair, you have the option to choose whether or not the new certificate will be a **Code Signing** type.
fr: Lors de la génération de ce nouveau couple pem / crt vous pouvez choisir si le nouveau certificat sera de type **Code Signing** ou non.

source: For recall, a *Code Signing* certificate is reserved to individuals with the :term:`Administrator` role in the context of WAPT and a simple SSL certificate without the ``Code Signing`` attribute is reserved to individuals with the role of :term:`Package Deployer`.
fr: Pour rappel, un certificat *Code Signing* est destiné dans le contexte de WAPT aux personnes avec le rôle :term:`Administrateur` , alors qu'un certificat SSL non Code Signing est destiné aux personnes ayant le rôle de :term:`Déployeur de paquets` .

source: :term:`Administrators` will be authorized to sign packages that **CONTAIN** a :file:`setup.py` executable file (i.e. *base* packages).
fr: Les :term:`Administrateurs` pourront signer des paquets qui **CONTIENNENT** un fichier :file:`setup.py` exécutable (c.à.d. des paquets logiciels).

source: Individuals with the :term:`Package Deployer` role will be authorized to sign packages that **DO NOT CONTAIN** :file:`setup.py` executable file (i.e. *host*, *unit* and *group* packages).
fr: Les individus avec le rôle de :term:`Déployeur de Paquets` pourront signer des paquets qui **NE CONTIENNENT PAS** de fichier :file:`setup.py` (c.à.d. des paquets de type *machine*, *unit* et groupe*).

source: Generating a certificate without the *Code Signing* attribute
fr: Génération d'un certificat sans attribut Code Signing

source: Keys and certificates that are **Not Code Signing** may be distributed to individuals in charge of deploying packages on the installed base of WAPT equipped devices.
fr: Les clés et certificats **Non Code Signing** pourront donc être confiées aux personnes en charge du déploiment des paquets sur le parc machine.

source: Another team with certificates having the **Code Signing** attribute will prepare the WAPT packages that contain applications that will need to be configured according to the :term:`Organization`'s security guidelines and the user customizations desired by her.
fr: Une autre équipe disposant de certificats pourvus de l'attribut **Code Signing** pourra préparer les paquets WAPT contenant des applications configurées en accord avec la politique de sécurité de l':term:`Organisation` et les personnalisations souhaitées par elle.

source: Generating a certificate with the *Code Signing* attribute
fr: Génération d'un certificat Code Signing

source: Generating a new prm/ crt pair will also allow to formally identify the individual who has signed a package by looking up the WAPT package certificate's :abbr:`CN (Common Name)` attribute.
fr: Générer un nouveau couple pem / crt permettra également d'authentifier formellement le signataire d'un paquet avec le champ :abbr:`CN (Common Name)`.

source: The new certificates will not be *CA Certificates*, which means that they will not be authorized to sign other certificates.
fr: Les nouveaux certificats ne seront pas **Certificat CA**, ce qui signifie qu'il ne pourront pas contre-signer d'autres certificats.

source: As a general rule, there is only one **CA Certificate** pem / crt pair per :term:`Organization`.
fr: En règle générale, vous n'avez qu'un seul couple crt / pem de type ``Certificat CA`` par :term:`Organisation`.
