Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt_create_packages/package_additional/index.po
Languages: fr

source: Additional features
fr: Fonctionnalités supplémentaires

source: Personalizing, WAPT, user context, portable application, portable app, example, session_setup, Setuphelpers, restricted user, documentation
fr: Personnaliser, WAPT, contexte utilisateur, application portable, exemple, session_setup, Setuphelpers, droits restreints, documentation

source: Customizing the user environment
fr: Personnaliser le contexte utilisateur

source: One of the main advantages of WAPT is the silent installation and uninstallation of software, **even when restricted users are connected**.
fr: Un des principaux interêts de WAPT est l'installation et la désinstallation silencieuse de logiciels, et ceci **même quand un utilisateur restreint est connecté**.

source: The WAPT agent runs with Windows SYSTEM rights, it allow to define global settings in system context and customized settings in restricted user mode.
fr: L'agent WAPT fonctionne en compte système et il pourra personnaliser des paramètres en contexte utilisateur de manière dynamique.

source: User settings customization relies on the ``session_setup`` function defined in WAPT library :term:`Setuphelpers`.
fr: Les personnalisations de l'environment utilisateur s'appuient sur la fonction ``session_setup`` définie dans la librairie WAPT :term:`Setuphelpers`.

source: Working principle
fr: Principe de fonctionnement

source: User mode customization operates as follows:
fr: La personnalisation en contexte utilisateur fonctionne comme suit :

source: the instructions are defined in :command:`session_setup()` function of :file:`setup.py` file;
fr: on décrit les instructions dans la fonction :command:`session_setup()` du fichier :file:`setup.py` du paquet WAPT ;

source: when the package is deployed on the machine, instructions are stored in the local database of the WAPT agent;
fr: quand le paquet est déployé, les instructions sont stockées dans la base de données locale de l'agent WAPT ;

source: when the user connects to her computer, :command:`session_setup` customizations are executed in the limit of one execution per user and per WAPT package version;
fr: quand l'utilisateur se connecte à la machine, les instructions sont exécutées dans la limite d'une exécution par utilisateur et par paquet WAPT ;

source: ``session_setup`` customization will occur only once per user per package; a shortcut created in that context is created only once and not at every startup. To execute a task at each startup, it is preferable to define a Windows scheduled task to be launched by a local :term:`GPO` or by a startup script.
fr: Pour effectuer une tâche à chaque démarrage, il sera plus performant de créer une tâche planifiée, de déployer une :term:`GPO` locale ou de lancer un script de Démarrage.

source: Example: create a personalized desktop shortcut
fr: Exemple : créer un raccourci personnalisé

source: One of the possibilities offered by :term:`SetupHelpers` is adding personalized shortcuts on user desktops, instead of a desktop shortcut common to all users.
fr: Une des possibilités offertes par :term:`SetupHelpers` est la création de raccourcis individuels sur le bureau utilisateur, à la différence du bureau "Public" commun à tous les utilisateurs.

source: For that purpose, we will use the :command:`create_user_desktop_shortcut()` function to create shortcuts containing the username and passing a website as an argument to Firefox.
fr: Nous utiliserons pour ça la fonction ``create_user_desktop_shortcut()`` pour créer un raccourci contenant le nom de l'utilisateur et qui passera en argument à Firefox le site https://tranquil.it par exemple.

source: Deploying a portable software with WAPT
fr: Exemple: déployer un logiciel portable avec WAPT

source: A good example of a WAPT package is a self-contained/ *portable* software package:
fr: Un bon exemple de paquet applicatif WAPT est celui d'un logiciel dit *portable*. Pour cela, il faudra :

source: create the folder for the software in :file:`C:\Program Files (x86)`;
fr: créer le répertoire d'installation dans :file:`C:\Program Files` ;

source: copy the software in that folder;
fr: copier l'application dans le dossier ;

source: create the shortcut to the application;
fr: créer un raccourci sur le bureau de l'utilisateur ;

source: manage the uninstallation process for the application;
fr: gérer la désinstallation de l'application portable ;

source: close the application if it's running;
fr: fermer l'application si elle est en cours d'exécution ;

source: Example with ADWCleaner
fr: Exemple avec ADWCleaner

source: create a group package and modify the :file:`control` file to transform it to a software package;
fr: créer un paquet groupe et modifier le fichier :file:`control` pour en faire un paquet applicatif ;

source: The file :file:`C:\waptdev\tis-adwcleaner-wapt` is created.
fr: Le fichier :file:`C:\waptdev\tis-adwcleaner-wapt` est créé.

source: download and copy/ paste :program:`adwcleaner.exe` binary in :file:`C:\waptdev\tis-adwcleaner-wapt` directory;
fr: télécharger puis copier / coller l'exécutable :program:`adwcleaner.exe` dans le répertoire :file:`C:\waptdev\tis-adwcleaner-wapt` ;

source: open and make desired changes to :file:`C:\waptdev\tis-adwcleaner-wapt\setup.py` installation file;
fr: ouvrir et modifier ensuite le fichier d'installation :file:`C:\waptdev\tis-adwcleaner-wapt\setup.py` ;
