Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: Administrator, Local Administrateur, Package Deployer, Package Developer, ANSSI, DNS, FQDN, GPO, MMC, IDE, Setuphelpers, UUID
fr: Administrateur, Administrateur Local, ANSSI, DNS, FQDN, GPO, MMC, IDE, Setuphelpers, UUID

source: Administrator
fr: Administrateur

source: Administrators
fr: Administrateurs

source: Package Developer
fr: Développeur de Paquets

source: Package Developers
fr: Développeurs de Paquets

source: In WAPT, an **Administrator** is a person with a **Code Signing** certificate that can sign packages, whether or not they contain python code or binary files, and upload the packages to the main repository.
fr: Un **Administrateur** est un individu pouvant signer des paquets, qu'ils intègrent ou non du code python et les charger sur le dépôt principal.

source: Local Administrator
fr: Administrateur Local

source: Local Administrators
fr: Administrateurs Locaux

source: A **Local Administrator** is a person with administrative rights on computers managed with WAPT.
fr: Un **Administrateur Local** est un utilisateur disposant des droits d'administration locaux sur les postes équipés de WAPT.

source: Package Deployer
fr: Déployeur de Paquets

source: Package Deployers
fr: Déployeurs de Paquets

source: A **Package Deployer** is a person that can create and sign WAPT packages that do not contain python code or binaries, eg. *host* and *group* packages, and upload them to the repository. They are typically members of local IT teams that have knowledge of specific user needs to be satisfied by deploying WAPT packages built by central IT teams.
fr: Un **Gestionnaire de Déploiement** est un individu pouvant signer des paquets ne contenant pas de code python (en général les paquets de type *group*, *unit* et *host*) et les charger sur le dépôt principal. Il est typiquement un membre d'une équipe informatique locale qui une bonne connaissance des besoins des utilisateurs.

source: The **SuperAdmin** is a :term:`User` whose login and password are set during the post-configuration of the WAPT Server. In the Community version of WAPT, he is the unique :term:`Administrator` of WAPT.
fr: Le **SuperAdmin** est l':term:`utilisateur` dont l'identifiant et le mot de passe est défini lors de la post-configuration du serveur WAPT. Dans la version WAPT Community, il est l'unique :term:`Administrateur` de WAPT.

source: User
fr: Utilisateur

source: Users
fr: Utilisateurs

source: A **User** is an individual who uses a machine that is equipped with a WAPT agent (WAPT Enterprise and Community).
fr: Un **Utilisateur** est un individu qui utilise une machine équipée de l'agent WAPT (WAPT Enterprise et Community).

source: Organization
fr: Organisation

source: Organizations
fr: Organisations

source: The **Organization** is the perimeter or responsibility within which WAPT is used.
fr: L'**Organisation** correspond au périmètre de responsabilité dans lequel est exploitée la solution WAPT.

source: **Agence Nationale de la Sécurité des Systèmes d'Information** is a French service assuming Cyber Security for the French State and has a responsibility for counseling and helping government agencies and Critical Infrastructure Operators (OIV) with securing their IT systems.
fr: **Agence Nationale de la Sécurité des Systèmes d'Information** est un service français en charge d'assurer la sécurité des informations sensibles de l'État Français et d'une mission de conseil et de soutien aux administrations et aux opérateurs d'importance vitale.

source: **Domain Name System** translates more readily memorized domain names to the numerical IP addresses needed for locating and identifying computer services and devices.
fr: **Domain Name System** est un service permettant de traduire un nom de domaine en informations de plusieurs types qui y sont associées, notamment en adresses IP de la machine portant ce nom.

source: **Fully Qualified Domain Name** is a domain name that specifies its exact location in the tree hierarchy of the Domain Name System. It specifies all domain levels, including the top-level domain and the root zone. FQDN example: wapt.nantes.pdl.organisation.fr.
fr: **Fully Qualified Domain Name** est un nom de domaine complètement qualifié. C'est la notation complète d'un nom de domaine qui révèle la position absolue de la machine dans l'arborescence DNS en indiquant tous les niveaux supérieurs jusqu'à la racine. Exemple de FQDN : wapt.nantes.pdl.organisation.fr.

source: **Extra Packages for Enterprise Linux** is an extra repository for CentOS and RedHat.
fr: **Extra Packages for Enterprise Linux** est un dépôt additionel pour CentOS et RedHat.

source: **Group Policy Object** is a feature of the Microsoft Windows NT family of operating systems that controls the working environment of user accounts and computer accounts. Group Policy provides the centralized management and configuration of operating systems, applications, and users' settings in an Active Directory environment.
fr: Les **Group Policy Objects** ou **Objets de Stratégie de Groupe** sont des objets définissant des stratégies de sécurité dans un environnement Windows. Les stratégies peuvent être définies localement à l'aide de ``gpedit.msc`` ou définies globalement en domaine Active Directory.

source: **Integrated Development Environment** is a software application that provides comprehensive facilities to computer programmers for software development. An IDE normally consists of a source code editor, build automation tools and a debugger.
fr: **Integrated Development Environment** (environnement de développement intégré) est un ensemble d'outils qui augmente la productivité des développeurs logiciels. Un IDE permet notamment de déboguer ligne par ligne le code source d'un programme, d'éditer, compiler et exécuter dans une seule interface.

source: **Microsoft Management Console** is a component of Windows that provides system administrators and advanced users an interface for configuring and monitoring the system.
fr: **Microsoft Management Console** est un gestionnaire de console virtuelle incorporé dans Microsoft Windows, qui sert de conteneur pour des interfaces graphiques de configuration.

source: **Network Address Translation** is a mechanism to allow computers from one network, usually with private IP addresses, to connect to another network, usually the Internet, using only one outgoing IP address of the NAT router.
fr: **Network Address Translation** est un mécanisme qui permet à des machines disposant d'adresses qui font partie d'un intranet de communiquer avec le reste d'Internet en semblant utiliser des adresses externes uniques et routables, au travers d'un routeur.

source: **SetupHelpers** is a python library specifically designed for WAPT. It's main purpose is to provide a set of functions useful for package development, file and folder manipulation, shortcut creation, etc.
fr: **Setuphelpers** est une librairie Python écrite spécialement pour WAPT. Elle contient un ensemble de fonctions et de variables utiles au développement de paquets, pour la manipulation de fichiers, création de raccourcis, etc.

source: A **Service Record** (SRV record) is a specification of data in the Domain Name System defining the location, i.e. the hostname and port number, of servers for specified services.
fr: Le champ **SRV** permet de définir un serveur spécifique pour une application, notamment pour la répartition de charge.

source: **Virtual hosting** is a method for hosting multiple domain names (with separate handling of each name) on a single server (or pool of servers). This allows one server to share its resources, such as memory and processor cycles, without requiring all services provided to use the same host name. The term virtual hosting is usually used in reference to web servers but the principles do carry over to other Internet services.
fr: En informatique, l'**hébergement virtuel** (de l'anglais virtual hosting abrégé **vhost**) est une méthode que les serveurs tels que les serveurs Web utilisent pour accueillir plus d'un nom de domaine sur le même ordinateur, parfois sur la même adresse IP, tout en maintenant une gestion séparée de chacun de ces noms. Cela permet de partager les ressources du serveur, comme la mémoire et le processeur, sans nécessiter que tous les services fournis utilisent le même nom d'hôte.

source: **Websockets** is a network protocol extending HTTP protocol in order to allow bidirectional client-server socket using the TCP connexion to a web server.
fr: **Websocket** est une couche applicative Web bidirectionnelle permettant la communication client-serveur en utilisant une connexion TCP.

source: **Universally Unique IDentifier** is a unique standard normalized identifier for practical purposes. In WAPT every computer is referred uniquely by its UUID. For more information see https://en.wikipedia.org/wiki/Universally_unique_identifier.
fr: Un **UUID** est un identifiant normalisé et réputé unique ; ainsi un UUID dans le contexte de WAPT permet d'identifier de manière unique une machine. Pour en savoir plus, suivre https://en.wikipedia.org/wiki/Universally_unique_identifier.

source: CNAME field
fr: champ CNAME

source: A **CNAME** DNS field is an alias name for another A :term:`DNS` field.
fr: Un enregistrement **CNAME** ou enregistrement de nom canonique est un type d'enregistrement-ressource dans le Domain Name System (:term:`DNS`) qui spécifie que le nom de domaine est un alias d'un autre nom de domaine canonique.

source: A field
fr: champ A

source: A **DNS A field** matches a name (generally the name of a machine) with an IP address.
fr: Un **champ A** met en relation un nom (en général le nom physique d'un serveur) avec une IP.

source: Certificate Authority
fr: Autorité de Certification

source: An :abbr:`CA (Certificate Authority)` is a third party entity that vouches the identity of individuals or services exchanging information.
fr: Une :abbr:`CA (Autorité de Certification)` est un tiers de confiance permettant d'authentifier l'identité des correspondants.

source: **Public Key Infrastructure** is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke digital certificates and manage public-key encryption. The purpose of a PKI is to facilitate the secure electronic transfer of information.
fr: **Public Key Infrastructure**, ou Infrastructure à Clés Publiques est un ensemble de composants physiques, de procédures humaines et de logiciels destiné à gérer les clés publiques des utilisateurs d'un système.
