Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-release-strategy.po
Languages: fr

source: WAPT release Strategy
fr: Stratégie de sortie des mises à jour de WAPT

source: Documentation, WAPT, release
fr: Documentation, WAPT, sortie, stratégie

source: WAPT does not release on a fixed date schedule.
fr: Les mises à jour WAPT ne sortent pas selon un calendrier fixe.

source: Instead Tranquil IT will release a new major version of WAPT when new major functional updates are integrated into the core of the product.
fr: Au lieu de cela, Tranquil IT sortira une nouvelle version majeure de WAPT lorsque de nouvelles mises à jour fonctionnelles majeures seront intégrées au cœur du produit.

source: Tranquil IT will release intermediary minor versions of WAPT between major releases to correct functional and security defects.
fr: Tranquil IT publiera des versions mineures intermédiaires de WAPT entre les versions majeures afin de corriger les défauts de fonctionnement et de sécurité.

source: Release delay between the Enterprise and the Community versions
fr: Délai de publication entre les versions Enterprise et Community

source: A new major version will be released as **Community** and that same version will be released as an **Enterprise** :abbr:`RC1 (Release Candidate #1)`. Before releasing, the Community version will have undergone thorough internal testing to insure no regression has slipped into the core of WAPT.
fr: Une nouvelle version majeure sera publiée sous le nom de **Community** et cette même version sera publiée sous le nom de **Enterprise** :abbr:`RC1 (Release Candidate #1)`. Avant sa sortie, la version Community aura subi des tests internes approfondis pour s'assurer qu'aucune régression ne s'est glissée dans le cœur de WAPT.

source: **Community users are encouraged to update to the new major version**.
fr: **Les utilisateurs de la version Community seront encouragés à adopter la nouvelle version majeure**.

source: The Enterprise release will cycle through several RCs and the final general availability Enterprise version will then become available between 4 and 8 weeks after the release of the Community version.
fr: La version Enterprise passera par plusieurs CR et la version Enterprise finale sera alors disponible entre 4 et 8 semaines après la sortie de la version Community.

source: This delay will provide several benefits to the Enterprise release process:
fr: Ce délai apportera plusieurs bénéfice au processus de sortie de la version Enterprise :

source: allow additional time to perform in depth testing of the new Enterprise features while avoiding regressions;
fr: accorder plus de temps pour effectuer des tests approfondis des nouvelles fonctionnalités Enterprise tout en évitant les régressions ;

source: allow Tranquil IT to work with a small set of selected Enterprise customers to insure upgrade procedures work smoothly;
fr: permettre à Tranquil IT de travailler avec un petit groupe de clients Enterprise sélectionnés afin d'assurer le bon déroulement des procédures de mise à niveau

source: give a little time to the forum and the mailing list to index questions and answers that to eventually include into the official documentation;
fr: donner un peu de temps au forum et à la liste de diffusion pour indexer les questions et les réponses qui seront éventuellement incluses dans la documentation officielle ;

source: give the documentation team a fixed functional target to document the new or improved features;
fr: permettre à l'équipe de documentation de s'appuyer sur une base fonctionnelle figée pour ainsi documenter de manière fiable les fonctionnalités nouvelles ou améliorées ;

source: give the translation team the necessary delay to update translations;
fr: donner à l'équipe de traduction le délai nécessaire pour mettre à jour les traductions ;

source: give the communication and marketing team a fixed functional target and a capacity to backward schedule announcements, video podcasts and overall promotion;
fr: permettre à l'équipe de communication et marketing de s'appuyer sur une base fonctionnelle figée pour ainsi rétro-planifier les annonces, les podcasts vidéo et la promotion générale de WAPT ;
