Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-msu/index.po
Languages: fr

source: Pre-requisites: to build WAPT packages, :ref:`the WAPT development environment must be installed <envdev_setup>`;
fr: Pré-requis : pour construire des paquets WAPT, :ref:`l'environnement de développement WAPT doit être installé <envdev_setup>` ;

source: For that purpose, WAPT provides a package template for \*.msu files.
fr: À cette fin, le WAPT fournit un modèle de paquet pour les fichiers \*.msu.

source: In that example, we use the KB4522355 downloaded from Microsoft Catalog website.
fr: Dans cet exemple, nous utilisons la KB4522355 téléchargée du site officiel Microsoft.

source: download the KB package from Microsoft Catalog website:
fr: télécharger le paquet KB depuis le catalogue Microsoft :

source: `download KB4522355 MSU <https://www.catalog.update.microsoft.com/Search.aspx?q=KB4522355>`_;
fr: `télécharger KB4522355 MSU <https://www.catalog.update.microsoft.com/Search.aspx?q=KB4522355>`_ ;

source: Creating a MSU package template from the WAPT console
fr: Créer un modèle de paquet MSU à partir de la console WAPT

source: create a WAPT package Template from the downloaded MSU file;
fr: créer un modèle de paquet WAPT à partir du fichier MSU téléchargé ;

source: Pyscripter - WAPT console window for creating a package template
fr: Pyscripter - Fenêtre de la console WAPT pour créer un modèle de paquet

source: select the downloaded MSU package and fill in the required fields;
fr: sélectionnez le paquet MSU téléchargé et remplissez les champs requis ;

source: Informations required for creating the MSU package
fr: Informations requises pour la création du paquet MSU

source: click on :guilabel:`Make and edit ....` (recommended) to launch package customization;
fr: cliquer sur :guilabel:`Créer et éditer ....` (recommandé) pour lancer la personnalisation du paquet ;

source: WAPT package IDE is launched using the source code from the pre-defined MSU template.
fr: L'éditeur de code intégré se lance en utilisant le code source du modèle MSU prédéfini.

source: as usual with WAPT packages, test - build - sign - upload - affect to hosts and it is done!!
fr: comme d'habitude avec les paquets WAPT, tester - assembler - signer - charger sur le dépôt - affecter aux hôtes et c'est fait !!

source: Creating a MSU package template from command line
fr: Créer un modèle de paquet MSU en ligne de commande

source: launch a Windows Command Line utility :program:`cmd.exe` as :term:`Local Administrator`;
fr: lancer un utilitaire en ligne de commande Windows :programme:`cmd.exe` en tant qu':term:`Administrateur local` ;

source: Windows Command Line utility launched as Local Administrator
fr: Lancement de l'utilitaire de ligne de commande Windows en tant qu'administrateur local

source: instantiate a package from the pre-defined MSU template;
fr: instancier un paquet à partir du modèle MSU prédéfini ;

source: output example with :program:`KB4522355`:
fr: exemple avec :program:`KB4522355` :
