Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/security/security-configuration-auth-ad.po
Languages: fr

source: Configuring authentication against Active Directory
fr: Configurer l'authentification Active Directory

source: Active Directory, WAPT, authentification, Kerberos, documentation
fr: Active Directory, WAPT, authentification, documentation

source: By default, the WAPT Server is configured with a single :term:`SuperAdmin` account whose password is setup during initial post-configuration.
fr: En version WAPT Community, le serveur WAPT est configuré pour utiliser un compte :term:`SuperAdmin` unique dont le mot de passe est défini lors de la post-configuration.

source: On large and security-minded network, this :term:`SuperAdmin` account should not be used since it cannot provide the necessary traceability for administrative actions that are done on the network.
fr: Ce compte :term:`SuperAdmin` ne doit pas être utilisé si une traçabilité nominative des actions d'administration du parc est recherchée.

source: It is thus necessary to configure authentication against the :term:`Organization`'s Active Directory for the :term:`Administrators` and the :term:`Package Deployers`; this will allow to use named accounts for administrative tasks.
fr: Il est impératif de configurer l'authentification Active Directory de l':term:`Organisation` qui permettra l'utilisation des identifiants nominatifs des :term:`Administrateurs` et des :term:`Déployeurs de Paquets`.

source: Active Directory authentication is used to authenticate access to the inventory via the WAPT Console;
fr: l'authentification Active Directory est utilisée pour donner des accès à l'inventaire des postes à travers la console WAPT ;

source: however, all actions on the WAPT equipped remote devices are based on X.509 signatures, so an :term:`Administrator` will need both an Active Directory login **AND** a private key whose certificate is recognized by the remote devices to manage his installed base of devices using WAPT;
fr: toutefois, toutes les actions sur les postes sont basées sur les signature X.509, donc un :term:`Administrateur` aura besoin à la fois d'un login Active Directory **ET** d'une clef privée reconnue par les postes équipés de WAPT pour effectuer des tâches d'administration du parc avec WAPT ;

source: only the :term:`SuperAdmin` account and the members of the Active Directory security group **waptadmins** will be allowed to upload packages on the main repository (authentication mode by login and password);
fr: seuls le compte :term:`SuperAdmin` et les membres du groupe de sécurité Active Directory **waptadmins** pourront charger des paquets sur le dépôt WAPT (mode d'authentification par login / mot de passe) ;

source: Enabling Active Directory authentication
fr: Activer l'authentification Active Directory

source: to enable authentication of the WAPT server on Active Directory, configure the file :file:`/opt/wapt/conf/waptserver.ini` as follows:
fr: pour activer l'authentification du serveur wapt sur Active Directory, configurer le fichier :file:`/opt/wapt/conf/waptserver.ini` comme ceci :

source: Settings
fr: Paramètres

source: Value
fr: Valeur

source: DN to the group name. All members of this group will be able to connect to WAPT
fr: DN complet vers le nom du groupe. Tous les membres de ce groupe pourront se connecter à WAPT

source: LDAP server that will be used by WAPT
fr: Server LDAP que va utiliser WAPT.

source: DN for the search
fr: DN pour la recherche

source: restart :program:`waptserver` with :code:`systemctl restart waptserver`;
fr: redémarrer :program:`waptserver` avec :code:`systemctl restart waptserver` ;

source: Enabling SSL/ TLS support for the LDAP connection to the Active Directory Domain Controller
fr: Activer le support SSL / TLS vers le contrôleur Active Directory

source: By default, authentication on Active Directory relies on LDAP SSL (default port 646).
fr: L'authentification Active Directory se fait au travers du protocole LDAP SSL (port 646 par défaut).

source: SSL/ TLS is not enabled by default on Microsoft Active Directory until a SSL certificate has been configured for the Domain Controller.
fr: Microsoft Active Directory n'active pas le support SSL tant qu'un certificat n'a pas été généré et mis en place pour le contrôleur Active Directory.

source: The WAPT Server uses the Certificate Authority *bundles* from the operating system (CentOS) for validating the SSL/ TLS connection to Active Directory.
fr: Les *bundles* de certificats utilisés par le serveur WAPT pour valider le certificat du contrôleur Active Directory sont ceux utilisés par défaut par la distribution CentOS.

source: If the Active Directory certificate is self-signed or has been signed by an internal CA, you'll need to add these certificates to the certificate store of CentOS.
fr: Si le certificat du contrôleur Active Directory est auto-signé, il faudra faire le nécessaire afin de rajouter au bundle local de CA de CentOS.

source: Add a :term:`Certificate Authority` in the :file:`/etc/pki/ca-trust/source/anchors/` and update the CA store.
fr: Ajouter l':term:`Autorité de Certification` dans le dossier :file:`/etc/pki/ca-trust/source/anchors/` et mettre à jour les CA.

source: Once you have setup LDAP SSL/ TLS on your Active Directory (please refer to Microsoft documentation for that), then you can enable support for SSL/ TLS security for AD in :file:`/opt/wapt/conf/waptserver.ini`:
fr: une fois le certificat mis en place et le support de LDAP SSL sur le contrôleur Active Directory effectué (étape non-documentée), basculer le support SSL / TLS à True dans le fichier :file:`/opt/wapt/conf/waptserver.ini` :

source: You may go to the documentation on :ref:`installing the WAPT console <installing_the_WAPT_console>`!!
fr: Passez maintenant à l'étape suivante pour :ref:`installer la console WAPT <installing_the_WAPT_console>`.
