Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/dns/dns-introduction.po
Languages: fr

source: Configuring the Organization's DNS for WAPT
fr: Configurer les DNS de l'Organisation pour WAPT

source: DNS, WAPT, A field, documentation
fr: DNS, WAPT, champ A, documentation

source: **DNS configuration is not strictly required, but it is very strongly recommended**.
fr: **La configuration DNS n'est pas obligatoire ; elle est fortement recommandée**.

source: In order to make make your WAPT setup easier to manage, it is strongly recommended to configure the :term:`DNS` server to include :term:`A field` or :term:`CNAME field` as below:
fr: Pour faciliter la configuration des clients, il est fortement recommandé de configurer le serveur :term:`DNS` pour inclure les :term:`champs A` ou :term:`CNAME` suivants :

source: Replace *mydomain.lan* with your network's :term:`DNS` suffix.
fr: Remplacer *mydomain.lan* par le suffixe :term:`DNS` utilisé sur votre réseau.

source: These DNS fields will be used by WAPT agents to locate the WAPT Server and their WAPT repositories closest to them.
fr: Ces champs seront utilisés par les agents WAPT pour trouver le serveur WAPT ou un dépôt secondaire WAPT de proximité sur le réseau.

source: Configuring DNS entries in Microsoft RSAT.
fr: Configurer les champs DNS avec les "Outils d'administration de serveur distant" Microsoft (RSAT).

source: The *A* field must point to the WAPT Server IP address;
fr: le champ *A* pointe vers l'adresse IP du serveur WAPT ;

source: Configuration of the A field in Windows RSAT
fr: Configuration du champ A dans la MMC Windows

source: You can now install the WAPT Server on your favorite operating system:
fr: Vous pouvez maintenant installer votre serveur WAPT sur l'OS de votre choix :

source: :ref:`install the WAPT Server on GNU / Linux Debian <install_base_debian>`;
fr: :ref:`installer le serveur WAPT sur Debian <install_base_debian>` ;

source: :ref:`install the WAPT Server on CentOS / RedHat <install_base_centos>`;
fr: :ref:`installer le serveur WAPT sur CentOS ou RedHat <install_base_centos>` ;

source: :ref:`install the WAPT Server on Windows <wapt-server_win_install>`;
fr: :ref:`installer le serveur WAPT sur Windows <wapt-server_win_install>` ;
