Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/ini-file/wapt-get.ini.po
Languages: fr

source: Configuring the WAPT agent
fr: Configurer l'agent WAPT

source: wapt-get.ini, configuration, documentation, WAPT
fr: wapt-get.ini, configuration

source: The configuration file :file:`C:\\Program Files(x86)\\wapt\\wapt-get.ini` defines the behavior of the WAPT agent.
fr: Le fichier de configuration C:\\Program Files (x86)\\wapt\\wapt-get.ini contrôle le comportement de l'agent WAPT.

source: The ``[global]`` section is required:
fr: La section ``[global]`` est obligatoire :

source: Description of available options for the WAPT agent
fr: Description des options possibles pour l'agent WAPT

source: if ``repo_url`` and ``wapt_server`` fields are empty, the WAPT agent will look for a repository using SRV records in the ``dnsdomain`` zone;
fr: si les champs ``repo_url`` et ``wapt_server`` sont vides, le client WAPT ira chercher son dépôt en utilisant l'enregistrement SRV dans la zone ``dnsdomain`` ;

source: if there is no ``wapt_server`` attribute in the ``[global]`` section, no WAPT Server will be used;
fr: s'il n'y a pas de clé ``wapt_server`` dans la section ``[global]``, aucun serveur WAPT ne sera contacté ;

source: if there is no ``repo_url`` attribute in the ``[global]`` section, a repository in the ``[wapt]`` section will have to be explicitly defined;
fr: s'il n'y a pas d'attribut ``repo_url`` dans la section ``[global]``, il sera nécessaire de définir explicitement un dépôt dans une section ``[wapt]``, et de l'activer en l'ajoutant à la clé ``repositories`` de la section ``[global]`` ;

source: it will have to be enabled by adding it to the ``repositories`` attribute to the ``[global]`` section;
fr: les dépôts activés sont listés dans le paramètres ``repositories`` de la section ``[global]`` ;

source: If the field is left empty, the WAPT agent will make a :term:`DNS` query on the :term:`SRV` field ``_wapt._tcp.<dnsdomain>`` to find the repository (the ``dnsdomain`` attribute must be configured).
fr: Adresse du dêpôt WAPT. Si laissé vide, la recherche se fait sur le champ :term:`DNS` :term:`SRV` ``_wapt._tcp.<dnsdomain>`` (``dnsdomain`` doit être renseigné).

source: If the attribute is left empty, the WAPT agent will make a :term:`DNS` :term:`SRV` query on the ``_waptserver._tcp.<dnsdomain>`` field (the ``dnsdomain`` attribute must be configured)
fr: Si l'attribut est vide, la recherche se fait sur le champ :term:`DNS` :term:`SRV` ``_waptserver._tcp.<dnsdomain>`` (l'attribut ``dnsdomain`` doit être renseigné)

source: DNS suffix to use for auto-discovery of the WAPT Server and repositories with :term:`SRV` / :term:`CNAME field` DNS queries.
fr: Suffixe DNS à utiliser pour la recherche automatique par champs :term:`SRV` ou :term:`champ CNAME` du dépôt principal et du serveur WAPT.

source: Use host packages (default 1).
fr: Utiliser du paquet machine ou non (défaut 1).

source: Update frequency (120 minutes by default).
fr: Fréquence d'update (120 minutes par défaut).

source: Upgrade frequency (disabled by default)
fr: Fréquence d'upgrade (inactif par défaut).

source: Identifier used by the WAPT service when executing actions.
fr: Identifiant lors de l'appel d'une fonction par le service WAPT.

source: sha256 hashed password when the WAPT service is used locally from a command prompt (NOPASSWORD disables the requirement for a password)
fr: Mot de passe hashé sha256 hex lors de l'appel d'une fonction par le service WAPT (NOPASSWORD permet de ne pas mettre de mot de passe)

source: WAPT agent loopback port. It is not accessible from the network.
fr: Port local HTTPS d'écoute du service WAPT.

source: Folder where the database :file:`waptdb.sqlite` file will be stored.
fr: Dossier où sera stocké le fichier :file:`waptdb.sqlite`.

source: Log level of the WAPT agent. Possible values are: ``debug``, ``info``, ``warning``, ``critical``.
fr: Niveau de log de l'agent WAPT. Valeurs possibles : ``debug``, ``info``, ``warning``, ``critical``.

source: List of packages maturities than can be viewed and installed by WAPT Agent. Default value is ``PROD``. Any value can be used.
fr: Liste des maturités de paquets qui peuvent être vus et installés par l'agent WAPT. La valeur par défaut est ``PROD``. N'importe quelle valeur peut être utilisée.

source: Allows you to use the fqdn name rather than the uuid BIOS as the unique machine identifier in wapt.
fr: Permet d'utiliser le nom FQDN plutôt que l'UUID BIOS comme identifiant unique de la machine dans WAPT.

source: ``waptaudit_task_period`` = 120
fr: ``waptupdate_task_period`` = 120

source: Define the frequency where the agent checks if he has audits to perform.
fr: Définit la fréquence à laquelle l'agent vérifie s'il a des audits à faire.

source: ``locales`` = en
fr: ``loglevel`` = warning

source: Allows you to set the list of wapt agent languages to modify the list of packages visible by wapt (for package filtering). You can add multiple language (eg. ``locales=fr,en``) in order of preference.
fr: Permet de définir la liste des langues de l'agent WAPT pour modifier la liste des paquets visibles par WAPT (pour le filtrage des paquets). Vous pouvez ajouter plusieurs langues (par exemple ``locales=fr,en``) par ordre de préférence.

source: Allows you to define a wapt package list that the wapt agent must install.
fr: Défint une liste de paquets WAPT que l'agent WAPT doit installer.

source: Force default langauge for GUI (not for package filtering)
fr: Forcer la langue par défaut de la console graphique (ne s'applique pas au filtrage des paquets)

source: Allows you to force an Organizational Unit on the WAPT agent. (Convenient to assign a fake OU for out-of-domain PC)
fr: Permet de forcer une unité organisationnelle sur l'agent WAPT. (Pratique pour assigner une fausse OU pour un PC hors domaine)

source: WAPT Server configuration attributes
fr: Paramètres d'accès au serveur WAPT

source: These options will set WAPT agent behavior when connecting to WAPT Server.
fr: Ces options définissent le comportement de l'agent WAPT lors de sa connexion avec le serveur WAPT.

source: WAPT Server URL. If the attribute is not present, no WAPT Server will be contacted. If the attribute is empty, a DNS query will be triggered to find the WAPT Server using the ``dnsdomain`` attribute for the DNS zone.
fr: URL du serveur WAPT. Si pas présent, aucun serveur n'est contacté. Si vide, une recherche DNS est effectuée sur la zone ``dnsdomain``.

source: DNS zone on which the DNS SRV ``_waptserver._tcp`` is searched.
fr: Zone sur laquelle la recherche DNS SRV ``_waptserver._tcp`` est effectuée.

source: WAPT Server HTTPS connection timeout in seconds
fr: Timeout en secondes lors de la tentative de connexion https vers le serveur

source: Use Kerberos authentication for initial registration on the WAPT Server.
fr: Utilisation de l'authentification Kerberos pour l'enregistrement sécurisé avec le serveur WAPT.

source: See the documentation on activating the
fr: Voir la documentation pour activer la

source: :ref:`verification of HTTPS certificates <activating_HTTPS_certificate_verification>`
fr: :ref:`vérification des certificats HTTPS <activating_HTTPS_certificate_verification>`

source: Folder of certificates authorized to verify the signature of WAPT packages, by default, ``<wapt_base_dir>\\ssl``. Only files in this directory with :file:`.crt` or :file:`.pem` extension are taken into account. There may be several X509 certificates in each file. Authorized packages in WAPT are those whose signature may be verified by one of the certificates contained in the PEM files of this directory. Each repository may have its own folder of authorized certificates.
fr: Répertoire des certificats autorisés pour la vérification de _signature_ des paquets. Par défaut : ``<wapt_base_dir>\\ssl``. Seuls fes fichiers dans ce répertoire avec l'extension :file:`.crt` ou :file:`.pem` sont pris en compte. Il peut y avoir plusieurs certificats X509 dans chaque fichier. Les certificats de paquets autorisés sont ceux dont la signature peut être vérifiée par l'un des certificats contenus dans les fichiers PEM de ce répertoire. Chaque dépôt peut avoir son propre répertoire de certificats autorisés.

source: Using several repositories
fr: Utiliser plusieurs dépôts

source: There can be more sections in the :file:`wapt-get.ini` file to define more repositories.
fr: D'autres sections peuvent être définies pour décrire chaque nouveau dépôt.

source: ``[wapt]``: main repository. Relavent attributes: ``repo_url``, ``verify_cert``, ``dnsdomain``, ``http_proxy``, ``use_http_proxy_for_repo``, ``timeout``. If this section does not exist, parameters are read from the ``[global]`` section;
fr: ``[wapt]``: dépôt principal. Options pertinentes: ``repo_url``, ``verify_cert``, ``dnsdomain``, ``http_proxy``, ``use_http_proxy_for_repo``, ``timeout``. Si cette section n'existe pas, les paramètres sont récupérés depuis la section ``[global]`` ;

source: ``[wapt-template]``: external remote repository that will be used in the WAPT console for importing new or updated packages;
fr: ``[wapt-templates]`` : dépôt externe par défaut dans la console WAPT pour importer des nouveaux paquets ou des paquets mis à jour ;

source: ``[wapt-host]``: repository for host packages. If this section does not exist, default locations will be used on the main repository;
fr: ``[wapt-host]``: dépôt pour les paquets machines. Si cette section n'existe pas, elle est extrapolée des paramètres du dépôt principal ;

source: More information on that usage can be found here: :ref:`work_multiple_repos`.
fr: Plus d'informations sur cet usage sont à découvrir ici : :ref:`work_multiple_repos`.

source: Active repositories are listed in the ``repositories`` attribute of the ``[global]`` section.
fr: Les dépôts activés sont listés dans le paramètres ``repositories`` de la section ``[global]``.

source: ``repositories`` = repo1, repo2
fr: ``repositories`` = depot1,depot2

source: List of enabled repositories, separated by a comma. Each value defines a section of the :file:`wapt-get.ini` file. In each section, it is possible to define ``repo_url``, ``dnsdomain``, ``public_certs_dir``, ``http_proxy``.
fr: Liste des dépôts activés. Séparateur : virgule. Les valeurs désignent le nom de la section du fichier :file:`wapt-get.ini`. Dans chaque section, on peut préciser ``repo_url``, ``dnsdomain``, ``public_certs_dir``, ``http_proxy``.

source: This parameter can be configured both in the WAPT agent configuration and in the WAPT console configuration file :file:`C:\\Users\\%username%\\AppData\\Local\\waptconsole\\waptconsole.ini`.
fr: Ce paramètre est également à définir dans la configuration de la console WAPT située dans :file:`C:\\Users\\%username%\\AppData\\Local\\waptconsole\\waptconsole.ini`.

source: For information on configuring the WAPT console, please refer to :ref:`this documentation <waptconsole_ini_file>`.
fr: Pour plus d'informations, visitez :ref:`la documentation sur la configuration de la console WAPT <waptconsole_ini_file>`.

source: Settings for waptexit
fr: Paramètres pour waptexit

source: Prevents users from canceling package upgrades on computer shutdown
fr: Interdire à l'utilisateur d'annuler la mise à jour

source: Timeout for scripts at computer shutdown
fr: Temps d'attente maximum pour l'exécution des scripts à l'extinction

source: Timeout for GPO execution at computer shutdown
fr: Temps d'attente maximum pour l'application des GPO à l'extinction

source: Disables Hiberboot on Windows 10 to make ``waptexit`` work correctly
fr: Désactive Hiberboot pour utiliser :program:`waptexit` sur Windows 10

source: Settings for wapttray
fr: Paramètres pour wapttray

source: Prevents ``wapttray`` from sending notifications (popup)
fr: Empêche :program:`waptray` d'envoyer des notifications (popup).

source: Proxy settings
fr: Paramètres proxy

source: HTTP proxy address
fr: Adresse du proxy HTTP à utiliser

source: Using the proxy to access the repositories
fr: Utiliser un proxy pour accéder aux dépôts

source: Use a proxy to access the WAPT Server
fr: Utiliser un proxy pour accéder au serveur d'inventaire

source: Use a proxy to access package template server.
fr: Utiliser un proxy pour accéder au serveur de modèles de paquets.

source: Settings for creating packages
fr: Paramètres pour la création de paquets

source: ``personal_certificate_path`` = C:\\private\\org-coder.crt
fr: ``personal_certificate_path`` = C:\\private\\org-codeur.crt

source: Path to the Administrator's private key
fr: Chemin de la clé privée qui permettra de signer les paquets

source: Directory for storing packages in development
fr: Répertoire de développement des paquets

source: Directory for storing host packages in development
fr: Répertoire de développement des paquets hosts

source: Default prefix for new or imported packages
fr: Préfixe des paquets par défaut

source: Settings for ``WAPT Windows Updates``
fr: Paramètres pour les ``WAPT Windows Updates``

source: Refer to :ref:`this article on configuring WAPTWUA on the WAPT agent <wapt_wua_agent>`.
fr: Se référer à :ref:`cet article sur la configuration de WAPTWUA pour l'agent WAPT <wapt_wua_agent>`.

source: Overriding settings of *upload* functions
fr: Paramètres de surcharge des commandes *upload*

source: It's possible to override :command:`upload` commands to define a particular behavior when uploading packages. It's possible for example to upload packages on several repositories, or via another protocol, etc.
fr: Il est possible de surcharger les commandes :command:`upload` pour définir un comportement particulier lors de l'envoi des paquets. On pourrait par exemple envoyer le paquet sur plusieurs dépôts, via un autre protocole, etc.

source: To upload packages on the repository (:command:`wapt-get upload-package` or :command:`build-upload`), use:
fr: Pour téléverser le paquet hôte sur le serveur (:command:`upload-package` ou :command:`build-upload` d'un paquet machine), utiliser :

source: To upload host-packages on the repository (:command:`upload-package` or :command:`build-upload` of a host package), use:
fr: Pour téléverser le paquet hôte sur le serveur (:command:`upload-package` ou :command:`build-upload` d'un paquet machine), utiliser :

source: To launch a command after a package :command:`upload`, use:
fr: Pour à exécuter après l':command:`upload` :

source: Configuration of WAPT agents
fr: Configurer les agents WAPT

source: After standard installation, the default configuration is:
fr: Lors de l'installation les paramètres par défaut sont :

source: Making changes in :file:`wapt-get.ini` and regenerating an agent is not sufficient to push the new configuration.
fr: Modifier le :file:`wapt-get.ini` et regénérer un agent ne suffit pas à pousser une nouvelle configuration.

source: You can create a WAPT package to push updated :file:`wapt-get.ini` settings.
fr: Vous pouvez en revanche faire un paquet WAPT qui va pousser la nouvelle configuration.

source: The package is available from the Tranquil IT repository: https://store.wapt.fr/store/details-tis-wapt-conf-policy_6_all.wapt:
fr: Le paquet exemple est présent dans le dépôt Tranquil IT : https://store.wapt.fr/package_details?package=tis-wapt-conf-policy_6_all.wapt :
