Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-common-problems/index.po
Languages: fr

source: MSI error codes are available by visiting `this website <https://msdn.microsoft.com/en-us/library/windows/desktop/aa372835.aspx>`_.
fr: Les différents codes d'erreur MSI sont disponibles `ici <https://msdn.microsoft.com/en-us/library/windows/desktop/aa372835.aspx>`_.

source: go to the computer and try to install the package with the WAPT command line utility. Then check that the software has installed;
fr: se déplacer physiquement sur la machine en erreur et relancer l'installation silencieuse en ligne de commande. Vérifier ensuite que le logiciel à bien été installé.

source: Once the silent installation has finished, do nothing else.
fr: Une fois l'installation silencieuse lancée, ne pas intervenir.

source: The objective is to reproduce the behavior of the WAPT agent.
fr: L'objectif est de reproduire le comportement de l'agent WAPT.

source: if the package installs silently in user context, this may mean that the software installer does not work in *SYSTEM* context;
fr: si l'installation fonctionne en mode silencieux, en contexte utilisateur, cela peut signifier que l'installeur ne supporte pas l'installation en compte *SYSTEM* ;

source: if it is still not working, launch the installation manually. It is possible for an error to appear explicitly describing the problem (ex: missing dependency, etc);
fr: si cela ne fonctionne toujours pas, lancer l'installation manuellement. Il est possible qu'une erreur apparaisse indiquant explicitement le problème. Exemple (Dépendance manquante: .Net , Java, etc..) ;

source: it is possible that the installer does not support installing over an older version of the software, so you will have to explicitly remove older versions of the application before installing the new one;
fr: il est possible que l'installeur ne supporte pas l'écrasement d'une installation précédente, alors prévoir la désinstallation des anciennes version avant d'installer la nouvelle version ;

source: Error "timed out after seconds with output '600.0'"
fr: Erreur "timed out after seconds with output '600.0'"

source: Some packages return the following error in the WAPT console:
fr: Certains paquets dans la console retournent l'erreur :

source: By default, when installing a package :command:`run`, :command:`install_msi_if_needed`, WAPT will wait 600 seconds for the installer to finish its task.
fr: Par défaut lors d'une installation (avec :command:`run`, :command:`install_msi_if_needed` ou :command:`install_exe_if_needed`) WAPT va attendre 600 secondes que l'installeur lui rende la main.

source: if the installer has not finished in this delay, WAPT will stop the running installation.
fr: Si l'installeur n'a pas terminé dans ce délai, WAPT coupera l'installation en cours.

source: Solution: large software installs
fr: Résolution: Installations volumineuses

source: If the software to be installed is known to be big (Microsoft Office, Solidworks, LibreOffice, Katia, Adobe Creative Suite), it is possible that the 600 second delay will be too short.
fr: Si vous tentez d'installer un gros logiciel (Office, Solidworks, Libreoffice ...), il est possible que l'intervalle de 600 secondes ne soit pas suffisant.

source: You will have to increase the timeout value, ex: *timeout* = 1200:
fr: Vous devez alors, augmentez cette valeur avec l'argument *timeout*, ex: *timeout* = 1200 :

source: Error "has been installed but the uninstall key can not be found"
fr: Erreur "has been installed but the uninstall key can not be found"

source: WAPT relies on Windows to install MSI and EXE.
fr: WAPT fait appel à des commandes Windows pour lancer les installations MSI / EXE.

source: with :command:`install_msi_if_needed` (https://github.com/tranquilit/WAPT/blob/branch-1.3.8/setuphelpers.py#L3498); https://github.com/tranquilit/WAPT/blob/branch-1.5.1/setuphelpers.py#L3717
fr: avec :command:`install_msi_if_needed` (https://github.com/tranquilit/WAPT/blob/branch-1.3.8/setuphelpers.py#L3498); https://github.com/tranquilit/WAPT/blob/branch-1.5.1/setuphelpers.py#L3717

source: with :command:`install_exe_if_needed` (https://github.com/tranquilit/WAPT/blob/branch-1.3.8/setuphelpers.py#L3547); https://github.com/tranquilit/WAPT/blob/branch-1.5.1/setuphelpers.py#L3795
fr: avec :command:`install_exe_if_needed` (https://github.com/tranquilit/WAPT/blob/branch-1.3.8/setuphelpers.py#L3547); https://github.com/tranquilit/WAPT/blob/branch-1.5.1/setuphelpers.py#L3795

source: By default, WAPT accepts return codes *0* (OK) and *3010* (computer restart required) and it verifies that the *uninstall key* is present.
fr: Par défaut, WAPT accepte les codes de retour : *0* (OK) et *3010* (redémarrage nécessaire), et il vérifie la clé de désinstallation résultante (*uninstall key*).

source: Unfortunately, we can not fully trust these return codes, so WAPT does additional checks after completing the installation to make sure that all has gone well:
fr: Malheureusement, on ne peut pas toujours se fier à ces codes d'erreur, WAPT vérifie enfin que tout s'est bien déroulé :

source: it checks the presence of the *uninstall key* on the computer;
fr: il vérifie la présence de la clé de désinstallation sur la machine ;

source: it checks that the version number of the software is equal or greater than the version number in the :file:`control` file;
fr: il vérifie que la version est bien égale ou supérieure à celle renseignée ;

source: if this is not the case, it infers that the software may not be present on the computer;
fr: si ce n'est pas le cas, il en déduit que le logiciel n'est peut-être pas présent sur la machine ;

source: The function returns the package in error. The installation will be retried at every :command:`upgrade` cycle until the package returns no error.
fr: La fonction bascule alors volontairement le paquet en erreur. L'installation sera retentée lors de chaque upgrade, jusqu'à ce que le paquet ne génère plus d'erreur.

source: Before doing anything, it is advisable to go physically to the computer returning in error and to **manually check whether the software has correctly installed**. If the software has not installed correctly, refer to the :ref:`section of this documentation on installing a package <common_problems_installing_a_package>`.
fr: Avant toute chose, il convient de se connecter sur la machine en erreur et de vérifier manuellement **si le logiciel est correctement installé** . Si ce n'est pas le cas, se référer à la documentation sur les :ref:`problèmes d'installation d'un paquet <common_problems_installing_a_package>`..

source: if the software has installed correctly, this may mean that the uninstall key or the software version in the package is not correct;
fr: si le logiciel est bien installé, cela signifie peut être que la clé de désinstallation ou la version fournie dans le paquet n'est pas bonne ;

source: retrieve the correct *uninstall key* and make changes to the WAPT package accordingly;
fr: récupérer la bonne clé de désinstallation et corriger le paquet en conséquence ;

source: if the error happens when using the :command:`install_msi_if_needed` function, this means that the MSI installer is badly packaged and that it is returning an incorrect *uninstall key*;
fr: si l'erreur se produit avec :command:`install_msi_if_needed` cela signifie que l'installeur MSI est mal conçu et renvoie une mauvaise clé de désinstallation ;

source: Error "has been installed and the uninstall key found but version is not good"
fr: Erreur "has been installed and the uninstall key found but version is not good"

source: When using :command:`install_msi_if_needed` or :program:`install_exe_if_needed` functions, additional checks are performed to make sure that all has gone well.
fr: Avec les commandes :command:`install_msi_if_needed` et :command:`install_exe_if_needed`, des vérifications supplémentaires sont effectuées pour vérifier que tout s'est bien passé.

source: Solution: with `install_msi_if_needed`
fr: Solution: Avec install_msi_if_needed

source: The informations being extracted from the MSI installer, this means that the MSI file does not return correct values or that the *uninstall key* is incorrect.
fr: Les informations étant extraites depuis l'installeur MSI, cela signifie que le fichiers MSI ne renvoie pas la bonne version ou que la clé de désinstallation retournée n'est pas la bonne version.

source: You can check using the Windows Command Line utility:
fr: Vérifier avec la commande :

source: If the returned key is not that which has been entered in the install section of the :file:`setup.py`, it is not possible to use the function :command:`install_msi_if_needed`.
fr: Si la clé retournée n'est pas celle renseignée dans la partie installation du fichier :file:`setup.py` , il n'est pas possible d'utiliser la fonction :command:`install_msi_if_needed`.

source: You must review the install section of your :file:`setup.py`, use the :command:`run()` function and manually manage exceptions.
fr: Il faut rebasculer l'installation avec un simple :command:`run()` et gérer les exceptions manuellement.

source: Solution: with ``install_exe_if_needed``
fr: Avec install_exe_if_needed

source: This probably means that the version number entered in the :program:`install_exe_if_needed` function is not correct. Make corrections to the WAPT package accordingly.
fr: Cela signifie probablement que la version renseignée dans la fonction :command:`install_exe_if_needed` n'est pas la bonne. Corriger le paquet WAPT en conséquence.

source: If the ``min_version`` argument has not been entered, WAPT will try to retrieve the version automatically from the exe installer.
fr: Si l'argument ``min_version`` n'a pas été renseigné, WAPT va tenter de récupérer automatiquement la version depuis l'installeur exe.

source: You can check the *uninstall key* and version number using the command:
fr: Pour vérifier la clé de désinstallation utilisée et le numéro de version, utiliser la commande :

source: If no version is provided with the :command:`wapt-get list-registry` command, this means that the software installer does not provide an *uninstall key*.
fr: Si aucune version n'est fournie avec la commande :command:`list-registry`, cela signifie que la clé de désinstallation du logiciel ne fournit pas de version.

source: use the argument ``get_version`` to provide the path to another ``uninstallkey``:
fr: utiliser l'argument ``get_version`` pour fournir un chemin vers une autre ``uninstallkey`` :

source: providing an empty value for ``min_version`` tells WAPT not to check for versions;
fr: fournir une valeur vide en argument pour ``min_version`` afin d'indiquer à WAPT qu'aucune version n'est à vérifier ;

source: With this method, **versions are no longer checked during updates!**
fr: Avec cette méthode **on ne vérifiera plus la version lors de mise à jour** !

source: Frequent problems caused by Anti-Virus software
fr: Problèmes fréquents liés aux Antivirus

source: Some Anti-Virus software falsely raise errors when checking some internal components of WAPT.
fr: Certains Antivirus lèvent des alertes pour des composants de WAPT.

source: Among the components is :program:`nssm.exe` used by WAPT as a service manager for starting, stopping and restarting the WAPT service.
fr: Parmis ceux-ci le composant :program:`nssm.exe` est utilisé par WAPT comme utilitaire de service pour l'agent WAPT.

source: Below is a list of useful exceptions to declare in your central AV interface to solve false positives related to WAPT:
fr: Voici une liste des exceptions possibles à déclarer dans votre interface de gestion centralisé antivirus :
