Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-common-problems/index.po
Languages: fr

source: Frequent problems
fr: Questions fréquentes

source: lost password, lost private key, stolen private key, BIOS bug, waptdeploy, WAPT, documentation
fr: mot de passe perdu, clé perdue, bug BIOS, waptdeploy

source: I have lost my SuperAdmin password
fr: J'ai perdu mon mot de passe SuperAdmin

source: It sometimes happens to setup a WAPT Server and then forget its password.
fr: Il arrive parfois de mettre en place un serveur WAPT et d'en oublier le mot de passe.

source: To reset the WAPT console :term:`SuperAdmin` password you have to relaunch the post-configuration process on the WAPT Server.
fr: Pour réinitialiser le mot de passe :term:`SuperAdmin` de la console WAPT il suffit de relancer la post-configuration sur le serveur WAPT.

source: Reseting the WAPT Linux Server password
fr: Réinitialiser le mot de passe WAPT Server Linux

source: connect to the server with SSH;
fr: se connecter au serveur avec SSH ;

source: connect with user root (or use sudo);
fr: passer en compte root (ou utiliser sudo) ;

source: launch post-configuration script :
fr: exécuter le script de post-configuration :

source: To avoid breaking the existing WAPT Server setup, accept all the other steps, **DO NOT CREATE a new private key**!
fr: Pour ne pas casser le fonctionnement de votre serveur WAPT, validez toutes les autres fenêtres, **ne regénérez pas de clé privée** !!

source: I lost my WAPT private key
fr: J'ai perdu ma clé privée WAPT

source: WAPT's security and its correct functioning rely on sets of private keys and public certificates.
fr: La sécurité et le bon fonctionnement de WAPT s'appuient sur les jeux de clés privés et de certificats publics.

source: Losing a private key thus requires to generate a new key and its associated certificates, and then to deploy the new keys and the new certificates on the Organization's computers.
fr: La perte d'une clé privée nécessite donc de regénérer une nouvelle clé et les certifcats associés, et ensuite déployer sur le parc de machines les certificats pour la nouvelle clé.

source: Therefore, losing a key bears some consequences, the process to recover from a lost key is not trivial, although it is relatively simple.
fr: Donc la procédure n'est pas anodine, même si elle est simple.

source: Generating or renewing a private key
fr: Procédure de renouvellement ou de création d'une clé privée

source: The procedure is:
fr: La procédure va être la suivante :

source: generate a new private key/ public certificate. You will then keep the private key (file :file:`. pem`) in a safe location;
fr: générer un nouveau couple clé privée / clé publique. Vous allez conserver la clé privée (fichier .pem) en lieu sûr ;

source: deploy the new certificate :file:`.crt` on your clients in the folder :file:`C:\\Program Files (x86)\\ssl` manually or using a :abbr:`GPO (Group Policy Object)`;
fr: déployer le nouveau certificat :file:`.crt` sur vos clients dans le dossier :file:`C:\\Program Files (x86)\\ssl` manuellement ou par :abbr:`GPO (Group Policy Object)` ;

source: Re-signing packages in the repositories
fr: Manipulation sur les paquets en conséquence

source: WAPT packages hosted on the repositories were signed using the former private key, so you must re-sign every package of the repository using the new key.
fr: Les paquets du dépôt local étant signé avec l'ancienne clé, il convient de re-signer l'intégralité des paquets avec la nouvelle clé.

source: To re-sign every WAPT packages using the new key (*base*, *host*, *group* and *unit* packages), use the command:
fr: Afin de re-signer tous les paquets WAPT avec la nouvelle clé (les paquets logiciel et les paquets machine), utiliser la commande :

source: My private key has been stolen
fr: Je me suis fait voler ma clé privée

source: **WAPT security relies on protecting your private keys.**
fr: Toute la sécurité de WAPT repose sur la séquestration de cette clé privée.

source: WAPT does not handle key revocation yet (:abbr:`CRL (Certificate Revocation List)`).
fr: WAPT ne gère pas encore la révocation de certificat (CRL).

source: The solution consists in deleting every :file:`.crt` certificate associated to the stolen private key, located in the :file:`C:\\Program Files (x86)\\wapt\\ssl` folder.
fr: La solution consiste à supprimer tous les certificats :file:`.crt` associés à la clé privée volée, situés dans le dossier :file:`C:\\Program Files (x86)\\wapt\\ssl`.

source: That operation can be done using a GPO, manually, or with a WAPT package.
fr: Cette opération peut être effectuée par GPO ou manuellement.

source: My BIOS UUID bugs
fr: Mon UUID BIOS bogue

source: some problems happen sometimes with some BIOSes. WAPT uses the :term:`UUID` of the machine as the host identifier;
fr: il arrive parfois qu'un problème survienne avec certains BIOS. WAPT utilise l':term:`UUID` de la machine comme identifiant pour reconnaître les machines ;

source: the :term:`UUID` is supposed to be unique. Unfortunately, for some :abbr:`OEM (Original Equipment Manufacturers)` and some manufacturing batches, BIOS :term:`UUID` are identical;
fr: l':term:`UUID` BIOS est censé être unique, malheureusement chez certains constructeurs et pour certaines séries de machines, les :term:`UUID` des BIOS sont identiques ;

source: the machine will register in the WAPT console but it will replace an existing device, considering that the machine has only changed its name;
fr: le PC remontera bien dans la console mais il écrasera le PC déjà présent considérant que l'ordinateur a changé de nom ;

source: Solving the BIOS UUID issue
fr: Résolution

source: WAPT allows to generate a random :term:`UUID` to replace the one retrieved from the BIOS.
fr: WAPT permet de générer un :term:`UUID` aléatoire pour remplacer celui indiqué dans le BIOS.

source: WAPTdeploy does not work
fr: Mon WAPTdeploy ne fonctionne pas

source: Symptoms
fr: Symptôme

source: The :program:`waptdeploy` utility does not succeed in installing the WAPT agent.
fr: L'utilitaire :program:`waptdeploy` n'arrive pas à installer l'agent WAPT.

source: Adding the waptagent.exe url
fr: Ajouter l'url pour waptagent.exe

source: Add ``waptsetupurl`` argument in WAPTdeploy GPO arguments of :program:`waptdeploy`.
fr: Ajouter l'argument ``waptsetupurl`` dans les paramètres de la stratégie de déploiement :program:`waptdeploy`.

source: Launching WAPTdeploy locally
fr: Lancer WAPTdeploy localement

source: Launching :program:`waptdeploy` locally can be a good method for showing errors explicitly.
fr: Lancer :program:`waptdeploy` localement peut mettre en évidence un problème en affichant explicitement les erreurs.

source: Example of command to launch:
fr: Exemple de commande à lancer :

source: In our case the hash is not correct.
fr: Dans notre cas le hash n'est pas le bon.

source: Do not forget to start the command prompt as a :term:`Local Administrator`.
fr: Ne pas oublier de lancer l'invite de commande en tant qu':term:`Administrateur`.

source: WAPTdeploy works manually but does not work with GPO
fr: WAPTdeploy fonctionne manuellement mais ne fonctionne pas via GPO

source: Check that port 8088 is listening correctly on host:
fr: Vérifier que la GPO est bien appliquée avec la commande :

source: To force the application of the GPO:
fr: Pour forcer l'application des GPO :

source: If :program:`waptdeploy` does not show up you will have to double check the GPO settings.
fr: Si :program:`waptdeploy` n'apparaît pas, il faut re-vérifier la configuration de la GPO.

source: You may be using an old :program:`waptdeploy` version, download the latest version from `here <https://store.wapt.fr/wapt/releases/latest/waptdeploy.exe>`_.
fr: Vous avez peut-être une version trop ancienne de :program:`waptdeploy`, vous pouvez télécharger la dernière version `ici <https://store.wapt.fr/wapt/releases/latest/waptdeploy.exe>`_.

source: Windows does not wait for the network to be up on startup
fr: Windows n'attend pas le réseau au démarrage

source: By default Windows does not wait for the network to be up at computer startup.
fr: Par défaut Windows n'attend pas le réseau au démarrage de la machine.

source: This can cause problems during :program:`waptdeploy` execution because :program:`waptdeploy` requires network connectivity to retrieve the new WAPT agent.
fr: Cela peut poser soucis pour l'exécution de :program:`waptdeploy` car celui-ci a besoin du réseau au démarrage pour télécharger l'agent WAPT.

source: You can enable the GPO: **Always wait for the network at computer startup and logon**:
fr: Vous pouvez activer la GPO : **Toujours attendre le réseau au démarrage et à la connexion**

source: WAPT Exit will not launch
fr: WAPTexit ne se lance pas

source: Despite the script actually being registered in the local security shutdown strategy, the :program:`waptexit` script does not launch at computer shutdown.
fr: Malgré la présence du script dans les stratégies locales d'arrêt de la machine, :program:`waptexit.exe` ne se lance pas à l'extinction du poste.

source: Solution: Hybrid shutdown
fr: Résolution: Hybrid Shutdown

source: Windows 10 hybrid shutdown must be disabled because it causes many problems and strange behaviors, disabling Hybrid Shutdown will restore exit script execution at shutdown.
fr: Il faut désactiver l'arrêt hybride de Windows10, qui cause par ailleurs beaucoup d'autres comportements étranges. La désactivation de l'arrêt hybride rétablit l'exécution des scripts à l'extinction de la machine.

source: Hybrid shutdown can be disabled by setting a value in :file:`wapt-get.ini` file :ref:`of the WAPT agent <waptexit_ini_file>`.
fr: L'arrêt hybride peut être désactivé en précisant une valeur dans le fichier :file:`wapt-get.ini` de l'agent WAPT, voir :ref:`waptexit_ini_file`.

source: There is a WAPT package to solve the Hybrid Shutdown problem:
fr: Un paquet WAPT existe pour traiter le problème :

source: a WAPT package exists for this purpose: `tis-disable-hybrid-shutdown <https://store.wapt.fr/wapt/tis-disable-hybrid-shutdown_1.0-2_all.wapt>`_.
fr: `tis-disable-hybrid-shutdown <https://store.wapt.fr/wapt/tis-disable-hybrid-shutdown_1.0-2_all.wapt>`_ ;

source: Solution: Windows Home edition
fr: Résolution: Windows Home édition

source: Local security policies are not available when using a Windows Home edition computer, so it is normal that the script will not launch. To circumvent the problem, use scheduled tasks.
fr: Les GPO n'étant pas présentes sur les versions familiales de Windows, il est normal qu'elles ne s'exécutent pas.

source: The workaround consists in using a scheduled task that will launch :file:`C:\\Program Files (x86)\\wapt\\wapt-get.exe` with the argument ``upgrade``.
fr: La solution de contournement est d'utiliser une tâche planifiée qui appelle :file:`C:\\Program Files (x86)\\wapt\\wapt-get.exe` avec le paramètre ``upgrade``.

source: Solution: corrupted local GPO
fr: Résolution: GPO locale corrompue

source: It sometimes occurs that local security policies on the computer are corrupted.
fr: Il peut arriver que les stratégies de groupes locales de la machine soient corrompues.

source: One of the possible solutions is to remove local security strategies by deleting the file :file:`C:\\Windows\\System32\\GroupPolicy\\gpt.ini`, to restart the computer, and finally to re-install the shutdown scheduled tasks:
fr: Une des solutions consiste à supprimer les stratégies locales actuelles en supprimant le fichier :file:`C:\\windows\\system32\\GroupPolicy\\gpt.ini`, puis en redémarrant la machine, et enfin en relançant l'installation de la tâche d'extinction :

source: If the problem occurs again, this may mean that another application also manipulates the local GPO.
fr: Si le problème se reproduit, cela signifie peut être qu'une autre application manipule également la GPO.

source: WAPTExit halts after 15 minutes and does not finish the installing the packages
fr: WAPTexit se coupe après 15 minutes et n'achève pas l'installation

source: By default, Windows shutdown scripts are only allowed to run for 15 minutes.
fr: Par défaut sous Windows, les scripts d'extinction ne peuvent s'exécuter plus de 15 minutes.

source: If a script has not finished before that limit, it will be interrupted.
fr: Si à l'arrêt de la machine, un script d'extinction n'a pas rendu la main au bout de 15 minutes, le script est interrompu.

source: Solution: increase the installation timeout
fr: Solution : augmenter le délai d'installation

source: To solve that problem, increase the ``preshutdowntimeout`` value and the ``max_gpo_script_wait`` value.
fr: Pour résoudre le soucis, il faut modifier la valeur ``preshutdowntimeout`` ainsi que la valeur ``max_gpo_script_wait``.

source: Define these values in :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini` file to change the default behavior.
fr: Définissez ces valeurs dans :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini` pour modifier le comportement par défaut.

source: The WAPT package `tis-wapt-conf-policy <https://store.wapt.fr/wapt/tis-wapt-conf-policy_6_all.wapt>`_ sets this configuration.
fr: Le paquet `tis-wapt-conf-policy <https://store.wapt.fr/wapt/tis-wapt-conf-policy_6_all.wapt>`_ embarque cette configuration.

source: The other solution may be to use the GPO :file:`File.ini`.
fr: L'autre solution est d'utiliser la GPO :file:`File.ini`.

source: Error message when opening the WAPT console
fr: Message d'erreur à l'ouverture de la console

source: The WAPT console can not contact the WAPT Server on port 443.
fr: La console WAPT ne parvient pas à joindre le port 443 du serveur.

source: check whether the :program:`Nginx` web service is running on the WAPT Server:
fr: vérifier si le service :program:`Nginx` est démarré sur le serveur :

source: if :program:`Nginx` is not running, restart the :program:`Nginx` service:
fr: si :program:`Nginx` n'est pas lancé, relancer :program:`Nginx` :

source: Service unavailable
fr: Service Unavaible

source: It is possible that the *waptserver* service is stopped.
fr: Il est possible que le service *waptserver* soit stoppé.

source: check whether :program:`waptserver` is running:
fr: vérifier si le service :program:`waptserver` est en cours d'éxécution :

source: if the command returns nothing, then start the :program:`waptserver` using:
fr: si la commande ne retourne rien, lancer le :program:`waptserver` en utilisant :

source: The WAPT console seems not to be able to verify the server's HTTPS certificate.
fr: La console ne semble pas réussir à vérifier le certificat HTTPS du serveur.

source: Before doing anything, be sure that your are not facing a :abbr:`MITM (Man in the Middle)` attack!
fr: Attention, avant toute chose vérifiez que vous n'êtes pas victime d'une attaque *man in the middle* !

source: If you have just redone your WAPT Server and that you use a self-signed certificate, you can recover the old keys of your old WAPT Server in :file:`/opt/wapt/waptserver/apache/ssl`.
fr: Si vous venez de refaire votre serveur WAPT et que vous utilisez un certificat auto-signé, vous pouvez récupérer les anciennes clés de votre ancien serveur wapt dans :file:`/opt/wapt/waptserver/apache/ssl`.

source: close your WAPT console;
fr: fermer votre console WAPT ;

source: delete the folder :file:`%appdata%\\..\\Local\\waptconsole`;
fr: supprimer le dossier :file:`%appdata%\\..\\Local\\waptconsole` ;

source: launch the command :code:`wapt-get enable-check-certificate`;
fr: lancer ensuite la commande :code:`wapt-get enable-check-certificate` ;

source: be sure that the previous command has gone well;
fr: assurez-vous que la commande précédente s'est bien déroulée ;

source: restart the WAPT service with :code:`net stop waptservice && net start waptservice`;
fr: redémarrer le service WAPT avec :code:`net stop waptservice && net start waptservice` ;

source: restart the WAPT console;
fr: relancer la console WAPT ;

source: In case you do not use the certificate pinning method, this tells you that the certificate sent by the server can not be verified with the python :program:`certifi` bundle of certificates. Be sure to have the full chain of certificates on the WAPT Server.
fr: Dans le cas ou vous ne pratiquez pas le *certificate pinning*, cela signifie que le certificat envoyé par le serveur ne pas être vérifié avec le bundle python :program:`certifi`. Veillez à bien fournir la chaîne complète pour le certificat sur le serveur WAPT.

source: Problems when enabling enable-check-certificate
fr: Problème lors du enable-check-certificate

source: Message "Certificate CN ### sent by server does not match URL host ###"
fr: J'ai le message "certificate CN ### sent by server does not match URL host ### lors du enable-check-certificate"

source: This means that the CN in the certificate sent by the WAPT Server does not match the value of the *wapt_server* attribute in :file:`wapt-get.ini`.
fr: Cela signifie que le CN envoyé par le certificat du serveur ne correspond pas au *wapt_server* du fichier :file:`wapt-get.ini`.

source: Two solutions:
fr: Deux solutions :

source: check the value of *wapt_server* in your :file:`wapt-get.ini`;
fr: vérifier le paramètre *wapt_server* dans votre fichier :file:`wapt-get.ini` ;

source: If the value is correct, this surely means that an error has happened during the generation of the self-signed certificate during server post-configuration (typing error, ...).
fr: Si votre valeur est correcte, cela signifie sûrement qu'une erreur est survenue lors de la génération du certificat autosigné par le post conf, une faute de frappe ...

source: You must then regenerate your self-signed certificates.
fr: Vous pouvez donc regénérer vos certificats autosignés.

source: on the WAPT Server, delete the content of the :file:`/opt/wapt/waptserver/apache/ssl/` folder.
fr: Sur le serveur WAPT, supprimez le contenu du dossier :file:`/opt/wapt/waptserver/apache/ssl/`.

source: Then, relaunch the postconfiguration script (the same as the one used during initial installation, with the same arguments and values).
fr: Ensuite, relancez le script de postconf (le même que pendant l'installation avec les mêmes arguments).

source: Then, be sure that the value of *FQDN for the WAPT Server* is correct.
fr: Enfin, vérifiez bien le nom renseigné lors de l'étape *FQDN for the WAPT serveur* est correcte.

source: you may now retry :command:`enable-check-certificate`.
fr: Vous pouvez maintenant retenter votre :command:`enable-check-certificate`.

source: Problems when creating a package
fr: Problème avec la création de paquet

source: Creating a package via the WAPT console
fr: Création de paquet via la console

source: The drag and drop method of a software in the WAPT console does not work:
fr: Le glisser-déposer dans le dépôt privé dans la console WAPT ne fonctionne pas :

source: the method will not work if the WAPT console has been started without :term:`Local Administrator` privilege;
fr: cela ne fonctionnera pas si la console n'a pas été lancée en tant qu':term:`Administrateur Local` ;

source: the method will not work if the WAPT console has been started with UAC;
fr: cela ne fonctionnera pas si la console WAPT a été lancée avec UAC ;

source: Simple alternative solution: go to :menuselection:`Tools --> Create a package template from an installer --> Choose the installer`.
fr: Solution de contournement simple : passer par :menuselection:`Outils --> Créer un modèle de paquet depuis un installeur --> Choisir un installeur`.

source: the WAPT console does not fill in automatically the informations in the fields:
fr: La console ne renseigne pas automatiquement les informations dans les champs :

source: there are special characters in some file path of the binary;
fr: cela ne fonctionnera pas si vous avez un accent dans le chemin vers le fichier ;

source: the installer does not provide the desired informations;
fr: l'installeur ne fournit peut être pas suffisamment d'informations sur ses propriétés ;

source: Problem with rights in the Windows Command Line utility
fr: Problème de droit avec l'invite de commande Windows

source: When editing a package, if the following message appears:
fr: Lors de l'édition d'un paquet, on obtient le message suivant :

source: OperationnalError: attempt to write a read-only database
fr: OperationnalError: attempt to write a readlony database

source: Solution
fr: Solutions

source: Open a session as :term:`Local Administrator` and redo the desired action.
fr: Ouvrir une session en tant qu':term:`Administrateur Local` et refaire l'opération souhaitée.

source: Problems with access rights and PyScripter
fr: Problème de droits avec PyScripter

source: When trying to install a package from :program:`PyScripter`, if the following message appears:
fr: Lorsqu'on souhaite tester l'installation d'un paquet sur son PC de développement de paquet à partir de :program:`PyScripter`, on obtient le message :

source: My WAPT package is too big and I can not upload it on the repository
fr: Mon paquet WAPT est trop volumineux et je n'arrive pas à l'uploader

source: When a package is too big, it is necessary to :command:`build` it locally then :command:`upload` it with :program:`WinSCP` or an equivalent utility.
fr: Quand un paquet est trop volumineux, il faut en général lancer le builder localement puis l'uploader avec :program:`WinSCP`.

source: build the package with :program:`PyScripter` or manually :ref:`build the package <build_package>`.
fr: :ref:`Builder le paquet dans PyScripter ou manuellement <build_package>`.

source: If the previous :command:`upload` failed, you can find the package in :file:`C:\\waptdev`.
fr: Si l':command:`upload` a précédemment échoué, vous pourrez trouver le paquet généré dans :file:`C:\\waptdev`.

source: download and install :program:`WinSCP` using WAPT:
fr: Télécharger et installer WinSCP à l'aide de WAPT :

source: using :program:`WinSCP`, :command:`upload` your package in :file:`/var/www/html/wapt/` path of you Linux server.
fr: A l'aide de :program:`WinSCP`, téléversez votre paquet dans le dossier :file:`/var/www/html/wapt/` de votre serveur linux.

source: once the upload has finished, you'll need to recreate the :file:`Packages` index file on your repository:
fr: Une fois le transfert terminé, il faut regénérer le fichier :file:`Packages` sur votre dépôt :

source: WAPT package in error
fr: Paquet WAPT en erreur

source: Problem installing a package
fr: Problème d'installation

source: I have a package that returns in error and the software is not installed on the computer when I physically go to check on the computer.
fr: J'ai un paquet en erreur et le logiciel n'est pas installé sur la machine quand je me déplace.

source: Explanation
fr: Explication

source: An error has occurred during the execution of the :file:`setup.py`.
fr: Une erreur est survenue pendant l'exécution de l'installation définie dans :file:`setup.py`.

source: You can read and analyze error messages returned in the console and try to understand and solve them.
fr: Vous pouvez lire et analyser les messages d'erreur retournés dans la console et tenter de les comprendre.

source: The installation of the package will be retried at each :command:`upgrade` cycle until the package does not return an error.
fr: L'installation sera retentée à chaque :command:`upgrade` jusqu'à ce que le paquet ne génère plus d'erreur.

source: if WAPT returns an error code, research the error code on the Internet;
fr: si WAPT fournit un code d'erreur, chercher ce code d'erreur sur Internet ;

source: Example for a MSI: *1618*: another installation in already running. Restarting the computer should solve the problem.
fr: Exemple with a MSI : *1618* : Une autre installation est déjà en cours. Un redémarrage devrait solutionner le problème.
