Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/audit/index.po
Languages: fr

source: audit, WAPT, personalize
fr: audit, WAPT, personnaliser

source: This feature is available in the **Enterprise** version.
fr: Cette fonctionnalité est disponible dans la version **Entreprise**.

source: The audit function allows to make regular checks to desktop configurations and to centralize the results of these checks in the WAPT console. This feature allows you to ascertain that your installed base of machines matches your set of conformity rules over time.
fr: L'audit permet d'effectuer des vérifications régulières sur les configurations des postes et de centraliser le résultat des vérifications dans la console WAPT. Ceci permet de vérifier que votre parc est conforme à votre référentiel sur la durée.

source: For example you can:
fr: Vous pouvez par exemple :

source: regularly check the list of local administrators on the desktops;
fr: vérifier régulièrement la liste des administrateurs locaux des postes ;

source: ascertain over time the correct configuration of a critical software;
fr: vérifier régulièrement la bonne configuration d'un logiciel ;

source: regularly check the presence of the correct version of a piece of software;
fr: vérifier régulièrement la présence de la bonne version d'un logiciel ;

source: ascertain the security settings of a workstation;
fr: vérifier régulièrement les configurations de sécurité d'un poste ;

source: The :command:`audit` function benefits from the depth and the breadth of python libraries for unmatched levels of precision and finesse for your auditing needs.
fr: La fonction :command:`audit` bénéficie de toute la puissance et de l'étendue des librairies python pour atteindre une précision d'audit élevée.

source: Working principle of the audit function
fr: Fonctionnement de l'Audit

source: The :command:`audit` tasks are launched once after every :command:`upgrade`, then regularly as defined with the ``audit_schedule`` value.
fr: Les tâches d':command:`audit` s'exécutent après un :command:`upgrade` puis à intervalle régulier défini par la valeur de ``audit_schedule``.

source: To manually launch an audit check, you may also use the following command:
fr: Pour executer manuellement un audit vous pouvez également exécuter la commande :

source: By default, the audit function will not launch if the audit is note necessary.
fr: Par défaut l'audit ne sera pas exécuté si l'audit n'est pas nécessaire.

source: To force the execution, you may launch the following command:
fr: Pour forcer l'exécution vous pouvez exécuter la commande :

source: Calling this function will launch the :command:`audit` scripts present in each WAPT package installed on the machine.
fr: L'appel à cette fonction permet d'exécuter la partie :command:`audit` de chaque paquet WAPT logiciel installé sur la machine.

source: WAPT saves in its local database :file:`C:\\Program Files (x86)\\wapt\\waptdb.sqlite` the audit scripts of all installed WAPT packages.
fr: WAPT enregistre en base locale les instructions d\'audit de tous les paquets lors de l'installation dans le fichier :file:`C:\Program Files (x86)\wapt\\waptdb.sqlite`.

source: Output example of :code:`wapt-get audit`:
fr: Exemple de sortie de la commande :code:`wapt-get audit` :

source: In the example above, the audit script had already been executed for *tis-disable-js-chrome* and *tis-disable-ipv6* ... but not for *tis-java*.
fr: Dans l'exemple ci-dessus, l'audit avait déjà été exécuté pour *tis-disable-js-chrome*, *tis-disable-ipv6* ... mais pas pour *tis-java*.

source: How to write the audit function
fr: Comment utiliser la fonction d\'audit ?

source: The :command:`audit` script is defined in the package's :file:`setup.py` with a function :command:`def audit()`:
fr: On définit la partie :command:`audit` dans le fichier :file:`setup.py` du paquet dans une fonction :command:`def audit()` :

source: Example:
fr: Exemple :

source: This example ascertains that USB storage is not allowed on the workstation.
fr: Cet exemple permet de vérifier que les clés usb sont bien interdites sur le poste.

source: The audit function returns one of these 3 values:
fr: L'audit restitue une des 3 valeurs suivantes :

source: With the :command:`audit` function, it is not possible to use files that are contained in the WAPT packages.
fr: Avec :command:`audit`, il n'est pas possible de faire appel à des fichiers contenus dans le paquet.

source: To use files embedded in the WAPT package that will be used for an audit, you must first copy the file(s) in a temporary folder during package installation.
fr: Pour utiliser des fichiers lors de l'audit il faut d'abord les copier dans un répertoire temporaire de la machine lors de l'installation du paquet.

source: Planning an audit
fr: Planifier un audit

source: The value is contained in the control file of your package.
fr: La valeur est contenue dans le fichier :file:`control` du paquet WAPT.

source: By default, if :command:`audit_schedule` is empty, the audit task will need to be launched manually or from teh WAPT console.
fr: Par défault si :command:`audit_schedule` est vide alors il faudra effectuer l'audit manuellement ou à partir de la console.

source: Otherwise, the periodicity may be indicated in several ways:
fr: Sinon la valeur peut être indiquée de plusieurs manières :

source: Default behavior of the audit function
fr: Audit par défaut

source: By default, the only audit function checks the presence of UninstallKey for its WAPT package.
fr: Par défault, si aucun audit n'est déclaré, l'agent WAPT vérifiera la présence des uninstallkey du paquet wapt.

source: This way, WAPT ascertains that the software is still present on the host, according to the host configuration.
fr: De cette manière WAPT vérifie que le logiciel est toujours présent.
