Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/windows/change-port.po
Languages: fr

source: Changing the listening port of the WAPT Server
fr: Changer le port d'écoute du serveur

source: port, Windows, WAPT, firewall, IIS, Nginx, documentation
fr: port, Windows, WAPT, pare-feu, IIS, Nginx, documentation

source: In some cases, it is not possible to install the WAPT Server on a Windows machine because a service already occupies ports 80 and 443.
fr: Dans certains cas, il n'est pas possible d'installer le serveur WAPT sur un serveur Windows car un service occupe déjà les ports 80 et 443.

source: It is the case if for example, a IIS web service is active on the host (example: anti-virus server, WSUS, web server ...).
fr: C'est le cas par exemple si un IIS est actif sur la machine. (Exemple : serveur anti-virus, WSUS, Serveur Web ...)

source: In that case, we will change the listening port on the :program:`Nginx` web server integrated to the WAPT Server.
fr: Dans ce cas, nous allons donc changer le port d'écoute du serveur web :program:`Nginx` intégré au Serveur WAPT.

source: Installing the WAPT Server
fr: Installer le Serveur WAPT

source: The installation of WAPT still needs ports 80 and 443 be available when installing the WAPT Server, so the first step consists of stopping the service that listens on ports 80 and/ or 443 (IIS/ Anti-virus).
fr: l'installation de WAPT a tout de même besoin que les ports 80 et 443 soient disponibles au moment de l'installation, donc couper le service qui écoute sur le port 80 et / ou 443 (IIS / Antivirus).

source: launch now the installation of the WAPT Server and follow the post-configuration procedure, but do not launch the WAPT console. If you need guidance, you may follow the documentation to :ref:`install the WAPT Server on Windows <wapt-server_win_install>`.
fr: lancer maintenant l'installation du serveur WAPT et suivre la procédure du postconf, mais ne pas lancer pas la console WAPT. Si vous avez besoin d'aide, vous pouvez suivre la documentation pour :ref:`installer le serveur WAPT sur Windows <wapt-server_win_install>`.

source: now stop the :program:`Nginx` service and the WAPT service:
fr: stopper maintenant le service :program:`Nginx` et le service WAPT :

source: finally, restart the service that listens on ports 80 and/ or 443 (IIS/ Anti-virus / Web server ...);
fr: redémarrer enfin le service qui écoute sur le port 80 et / ou 443 (IIS / Antivirus / Serveur Web ...) ;

source: Configuring the new listening ports in the Nginx
fr: Modifier le port dans la configuration Nginx

source: open the file :file:`C:\\Program Files (x86)\\wapt\\waptserver\\nginx\\conf\\nginx.conf`
fr: ouvrir le fichier :file:`C:\\Program Files (x86)\\wapt\\waptserver\\nginx\\conf\\nginx.conf`

source: replace the lines:
fr: remplacer les lignes :

source: with:
fr: par :

source: restart :program:`Nginx` with :code:`net start WAPTNginx`;
fr: relancer :program:`Nginx` avec :code:`net start WAPTNginx` :

source: open :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`;
fr: ouvrir :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini` ;

source: add the port to the specified URL, example:
fr: ajouter le port a l'url indiquée, exemple :

source: restart the WAPT service with :code:`net start waptservice`;
fr: redémarrer ensuite le service WAPT avec :code:`net start waptservice` ;

source: Making changes to firewall rules on the Windows devices
fr: Modifier les règles de pare-feu Windows

source: You must now make changes to the two waptserver rules that were created during initial installation: waptserver *waptserver 80* and *waptserver 443*.
fr: Vous devez maintenant modifier les deux règles waptserver créées pendant l'installation : waptserver *waptserver 80* et *waptserver 443*.

source: change the listening ports:
fr: changer les ports :

source: Changing from port 80 to 8000
fr: Modification du port de 80 a 8000

source: Changing from port 443 to 8443
fr: Modification du port de 443 a 8443

source: Go on to the next step to :ref:`launch the WAPT console <starting-waptconsole>`.
fr: Passer à l'étape suivante pour :ref:`lancer la console WAPT <starting-waptconsole>`.

source: If you had already launched the WAPT console, do not forget to change the port values in the WAPT console configuration file by clicking the :guilabel:`Wrench` on the console login screen.
fr: Si vous aviez déjà démarré la console WAPT, ne pas oublier de modifier aussi le port dans la configuration de la console en cliquant sur la :guilabel:`clé à molette` sur la mire de connexion.
