Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/changes-1.3-1.5.po
Languages: fr

source: Changes between versions 1.3 and 1.6 and consequences
fr: Changements entre 1.3 et 1.5/1.6 et conséquences

source: WAPT, documentation, changes, 1.3.13, 1.5/1.6, consequences, PostgreSQL, MongoDB, Nginx, Websockets, UUID, Code Signing
fr: WAPT, documentation, changements, 1.3.13, 1.5/1.6, conséquences, PostgreSQL, MongoDB, Nginx, Websockets, UUID, Code Signing

source: PostgreSQL has replaced MongoDB in WAPT
fr: PostgreSQL a remplacé MongoDB dans WAPT

source: The database :program:`MongoDB` has been replaced by :program:`PostgreSQL` with JSON support.
fr: La base de données MongoDB a été remplacée par PostgreSQL avec le support JSON.

source: The consequence is that **Administrators that have developed reports based on MongoDB will have to adapt their queries.**
fr: La conséquence est que **ceux et celles qui avaient développé du reporting s'appuyant sur MongoDB devront adapter leurs requêtes**.

source: Nginx is now the only supported web server in WAPT
fr: Nginx est le seul serveur web aujourd'hui supporté dans WAPT

source: Introducing Websockets in WAPT brings large benefits:
fr: L'introduction des Websockets dans WAPT apporte de nombreux bénéfices :

source: status updates from WAPT agents are instantaneous in the WAPT console;
fr: la remontée des changements d'état des clients dans la console est instantanée ;

source: when the :term:`Administrator` launches immediate actions, it is no longer the WAPT Server that connects to the WAPT agent; the WAPT agent establishes and maintains a permanent connection with the WAPT Server;
fr: quand l':term:`Administrateur` force une mise à jour à effet immédiat, ce n'est plus le serveur qui établit une connexion avec l'agent ; l'agent WAPT maintient une connexion permanente avec le serveur ;

source: the Websockets avoid having to have a local listening port on the clients, improving the global security of WAPT equipped Organizations;
fr: les Websockets évitent de maintenir ouvert un port en écoute sur le poste, améliorant ainsi la sécurité du dispositif ;

source: since it is the WAPT agent that initiates and maintains a connection with the WAPT Server, connections travel through proxies and firewalls in a standard manner;
fr: puisque l'agent WAPT initie et maintient une connexion avec le serveur, nous pouvons franchir plus facilement les proxys et les pares-feu ;

source: :program:`Nginx` is the only web server capable of handling a very large quantity of Websockets. This technology is not something completely trivial to implement and maintain.
fr: :program:`Nginx` est le seul serveur web capable de gérer une grande quantité de Websockets. Cette technologie n'est pas quelque chose de trivial à implémenter et à maintenir.

source: As a consequence, **support for IIS and Apache in WAPT is abandoned**.
fr: En conséquence, **le support IIS et Apache dans WAPT est abandonné**.

source: Signature hashes are sha256 instead of sha1
fr: Les hashs pour les signatures sont en sha256 au lieu de sha1

source: Control sums for the list of files in the WAPT package and the signature of the attributes in the :file:`control` file are now sha256 hashed instead of sha1 hashed to satisfy security requirements of cyberdefense agencies.
fr: Les sommes de contrôle pour la liste des fichiers du paquet et la signature des attributs du fichier control sont maintenant des hashs sha256 au lieu de sha1 pour satisfaire les recommandations des organismes de sécurité.

source: As a consequence, **all packages must be re-signed and the :file:`Packages` index files of all repositories must be regenerated**.
fr: En conséquence, **nous devons resigner tous les paquets du dépôt et regénérer l'index :file:`Packages` du dépôt**.

source: A script allows to massively re-sign all packages on the WAPT Server.
fr: Un script permet de resigner en masse tous les paquets sur le serveur.

source: The host packages are now named after the UUID of the host
fr: Les paquets machines sont nommés avec l'UUID du poste

source: In versions <= 1.3.xx, host packages are named with the :abbr:`FQDN (Fully Qualified Domain Name)` of the client host.
fr: Dans les versions <= 1.3.xx, les paquets machines sont nommés avec le nom complet du poste client.

source: This poses some problems if the host is joined to another domain, or if the host is not joined to a domain, yet goes from a network to another with different DHCP settings.
fr: Cela pose des problèmes lorsque la machine change de domaine, ou que la machine n'est pas dans un domaine mais change de réseau avec des noms de réseau DHCP différents.

source: In version >= 1.5, the *host* packages are named after the UUID of the client host, thus resolving the problems described above.
fr: Dans les versions >= 1.5, le paquet machine est nommé avec l'UUID du poste client, résolvant les problèmes décrit ci-avant.

source: As a consequence, **host packages must be re-created and re-signed**.
fr: En conséquence, **il faut recréer et res-signer les paquets machines**.

source: A script on the WAPT Server allows to do this operation automatically.
fr: Un script sur le serveur permet de faire cette opération automatiquement.

source: Code Signing attribute for signing base packages
fr: Attribut Code Signing pour les certificats des paquets logiciels

source: To differentiate between the roles of :term:`Package Deployer` and :term:`Package Developer`, the WAPT agent verifies the **Code Signing** attribute of the certificate that has signed the package.
fr: Pour différencier les rôles de :term:`Déployeur de Paquets` de celui de :term:`Développeur de Paquets`, le client WAPT vérifie l'attribut **Code Signing** du certificat qui a signé le paquet.

source: If the package contains python executable code, i.e. a :file:`setup.py` file, then the package must be signed with a certificate having the **Code Signing** attribute. **Otherwise, the package will not install**.
fr: Si le paquet contient du code python, c'est-à-dire qu'un fichier :file:`setup.py` est présent, alors il doit être signé avec un certificat **Code Signing**. Sinon, il ne s'installera pas.

source: As a consequence, **it is necessary to generate and deploy a Code Signing Certificate on the WAPT equipped hosts**, and re-sign *base* packages (i.e. software packages) with a **Code Signing** certificate.
fr: En conséquence, **il faut recréer et déployer un certificat code signing sur le parc**, et resigner les paquets logiciels avec un certificat de type **Code Signing**.

source: The certificate is deployed during the upgrade of the WAPT agent.
fr: Le certificat est déployé lors de la mise à jour de l'agent WAPT.
