Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/waptserver-update-centos.po
Languages: fr

source: Performing minor updates on a CentOS/ RedHat based WAPT Server
fr: Effectuer des mises à jour mineures sur un serveur WAPT basé sur CentOS / RedHat

source: CentOS, RedHat, WAPT, documentation, examples, update, updating
fr: CentOS, RedHat, WAPT, documentation, exemples, mettre à jour

source: Ports 80 and 443 are used by the WAPT Server and must be available.
fr: Les ports 80, 443 sont utilisés par le serveur WAPT et doivent être disponibles.

source: first of all, update the CentOS/ RedHat underlying distribution:
fr: d'abord mettre à jour le serveur CentOS / RedHat subjacent ;

source: Modify the repository address then launch the upgrade.
fr: Modifier l'adresse du dépôt puis lancer la mise à niveau.

source: To access WAPT Enterprise ressources, you must use the username and password provided by our sales department.
fr: Pour accéder au site de téléchargement WAPT Enterprise, vous devez utiliser le nom d'utilisateur et le mot de passe fournis par notre service commercial.

source: Replace **user** and **password** in the **baseurl** parameter to access WAPT Enterprise repository.
fr: Remplacez **user** et **password** dans le paramètre **baseurl** pour accéder au dépôt WAPT Enterprise.

source: modify the repository address then launch the upgrade:
fr: modifier l'adresse du dépôt puis lancer la mise à niveau :

source: launch the post-configuration step:
fr: lancer la post-configuration :

source: we advise that you launch the post-configuration steps after each server upgrade so that the server uses the latest configuration format;
fr: il est recommandé de lancer la post-configuration après chaque mise à jour pour que le serveur utilise le format de configuration le plus sûr ;

source: it is not required to reset a password for the WAPT console during the post-configuration step;
fr: il n'est pas obligatoire de redéfinir un mot de passe pour la console WAPT lors de la post-configuration ;

source: if you have personalized the configuration of :program:`Nginx`, do not answer :guilabel:`Yes` when the post-configuration asks you to configure :program:`Nginx`;
fr: si vous avez personnalisé la configuration de :program:`Nginx`, ne pas répondre :guilabel:`Oui` lorsque postconf vous demande de configurer :program:`Nginx` ;

source: with WAPT 1.8 post-configuration, WAPT WUA packages will be moved from their current storage location to the waptwua root folder (:file:`/var/www/waptwua`).
fr: avec la post-configuration WAPT 1.8, les paquets WAPT WUA seront déplacés de leur emplacement de stockage actuel vers le dossier racine de waptwua (:file:`/var/www/waptwua`).

source: if repository replication has been set, all KB/CAB packages will be re-synchronized on remote repositories.
fr: si la réplication de dépôts à été mise en place, cela aura pour conséquence de resynchroniser toutes les KB/CAB sur vos dépôts distants.

source: start the WAPT Server:
fr: démarrer le serveur WAPT :

source: upgrade the WAPT console by following the same set of steps as :ref:`installing the WAPT console <installing_the_WAPT_console>`;
fr: mettre à jour la console WAPT en suivant la même procédure que pour :ref:`installer la console WAPT <installing_the_WAPT_console>` ;

source: then :ref:`create the WAPT agent <create_WAPT_agent>`:
fr: puis :ref:`créer l'agent WAPT <create_WAPT_agent>` :

source: You will have to keep the same prefix for your packages and change nothing in relation to the private key/ public certificate pair!
fr: Cependant, il faudra conserver le même préfix et surtout ne rien changer concernant le couple clé privée / clé publique !

source: This will generate a **waptupgrade** package in the private repository.
fr: Cela va générer un paquet **waptupgrade** dans le dépôt privé.

source: There are two methods for deploying the updates:
fr: Il y a deux manières de déployer la mise à jour :

source: using a :abbr:`GPO (Group Policy Object)` and :program:`waptdeploy`;
fr: soit utiliser une :abbr:`GPO (Group Policy Object)` et :program:`waptdeploy` ;

source: using a :program:`waptupgrade` package and deploy it using WAPT;
fr: soit créer un paquet **waptupgrade** et l'affecter à l'ensemble du parc ;

source: update the WAPT agents:
fr: mettre à jour les clients WAPT :

source: The steps to follow to update WAPT agents are the same as the ones to first install the WAPT agents.
fr: La procédure à suivre pour la mise à jour des clients est la même que pour la première installation.

source: Download and install the latest version of the WAPT agent by visiting http://wapt.mydomain.lan/wapt/waptagent.exe.
fr: Télécharger et installer la dernière version de l'agent WAPT qui a été mis à jour : https://wapt.mydomain.lan/wapt/waptagent.exe.

source: As mentioned above, this procedure may be made automatic with a GPO or a **waptupgrade** package.
fr: Comme mentionné ci-dessus, cette procédure peut s'automatiser avec une GPO ou un paquet de mise à jour **waptupgrade**.
