Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security-principles/safety-principle.po
Languages: fr

source: Technically, it may be implemented in two ways:
fr: L'implémentation technique peut être basée sur deux méthodes :

source: by using a certificate verification tool implemented in the configuration file of WAPT's :program:`Nginx` web server; this method is typically provided by a :term:`Certificate Authority` that is trusted by your network;
fr: utiliser un utilitaire de vérification de certificat implémenté dans la configuration du service :program:`Nginx` du serveur WAPT ; cette méthode est généralement fournie par une :term:`Autorité de Certification` validée pour votre réseau ;

source: by using the *certificate pinning* method, which consists of providing the WAPT agent a short list of trusted certificates that will be stored in :file:`C:\\Program Files (x86)\\wapt\\ssl\\server`;
fr: utiliser la méthode d'*épinglage de certificat* qui consiste a fournir à l'agent WAPT une liste de certificats de confiance qui sera stockée et maintenue dans le dossier :file:`C:\Program Files (x86)\wapt\ssl\server` ;

source: Security function F1C: no listening port on the WAPT agents
fr: Fonction de sécurité F1C : Aucun port n'écoute sur les agents WAPT

source: an unauthorized entity using an open port fraudulently;
fr: éviter qu'une entité non-autorisée utilise un port ouvert à mauvais escient ;

source: The connections to the WAPT Server are initiated exclusively by the agents, and the forced immediate actions are relayed through a permanent websocket initiated by the WAPT agent (:command:`update`/ :command:`upgrade`/ :command:`install` ...).
fr: Les connexions vers le serveur WAPT sont exclusivement initiées pas les clients, et les différentes actions instantanées (:command:`update` / :command:`upgrade` / :command:`install` ...) passent au travers d'une connexion permanente par une Websocket initiée par l'agent WAPT.

source: if HTTPS is activated, then the WAPT agent checks that the websocket is connecting to the rightful server.
fr: si HTTPS est activé, l'agent vérifie que la Websocket s'établit bien avec le bon serveur.

source: Security function F1D: signature of inventory return states
fr: Fonction de sécurité F1D : Signature des remontées d'inventaire

source: an unauthorized entity sending a fake inventory for a device that rightfully exists in the database;
fr: éviter qu'une entité non-autorisée envoie un inventaire falsifié d'une machine existante dans la base de données WAPT ;

source: On the first :command:`register`, each device generates a key/ certificate pair that is stored in :file:`C:\\Program Files (x86)\\wapt\\private`, only accessible in read-only mode to :term:`Local Administrators`. Once the device has successfully registered, the public key is sent to the WAPT Server;
fr: Au premier :command:`register`, chaque machine crée un couple clé privée / certificat public dans le répertoire :file:`C:\Program Files (x86)\wapt\private` accessible en lecture uniquement aux :term:`Administrateurs Locaux`. Une fois la machine enregistrée, la clé publique est envoyée au serveur WAPT ;

source: When the inventory is updated, the new inventory status is sent along with the private key of the device. The new inventory is then decrypted with the public key stored in the database;
fr: Lors d'une mise à jour de l'inventaire, le nouvel inventaire est envoyé signé avec la clé privée de la machine et déchiffré par la clé publique enregistrée dans la base de données ;

source: The server will refuse any inventory that is signed with a wrong key;
fr: Le serveur refusera de valider tout inventaire signé avec une mauvaise clé ;

source: Security function F1E: verification of authorizations before launching of WAPT commands
fr: Fonction de sécurité F1E : Vérification des droits avant l'exécution de certaines actions WAPT

source: avoid the execution of sensitive tasks on WAPT clients by unauthorized entities;
fr: éviter l'exécution de tâches sensibles par des entités non-autorisées ;

source: The :term:`Users` interact with WAPT through WAPT user interfaces (:program:`wapt-get` in command line interface, :program:`wapttray`, :program:`waptexit`, :program:`waptselfservice`).
fr: Les :term:`Utilisateurs` interagissent avec WAPT au travers des interfaces WAPT (:program:`wapt-get` en ligne de commande, :program:`wapttray`, :program:`waptexit`, :program:`waptselfservice`).

source: The user interfaces then delegate the execution of the desired tasks to the local WAPT service running as system account.
fr: Les interfaces peuvent ensuite déléguer l'exécution des tâches souhaitées au service WAPT local fonctionnant en compte système.

source: The following actions do not require to be authenticated with the WAPT service:
fr: Les actions qui enclenchent des modifications listées ci-dessous ne nécessitent pas d'authentification auprès du service WAPT :

source: :code:`wapt-get update` (update the available list of packages);
fr: :code:`wapt-get update` (mettre à jour la liste des paquets disponibles) ;

source: :code:`wapt-get upgrade` (launch waiting upgrades);
fr: :code:`wapt-get upgrade` (lancer l'installation des mises à jour en attente) ;

source: :code:`wapt-get download-upgrade` (download waiting upgrades);
fr: :code:`wapt-get download-upgrade` (télécharger les mises à jour en attente) ;

source: :code:`wapt-get clean` (remove packages left in cache after installation);
fr: :code:`wapt-get clean` (supprimer des paquets restés en cache après installation) ;

source: stop any running WAPT task;
fr: stopper n'importe quelle tâche WAPT en cours ;

source: stop/ reload the WAPT service;
fr: stopper / relancer le service WAPT ;

source: The other actions require the :term:`User` be authenticated and the :term:`User` either be a member of the **waptselfservice** Active Directory security group, or be a :term:`Local Administrator`, they are:
fr: Les autres actions nécessitent que l':term:`Utilisateur` s'authentifie et que son compte appartienne au groupe de sécurité Active Directory **waptselfservice** ou que l':term:`Utilisateur` soit :term:`Administrateur Local`, exemple d'action :

source: :code:`wapt-get install`: requests the WAPT agent to install a WAPT package flagged as **MISSING**;
fr: :code:`wapt-get install` : ordonner à l'agent WAPT d'installer un paquet WAPT marqué **MISSING** sur la machine ;

source: :code:`wapt-get remove`: requests the WAPT agent to remove a package;
fr: :code:`wapt-get remove` : ordonner à l'agent WAPT de supprimer un paquet WAPT ;

source: :code:`wapt-get forget`: requests the WAPT agent to forget the existence of a previously installed WAPT package without removing the software or the configuration;
fr: :code:`wapt-get forget` : ordonner à l'agent WAPT d'oublier l'existence d'un paquet WAPT installé sur la machine sans le désinstaller ;

source: Security function F2: protecting the integrity of the installation process of WAPT packages
fr: Fonction de sécurité F2 : Protection de l'intégrité du processus d'installation des paquets WAPT

source: Security function F2A: signature of WAPT packages
fr: Fonction de sécurité F2A : Signature des paquets WAPT

source: to avoid an unauthorized entity modifying the content or the behavior of a WAPT package;
fr: éviter qu'une entité non-autorisée modifie le contenu ou le comportement d'un paquet WAPT ;

source: when an :term:`Administrator` or a :term:`Package Deployer` builds a WAPT package, the file :file:`manifest.sha256` is created that lists the control sums of all files in the package;
fr: quand un :term:`Administrateur` ou un :term:`Déployeur de Paquets` construit un paquet WAPT, un fichier :file:`WAPT\manifest.sha256` est créé qui liste les sommes de contrôle de tous les fichiers du paquet ;

source: a file :file:`signature.sha256` **encrypted** with the WAPT agent's private key is then created in the folder :file:`<WAPT>`; it contains the control sum of the file :file:`manifest.sha256`;
fr: un fichier :file:`signature.sha256` **chiffré** avec la clé privée est ensuite créé dans le dossier :file:`WAPT`, il contient la somme de contrôle du fichier :file:`WAPT\manifest.sha256` ;

source: the whole is then compressed and suffixed with a *.wapt* extension;
fr: l'ensemble est archivé avec l'extension *.wapt* ;

source: when a WAPT agent downloads a WAPT package, the agent checks that the file :file:`signature.sha256` has been signed with the private key that matches the certificate present in the folder :file:`certificate.crt`;
fr: quand un agent WAPT télécharge un paquet WAPT, l'agent vérifie que le fichier :file:`signature.sha256` a été signé avec la clé privée qui correspond au certificat présent dans le dossier :file:`WAPT\certificate.crt` ;

source: the WAPT agent then checks that the certificate or the chain of certificates in :file:`certificate.crt` has been signed with a key matching one of the certificates present in the folder :file:`C:\\Program Files (x86)\\wapt\\ssl`;
fr: l'agent WAPT vérifie ensuite que le certificat (ou la chaîne de certificat) :file:`certificate.crt` a bien été signé avec une clé privée correspondant à un des certificats présents dans le dossier :file:`C:\Program Files (x86)\wapt\\ssl` ;

source: the WAPT agent then generates the control sum of all the files contained in the package (except the files :file:`signature.sha256` and :file:`certificate.crt `) and verifies that it matches the file :file:`manifest.sha256` contained in the package;
fr: l'agent WAPT fait ensuite la somme de contrôle de tous les fichiers du paquet (excepté les fichiers :file:`signature.sha256` et :file:`certificate.crt` ) et vérifie que cela correspond au fichier :file:`WAPT\manifest.sha256` du paquet ;

source: if one of these steps does not pass, this means that a file has been modified/ added/ removed. The execution of the :file:`setup.py` is then canceled.
fr: si l'une de ces étapes n'est pas validée, alors cela signifie qu'un fichier a été modifié / ajouté / supprimé. Alors, l'exécution du :program:`setup.py` est annulée ;

source: the altered package is then deleted from the local cache and the event is journalized in the logs of the agent;
fr: le paquet en défaut est ensuite supprimé du cache local ; l'évènement est rapporté dans les log de l'agent ;

source: Since the version 1.5 of WAPT, the format of the :file:`manifest` file has changed from *sha1* to *sha256*.
fr: Depuis la version 1.5, le fichier :file:`manifest` est passée de *sha1* à *sha256*.

source: Security function F2B: signature of the attributes in the control files
fr: Fonction de sécurité F2B : Signature des attributs du fichier *control*

source: an unauthorized entity modifying WAPT dependencies on WAPT equipped devices by falsifying :file:`https://waptserver/wapt/Packages`;
fr: éviter qu'une entité non-autorisée modifie des dépendances WAPT sur la machine en falsifiant le fichier :file:`https://waptserver/wapt/Packages` ;

source: When a WAPT package is signed, the sensitive attributes of the package are listed inside the **signed_attributes** attribute of the control file.
fr: Lors de la signature d'un paquet WAPT, les attributs sensibles du paquet sont listés dans l'attribut **signed_attributes**.

source: Example of a *signed_attributes* list:
fr: Exemple d'une liste *signed_attributes* :

source: The attributes listed in *signed_attributes* are signed with the private key of the :term:`Administrator` and stored in the attribute *signature* of the :file:`control` file.
fr: Les attributs listés dans *signed_attributes* sont signés avec la clé privée de l':term:`Administrateur` et la signature est stockée dans l'attribut *signature* du fichier :file:`control`.

source: The certificate matching the private key is stored in :file:`<WAPT>\\certificate.crt` inside the WAPT package.
fr: Le certificat associé à cette clé privée est stocké dans le fichier :file:`<WAPT>\certificate.crt` à l\'intérieur du paquet WAPT.

source: On the WAPT Server, the index :file:`Packages` is regenerated when the :command:`wapt-scanpackages` command is triggered by adding or removing a package.
fr: Sur le serveur WAPT, lors de l'opération :command:`wapt-scanpackages` (déclenchée par un ajout ou suppression de paquet), l'index :file:`Packages` des paquets est régénéré.

source: The WAPT Server extracts from each package the certificate of the signer and adds it in the :file:`Packages` zip file in the directory :file:`ssl`. Each certificate is named after its hexadecimal encoded fingerprint.
fr: Le serveur WAPT extrait de chaque paquet le certificat du signataire et l'ajoute dans le fichier ZIP :file:`Packages`, dans le répertoire :file:`ssl`. Chaque certificat est nommé avec sa fingerprint encodée en hexadécimal.

source: When the WAPT agent launches an :command:`update`, it downloads the :file:`Packages` index file that contains the signed attributes of all available packages and the certificates of the signers.
fr: Lorsque le client WAPT effectue un :command:`update` (mise à jour des paquets disponibles), il télécharge le fichier index :file:`Packages`, qui contient à la fois les attributs signés de tous les paquets et les certificats des signataires.

source: If the signer's certificate is approved, which means that the certificate has been signed by a Trusted :term:`Certificate Authority` or that the certificate itself is trusted, AND if the signer's certificate can verify the attributes' signature, the package is added to the index of available packages. Otherwise it is ignored.
fr: Si le certificat du signataire des attributs d'un paquet est approuvé (ce qui signifie que ce certificat est signé par une :term:`Autorité de Certification` ou que le certificat lui-méme est de confiance), **ET** que le certificat du signataire peut vérifier la signature des attributs, le paquet est ajouté à l'index des paquets disponibles, sinon il est ignoré.

source: Security function F2C: access restriction to the installation folder of the WAPT agent
fr: Fonction de sécurité F2C : Restriction d'accès au répertoire d'installation de l'agent WAPT

source: an unauthorized entity modifying the behavior of a WAPT agent;
fr: éviter qu'une entité non-autorisée modifie le comportement de l'agent WAPT ;

source: The installation folder :file:`C:\\Program Files (x86)\\wapt` is accessible in read-write mode:
fr: Le répertoire d'installation :file:`C:\Program Files (x86)\wapt` est accessible en lecture et modification :

source: to the :term:`Local Administrators` by direct access to the installation folder of the WAPT agent on the device;
fr: aux :term:`Administrateurs Locaux` à travers un accès local au répertoire d'installation de l'agent WAPT ;

source: to the :term:`Administrators` through the deployment of WAPT agent upgrades;
fr: aux :term:`Administrateurs` à travers le mécanisme de déploiement des mises à jour de l'agent WAPT ;

source: Neither the :term:`Package Deployers`, nor the :term:`Users` have write-access to the WAPT agent's installation folder.
fr: Ni les :term:`Déployeurs de Paquets`, ni les :term:`Utilisateurs` n'ont d'accès en écriture au répertoire d'installation de l'agent WAPT.

source: Security function F2D: total access restriction to the folder storing the key / certificate for inventory signing
fr: Fonction de sécurité F2D : Restriction totale d'accès au répertoire de stockage du couple clé privé / certificat de signature d'inventaire

source: an unauthorized entity falsifying an inventory status update;
fr: éviter qu'une entité non-autorisée falsifie une remontée d'inventaire ;

source: an unauthorized entity impersonating the identity of a WAPT equipped device;
fr: éviter qu'une entité non-autorisée usurpe l'identité d'une machine ;

source: No access right is granted to any :term:`user` to :file:`C:\\Program Files (x86)\\wapt\\private`, whomever he may be. Only the WAPT agent has a write and read access to this folder.
fr: Aucun droit d'accès au répertoire :file:`C:\Program Files (x86)\wapt\private` n'est accordé à aucun :term:`Utilisateur`, quelqu'il soit. Seul l'agent WAPT a accès en lecture et écriture à ce répertoire.

source: This method for storing the key and the certificate results from a technical design choice that says that the WAPT equipped device would embed any and all information related to itself.
fr: Le stockage du couple clé privée / certificat découle d'un choix technique qui consiste à dire que la machine détient seule toutes les informations qui la concernent.

source: Security function F3: securing the communications between the different components of WAPT
fr: Fonction de sécurité F3 : Sécurisation des communications entre les différents composants WAPT

source: Security function F3A: signature of immediate action calls sent to the WAPT agents
fr: Fonction de sécurité F3A : Signature des requêtes envoyées aux agents WAPT

source: an unauthorized entity sending falsified requests to the WAPT agents;
fr: éviter qu'une entité non-autorisée envoie des requêtes falsifiées aux agents WAPT ;

source: The following commands are signed by the WAPT Server before being relayed to the targeted WAPT agents via their Websockets:
fr: Les commandes ci-dessous sont signées par le serveur WAPT avant d'être envoyées au travers de la Websocket à l'agent WAPT destinataire de la commande :

source: :code:`wapt-get update-status`: requests the WAPT agent to send its current inventory status to the WAPT Server;
fr: :code:`wapt-get update-status` : ordonner à l'agent WAPT de renvoyer l'état de son inventaire actuel au serveur WAPT ;

source: :code:`wapt-get upgrade`: requests the WAPT agent to execute a package flagged as **NEED UPGRADE**
fr: :code:`wapt-get upgrade` : ordonner à l'agent WAPT d'exécuter les paquets marqués **NEED UPGRADE** ;

source: :code:`wapt-get update`: requests the WAPT agent to update the list of available packages;
fr: :code:`wapt-get update` : ordonner à l'agent WAPT de mettre à jour la liste des paquets disponibles ;

source: All the attributes in the requests for immediate action are signed:
fr: L'ensemble des attributs de cette requête sont signés :

source: the device's :term:`UUID`;
fr: l':term:`UUID` du poste ;

source: the action (ex: :command:`install`);
fr: l'action (ex: install) ;

source: the arguments (ex: tis-firefox);
fr: les arguments (ex: tis-firefox) ;

source: the timestamp of the requests;
fr: l'horodatage des demandes ;

source: The certificate matching the signature is passed along:
fr: Le certificate associé à la signature est également passé :

source: upon receiving a request, the WAPT agent verifies that the request has been properly signed;
fr: à la réception d'une requête par l'agent WAPT, il vérifie que la requête est correctement signée ;

source: the agent will the verify that the timestamp is within a one minute delay window;
fr: il vérifie ensuite que la date fournie en argument ne dépasse pas une 1 minute de décalage ;

source: ultimately, the agent will verify that the certificate is authorized to launch actions;
fr: il vérifiera enfin que le certificat associé est autorisé à lancer des commandes ;
