Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security-principles/safety-principle.po
Languages: fr

source: Presentation of the security principles in WAPT
fr: Présentation des principes de sécurité

source: WAPT, Users, Package Deployer; Package Developer, SuperAdmin, Local Administrator, availability, integrity, confidentiality, authenticity, cyberdefense, ANSSI, security, cybersecurity
fr: WAPT, Utilisateur, Gestionnaire de Déploiement, Développeur de Paquets, SuperAdmin, Administrateur Local, disponibilité, intégrité, confidentialité, authenticité, cyberdéfense, ANSSI, sécurité, cybersécurité

source: Preamble and definitions
fr: Préambule et définitions

source: The WAPT service operates as a **privileged** system account.
fr: Le service WAPT fonctionne en compte système **privilégié**.

source: From WAPT version 1.5, the default installation directory becomes :file:`C:\\Program Files (x86)\\wapt`.
fr: A partir de la version 1.5 de WAPT, le répertoire d'installation par défaut devient :file:`C:\Program Files (x86)\wapt`.

source: the sub-components :program:`wapttray`, :program:`waptservice` and :program:`waptexit` of the WAPT agent may be optionally deactivated according to usage context.
fr: Les sous-composantes :program:`wapttray`, :program:`waptservice` et :program:`waptexit` de l'agent WAPT peuvent être optionnellement désactivées en fonction du contexte d'usage.

source: Perimeter to secure
fr: Périmètre à sécuriser

source: The elements to secure and that strictly concern WAPT are:
fr: Les éléments à sécuriser qui concernent strictement WAPT sont :

source: **the WAPT Server** (*waptserver*);
fr: **le serveur WAPT** (*waptserver*) ;

source: **the WAPT agents** (*wapt-get*) and its sub-components (*wapttray*, *waptservice* et *waptexit*);
fr: **les agents WAPT** (*wapt-get*) et ses sous-composantes (*wapttray*, *waptservice* et *waptexit*) ;

source: **the management console** (*waptconsole*) ;
fr: **la console de management** (*waptconsole*) ;

source: **the network communications** between these different components;
fr: **les communications réseaux** entre ces différentes composantes ;

source: In complement to the elements listed above, an :term:`Organization` that uses WAPT will have to choose and follow a methodology that is adapted to her use case:
fr: En complément des éléments listés ci-dessus, un exploitant de WAPT devra choisir et suivre une méthodologie adaptée au contexte de son :term:`Organisation` pour :

source: insure the safe provisioning of all other files that are to be incorporated into a WAPT package;
fr: assurer un téléchargement sûr de tous les autres fichiers servant à constituer un paquet WAPT ;

source: develop the WAPT package python installation script so as to avoid any exploitable security or confidentiality defect;
fr: rédiger le script python d'installation d'un paquet WAPT de telle manière à éviter toute faille de sécurité ou de confidentialité exploitable ;

source: manage in a safe way the private keys for signing the packages;
fr: gérer de manière sûre les clés privées de signature des paquets ;

source: manage in a safe way the Autorities of Certification and Revocation for the SSL and HTTPS certificates;
fr: gérer de manière sûre les Autorités de certification et de révocation des certificats SSL et HTTPS ;

source: The safe management of these complementary elements is excluded from the perimeter of this documentation.
fr: La gestion sûre de ces éléments complémentaires est exclue du périmètre de cette documentation.

source: Description of typical users
fr: Description des utilisateurs typiques

source: The following roles must be understood to evaluate the security principles incorporated in WAPT:
fr: Les rôles suivants doivent être compris pour évaluer les principes de sécurité présents dans WAPT :

source: **User**
fr: **Utilisateur**

source: individual/ user of a WAPT equipped end-device (**Enterprise** and **Community**);
fr: individu / utilisateur d'une machine équipée de l'agent WAPT (**Enterprise** et **Community**) ;

source: **Package Deployer**
fr: **Déployeur de Paquets**

source: individual with the ability to sign packages that **DO NOT** contain python code (generally *group*, *host* and *unit* packages) and to upload the package to the main repository (**Enterprise**);
fr: individu pouvant signer des paquets ne contenant pas de code python (en général les paquets de type *group*, *unit* et *host*) et les charger sur le dépôt principal (**Enterprise**) ;

source: **Package Developer**
fr: **Développeur de Paquets**

source: individual with the ability to sign any package, may it include or not include python code, and to upload the package to the main repository (**Enterprise**);
fr: individu pouvant signer des paquets, qu'ils intègrent ou non du code python et les charger sur le dépôt principal (**Enterprise**) ;

source: all priviledged account in WAPT (**Community**);
fr: compte unique ayant tous les droits dans WAPT (**Community**) ;

source: **Local Administrator**
fr: **Administrateur Local**

source: individual with local administration right of the WAPT equipped end-devices (**Enterprise** and **Community**);
fr: utilisateur disposant des droits d'administration locaux sur les postes équipés de WAPT (**Enterprise** et **Community**) ;

source: Depending on the context within this documentation, an :term:`Administrator` will have the meaning of a :term:`Package Deployer`, :term:`Package Developer` or :term:`SuperAdmin`.
fr: En fonction du contexte de la documentation et de la version du produit, un :term:`Administrateur` désignera un :term:`Déployeur de Paquets`, un :term:`Développeur de Paquets` ou bien le :term:`SuperAdmin`.

source: The :term:`Users` that are members of the Active Directory security group **waptselfservice** are considered to be :term:`Local Administrators` from the point of view of WAPT security.
fr: Les :term:`Utilisateurs` membres du groupe de sécurité Active Directory **waptselfservice** sont considérés comme des :term:`Administrateurs Locaux` du point de vue de la sécurité WAPT.

source: Description of the sensitive assets in WAPT
fr: Description des biens sensibles

source: By definition, a sensitive asset is a data (or a function) that is considered as having value to an attacker.
fr: Par définition, un bien sensible est une donnée (ou fonction) jugée comme ayant de la valeur pour un attaquant.

source: Its value is estimated according to several security criteria (also called security needs):
fr: Sa valeur est estimée selon des critères de sécurité (aussi appelés besoins de sécurité) :

source: availability;
fr: disponibilité ;

source: integrity;
fr: intégrité ;

source: confidentiality;
fr: confidentialité ;

source: authenticity;
fr: authenticité ;

source: The sensitive assets to protect are as follows:
fr: Les biens sensibles à protéger sont les suivants :

source: Sensitive assets A1: communications
fr: Bien sensible B1 : Les communications

source: Communications between the central WAPT Server and the WAPT agents, as well as the communications between the WAPT console and the WAPT Server are a sensitive asset and they must be protected.
fr: Les communications entre le serveur central et les agents ainsi que les communications entre la console et le serveur sont un bien sensible et doivent être protégées.

source: Need for securing the communications
fr: Besoin de sécurité des communications :

source: Sensitive asset A2: inventory data
fr: Bien sensible B2 : Les données d'inventaire

source: The informations on the state of deployment of the packages, as well as hardware and software configurations of the end-devices are a sensitive asset and they must be protected.
fr: Les informations sur l'état de déploiement des paquets, ainsi que configuration matérielle et logicielle des postes clients sont un bien sensible et doivent être protégées.

source: Security need of the inventory data
fr: Besoin de sécurité des données d'inventaire :

source: Sensitive asset A3: log journals
fr: Bien sensible B3 : Les journaux d'historique

source: The logs generated by WAPT on the central server and by the agents are a sensitive asset and they must be protected.
fr: Les journaux générés par WAPT sur le serveur central et les agents sont un bien sensible et doivent être protégés.

source: Security needs of historical logs
fr: Besoin de sécurité des journaux d'historique

source: Sensitive asset A4: configuration values
fr: Bien sensible B4 : Les valeurs de configuration

source: The configuration values (HTTPS server keys, database access configuration, server authentication configuration) are sensitive and they must be protected.
fr: Les valeurs de configuration du serveur (clés du serveur https, configuration accès à la base de données, configuration de l'authentification au serveur) sont un bien sensible et doivent être protégés.

source: Security needs of configuration values
fr: Besoin de sécurité des valeurs de configuration :

source: Sensitive asset A5: WAPT executables on the end-devices
fr: Bien sensible B5 : Les exécutables WAPT installés sur les postes client

source: The WAPT executables installed on managed clients are a sensitive asset and they must be protected (i.e. the content of the :file:`<WAPT>` directory that includes the binaries, the configuration files and the local database).
fr: Les exécutables WAPT installés sur les postes client managés (contenu du répertoire wapt incluant les binaires, les dll, les fichiers de configuration et la base de données) sont un bien sensible et doivent être protégés.

source: Sensitive asset A6: authentication
fr: Bien sensible B6 : L'authentification

source: Authentication to the administration console as well as the authentication of the clients on the WAPT Server are a sensitive asset and they must be protected (public key of each WAPT agent).
fr: Les données d'authentification à la console d'administration ainsi que les données d'authentification des agents sur le serveur (clé publique de chaque agent WAPT) sont un bien sensible et doivent être protégées.

source: Security need of the authentication
fr: Besoin de sécurité de l'authentification :

source: Description of hypotheses on WAPT's working environment
fr: Description des hypothèses sur l'environment d'exploitation de WAPT

source: By definition, the hypotheses are statements on WAPT's usage context or its working environment.
fr: Par définition, les hypothèses sont des déclarations portant sur le contexte d'emploi de WAPT ou de son environment.

source: The following hypotheses on WAPT's working environment must be considered:
fr: Les hypothèses suivantes sur l'environment d'exploitation de WAPT doivent être considérées :

source: Hypothesis H1: the Administrators and the Package Deployers are trained
fr: Hypothèse H1 : Les Administrateurs et Gestionnaires de Déploiement WAPT sont formés

source: The :term:`Administrators` and the :term:`Package Deployers` are trained on WAPT usage. In particular, they must insure that their logins, passwords and private keys are kept secret.
fr: Les :term:`Administrateurs` et les :term:`Déployeurs de paquets` sont formés à l'usage de WAPT. En particulier, ils doivent s'assurer que leurs identifiants et clés de sécurité restent secrets.

source: Hypothesis H2: the operating systems underlying WAPT are sane
fr: Hypothèse H2 : Les systèmes subjacents à WAPT sont sains

source: WAPT's underlying operating systems implement adequate protection mechanisms that are configured according to good practice (confinement, access control, etc).
fr: Les systèmes d'exploitation sur lesquels les agents WAPT s'exécutent mettent en oeuvre des mécanismes de protection adéquats (confinement, contrôle d'accès, etc.) paramétrés et configurés selon les bonnes pratiques.

source: The underlying operating system are patched and up to date at the time of the installation of WAPT, they are free of viruses, trojan horses, etc.
fr: Les systèmes d'exploitation sont à jour des correctifs en vigueur au moment de l'installation, ils sont sains et exempts de virus, chevaux de Troie, etc.

source: Hypothesis H3: the binaries necessary for WAPT to operate are sane
fr: Hypothèse H3 : Les binaires nécessaires au fonctionnement de WAPT sont intègres

source: All libraries and tools necessary to install WAPT are considered to be sane. Upon the WAPT agent receiving a request, the agent verifies that the request has been properly signed.
fr: Toutes les librairies et outils nécessaires au fonctionnement de WAPT sont considérées saines. A la réception d'une requête par l'agent WAPT, il vérifie que la requête est correctement signée ;

source: Hypothesis H4: the WAPT packages are built in a safe manner
fr: Hypothèse H4 : Les paquets WAPT sont construits de manière sûre

source: The :term:`Administrator` is responsible for insuring that the files to be incorporated into a WAPT package come from safe sources and are free of viruses, trojan horses, etc.
fr: Il est de la responsabilité de l':term:`Administrateur` de s'assurer que les fichiers destinés à être intégrés dans des paquets WAPT proviennent de sources sûres et sont en particuliers exempts de virus, chevaux de Troie, etc.

source: Hypothesis H5: the Users of the end-devices are not Local Administrators
fr: Hypothèse H5 : Les Utilisateurs des postes client ne sont pas Administrateurs Locaux

source: A :term:`User` must not have local administration rights on the WAPT equipped device. Otherwise, the :term:`User` must be considered a :term:`Local Administrator`.
fr: Un :term:`Utilisateur` n'a pas les droits d'administration de son poste de travail. Sinon l':term:`Utilisateur` est considéré comme un :term:`Administrateur Local`.

source: In particular, a :term:`User` must not have write access to WAPT's installation directory.
fr: En particulier, l':term:`Utilisateur` n'a pas les droits d'écriture dans le répertoire d'installation du client WAPT.

source: Hypothesis H6: the Local Administrators are trained
fr: Hypothèse H6 : Les Administrateurs Locaux des postes client sont formés

source: The :term:`Local Administrator` of a device must be trained to use WAPT, or at minimum he must not make changes to files located in WAPT's installation folder.
fr: L':term:`Administrateur Local` d'un poste client doit être formé à l'exploitation de WAPT, ou à défaut ne pas modifier les fichiers d'installation se trouvant dans le dossier d'installation de WAPT.

source: Description of threats on WAPT's sensitive assets
fr: Description des menaces pesant sur les biens sensibles WAPT

source: By definition, a threat is an action or an event susceptible to bring prejudice to the security of the WAPT equipped device.
fr: Par définition, une menace est une action ou un événement susceptible de porter préjudice à la sécurité globale de la machine équipée de WAPT.

source: The threat agents to be considered for evaluating security in WAPT are as follows:
fr: Les agents menaçants à considérer pour l'évaluation de sécurité sont les suivants :

source: **Unauthorized entities**: it is a human attacker or en entity that interacts with WAPT without legitimately having access to it.
fr: **Entités non-autorisées** : il s'agit d'un attaquant humain ou d'une entité qui interagit avec WAPT mais qui ne dispose pas d'un accès légitime à celui-ci.

source: The :term:`Administrators` and the :term:`Local Administrators` are not considered to be attackers.
fr: Les :term:`Administrateurs` et les :term:`Administrateurs Locaux` ne sont pas considérés comme des attaquants.

source: The threats bearing on WAPT's sensitive assets defined above are as follow:
fr: Les menaces qui portent sur les biens sensibles WAPT définis ci-dessus sont les suivantes :

source: Threat T1: installation of an unsafe software by an unauthorized entity
fr: Menace M1 : Installation d'un logiciel malveillant par une entité non-autorisée

source: This threat corresponds to an attacker that would be able to use a component of the WAPT agent to permanently install a malicious application, or to remove or deactivate a security component on the WAPT equipped device.
fr: Cette menace correspond à un attaquant qui parviendrait à utiliser une composante de l'agent WAPT pour installer une application malveillante de façon pérenne, ou pour désinstaller ou désactiver une composante de sécurité du poste sur lequel l'agent WAPT est installé.

source: Threat T2: modification of configuration values by an unauthorized entity
fr: Menace M2 : Altération de valeurs de configuration par une entité non-autorisée

source: The threat corresponds to an attacker that would be able to modify a configuration element of WAPT that had been previously defined by a legitimate WAPT :term:`Administrator`.
fr: Cette menace correspond à un attaquant qui parviendrait à modifier ou à supprimer le paramétrage d'un élément de WAPT défini par un :term:`Administrateur` légitime de WAPT.

source: Threat T3: illegitimate access by an unauthorized entity
fr: Menace M3 : Accès illégitime par une entité non-autorisée

source: This threat corresponds to an attacker that would be able to recover the login credentials of an :term:`Administrator`, or bypass the authentication mechanism in such a way to access or alter a sensitive asset stored on the server. It also corresponds to an attacker being able to impersonate a WAPT agent.
fr: Cette menace correspond à un attaquant qui parviendrait à récupérer les données d'authentification d'un :term:`Administrateur`, à contourner le mécanisme d'authentification de manière à accéder ou à altérer un bien sensible stocké sur le serveur. Elle correspond également à un attaquant qui parviendrait à se faire passer pour un agent WAPT.

source: Threat T4: network listening by an unauthorized entity
fr: Menace M4 : Écoute du réseau par une entité non-autorisée

source: This threat corresponds to an attacker being able to intercept and gain knowledge of network traffic between the WAPT agents and the server hosting WAPT.
fr: Cette menace correspond à un attaquant qui parviendrait à intercepter et prendre connaissance des communications réseaux entre les agents et le serveur hébergeant WAPT.

source: Threat T5: modification of network traffic by an unauthorized entity (type *Man In The Middle*)
fr: Menace M5 : Altération du trafic réseau par une entité non-autorisée (Type *Man In the Middle*)

source: This threat corresponds to an attacker being able to alter network traffic between the agents and the server hosting WAPT, or between the console and the WAPT Server.
fr: Cette menace correspond à un attaquant qui parviendrait à modifier les communications réseaux entre les agents et le serveur hébergeant WAPT ou les communications réseau entre la console et le serveur WAPT.

source: Description of WAPT's security functions
fr: Description des fonctions de sécurité de WAPT

source: By definition, security functions are the set of technical measures and mechanisms implemented to protect in a proportionate way the sensitive assets against identified threats.
fr: Par définition, les fonctions de sécurité sont l'ensemble des mesures techniques et mécanismes mis en œuvre pour protéger de façon proportionnée les biens sensibles contre les menaces identifiées.

source: Security function F1: access authentication
fr: Fonction de sécurité F1 : Authentification des contrôles d'accès

source: Security function F1A: authentication of a device on initial registration in the WAPT database
fr: Fonction de sécurité F1A : Authentification d'une machine lors de son enregistrement initial dans la base de données WAPT

source: risks avoided
fr: risques traités :

source: the registering of an illegitimate device in the database;
fr: éviter l'inscription d'une machine illégitime dans la base de données ;

source: a denial-of-service attack by overloading the database;
fr: éviter une attaque par déni de service par surcharge de la base de données ;

source: the insertion of a fraudulent inventory in the database;
fr: éviter l'enregistrement d'un inventaire falsifié dans la base de données ;

source: Solution implemented
fr: Solution mise en place

source: To exist in the database and thus to appear in the management console, a device must register with the WAPT Server using the :command:`register` command.
fr: Pour exister dans la base de données et ainsi apparaître dans la console WAPT, une machine doit s'enregistrer auprès du serveur WAPT avec une commande :command:`register`.

source: The :command:`register` command may be executed automatically when installing or updating the WAPT agent if the device has a Kerberos machine account that is correctly registered in the :term:`Organization`'s Active Directory domain.
fr: La commande :command:`register` peut être exécutée automatiquement lors de l'installation ou de la mise à jour de l'agent WAPT si la machine est correctement enregistrée avec un compte machine Kerberos dans le domaine Active Directory de l':term:`Organisation`.

source: If the device does not present to the WAPT Server a valid Kerberos ticket, then the :command:`register` fails;
fr: Si la machine ne présente pas au serveur WAPT un ticket Kerberos valide pour le serveur WAPT, alors la commande :command:`register` échoue.

source: The Kerberos registration method assumes that the Active Directory server is responsive at the time of launch of the :command:`register` command.
fr: La méthode avec Kerberos assume que le serveur Active Directory répond au moment du :command:`register`.

source: Security function F1B: verification of server HTTPS certificates by the WAPT agents
fr: Fonction de sécurité F1B : Vérification des certificats HTTPS du serveur par les clients WAPT

source: risks avoided (notably MITM)
fr: risques traités (notamment MITM) :

source: the sending of sensitive informations to an illegitimate and unauthorized WAPT Server;
fr: éviter l'envoi d'informations sensibles à un serveur WAPT illégitime et non-autorisé ;

source: the recovery of sensitive informations by an unauthorized entity;
fr: éviter la récupération d'informations sensibles par une entité non-autorisée ;

source: the display of fake information in the management console of the :term:`Administrator`;
fr: éviter l'affichage d'informations falsifiées dans la console de l':term:`Administrateur` ;

source: an incorrect date to be sent upon a HEAD request, thus preventing future upgrades (request for a modified file date);
fr: éviter qu'une mauvaise date soit envoyée lors d'une requête HEAD (demande de modification de date de fichier) empêchant les futures mise à jours ;

source: sending the WAPT console password to an illegitimate and unauthorized WAPT Server;
fr: éviter d'envoyer le mot de passe de la console à un serveur WAPT illégitime et non-autorisé ;

source: For the secured version of WAPT to work correctly:
fr: Pour fonctionner correctement en version sécurisée :

source: an option for verifying the server HTTPS certificate is introduced in :file:`C:\\Program Files (x86)\\wapt\wapt-get.ini` on the WAPT agents that will **force the verification of the server certificate by the WAPT agents**;
fr: une option de vérification du certificat HTTPS serveur est introduite dans le fichier :file:`C:\Program Files (x86)\wapt\wapt-get.ini` des agents WAPT qui **force la vérification du certificat serveur par les agents WAPT** ;

source: an option for verifying the server HTTPS certificate is introduced in :file:`C:\\Program Files (x86)\\wapt\wapt-get.ini` on the WAPT agents that will force the verification of the server certificate by the **WAPT console**;
fr: une option de vérification du certificat HTTPS serveur est introduite dans le fichier :file:`C:\Program Files (x86)\wapt\wapt-get.ini` des agents WAPT qui **force la vérification du certificat serveur par les agents WAPT** ;
