Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/session-setup/index.po
Languages: fr

source: Creating a WAPT package from the WAPT console
fr: Créer un paquet WAPT depuis la console

source: session_setup, WAPT, customize, user context, desktop shortcuts, special arguments, configuration, configure, directory, database, documentation
fr: session_setup, WAPT, personnaliser, contexte utilisateur, raccourcis, arguments spécifiques, configuration, configurer, annuaire, base de données

source: Customizing the user environment
fr: Personnaliser l'environment utilisateur

source: *session_setup* principles
fr: Principe du *session_setup*

source: It is sometimes necessary to customize a software in user context to set specific settings or to comply to the Organization's rules and preferences:
fr: Il est parfois nécessaire de personnaliser un programme ou un logiciel en contexte utilisateur pour rendre le logiciel immédiatement exploitable par l'utilisateur dans le contexte spécifique de son entreprise ou du service au sein de son entreprise :

source: creating user desktop shortcut with specific arguments;
fr: créer des raccourcis sur le bureau utilisateur avec des arguments spécifiques ;

source: making changes to user Windows registry keys;
fr: modifier de clés registres utilisateurs ;

source: making changes to files, to browser settings of the user;
fr: modifier des fichiers, une configuration de navigateur ;

source: configuring shortcuts to the Organization's set of templates for Documents, Spreadsheets or Presentations in Office Suites to encourage or insure that editorial and graphical guidelines are followed;
fr: configurer des raccourcis réseaux aux modèles de documents de l'entreprise pour assurer la conformité des documents aux chartes éditoriales en vigueur ;

source: setting up the user's email or instant messaging from the Organization's main user data repository (LDAP directory, database, etc);
fr: paramétrer la messagerie de l'utilisateur à partir d'un référentiel externe (annuaire, base de données, etc) ;

source: customizing an office suite or business software based on the Organization's main user data repository (LDAP directory, database, etc);
fr: paramétrer un logiciel bureautique ou métier à partir d'un référentiel externe (annuaire, base de données, etc) ;

source: The :command:`session_setup` function benefits from the power of python to achieve a high level of automation.
fr: La fonction :command:`session_setup` bénéficie de toute la puissance et de l'étendue des librairies python pour atteindre un niveau d'automatisation élevé.

source: Principles of *session_setup*
fr: Fonctionnement du *session_setup*

source: The WAPT :command:`session_setup` function executes at every user startup, launching that command:
fr: La fonction WAPT :command:`session_setup` s'exécute à chaque ouverture de session utilisateur, en appelant la commande :

source: Calling that function executes the :command:`session_setup` script defined within each WAPT package installed on the computer.
fr: L'appel à cette fonction permet d'exécuter la partie :command:`session_setup` de chaque paquet WAPT logiciel installé sur la machine.

source: The WAPT agent stores in its local database (:file:`C:\\Program Files (x86)\\wapt\\waptdb.sqlite`) the instruction sets of all WAPT packages.
fr: WAPT enregistre en base locale les instructions de tous les paquets dans le fichier :file:`C:\\Program Files (x86)\\wapt\\waptdb.sqlite`.

source: :command:`session_setup` is launched only **once per WAPT package version and per user**.
fr: Le :command:`session_setup` de chaque paquet n'est exécuté qu'**une seule fois par paquet ou version de paquet et par profil utilisateur**.

source: The WAPT agent stores in is local :file:`%appdata%\\wapt\\waptsession.sqlite` database the instances of :command:`session_setup` that have been already been played.
fr: Le :command:`session_setup` va enregistrer dans le fichier :file:`%appdata%\\wapt\\waptsession.sqlite` les :command:`session_setup` déjà exécutées.

source: To launch a program at every startup, consider using a startup script located in **User Startup** (*startup(0)*) or **All Users Startup** (*startup(1)*), or via a :abbr:`GPO (Group Policy Object)`.
fr: Pour lancer un programme à chaque démarrage, il s'agira de privilégier l'utilisation d'un script au démarrage utilisateur contenu dans le **démarrage utilisateur** (*startup(0)*) ou **Démarrage All Users** (*startup(1)*), ou via une stratégie de groupe :abbr:`GPO (Group Policy Object)`.

source: Output example of :code:`wapt-get session-setup ALL`:
fr: Exemple de sortie de la commande :code:`wapt-get session-setup ALL` :

source: the connected user's ``session_setup`` had already been launched.
fr: le ``session_setup`` de l'utilisateur connecté, avait déjà été exécuté.

source: Using *session_setup*
fr: Utiliser le *session_setup*

source: The :command`session_setup` scripts are located in the section *def session_setup()* of the :file:`setup.py` file:
fr: On définit la partie :command:`session_setup` dans le fichier :file:`setup.py` du paquet dans une fonction *def session_setup()* :

source: Example:
fr: Exemple :

source: With :command:`session_setup`, there is no possibility to call files contained inside the WAPT package.
fr: Avec :command:`session_setup`, il n'est pas possible de faire appel à des fichiers contenus dans le paquet.

source: To call external files when uninstalling, copy and paste the needed files in an external folder during the package installation process (example: a sub-directory created in the User's own directory).
fr: Pour utiliser des fichiers lors de la désinstallation, copier / coller les fichiers dans un répertoire extérieur au paquet lors de l'installation du paquet (exemple : un sous-répertoire créé à la racine du répertoire utilisateur).
