Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/security/enable-check-certificate.po
Languages: fr

source: Securing the communications between the agent and the WAPT Server
fr: Sécuriser les échanges entre l'agent et le serveur WAPT

source: pinning, certificate pinning, bundle, wapt-get.ini, Certificate Authority, enable-check-certificate, WAPT, documentation
fr: pinning, épingler, épinglage, certificat, bundle, wapt-get.ini, Autorité de Certification, enable-check-certificate

source: Activating the verification of the SSL / TLS certificate
fr: Activer la vérification du certificat SSL / TLS

source: **For simplicity, it is better to run theses steps before launching the WAPT console**
fr: **Il est important d'effectuer ces actions avant de lancer la console WAPT !!**

source: The WAPT agent checks the HTTPS server certificate according to the ``verify_cert`` value in section ``[global]`` in :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`.
fr: L'agent vérifie le certificat SSL / TLS du serveur en fonction de la valeur de ``verify_cert`` dans la section ``[global]`` du fichier :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`.

source: When using commercially issued certificates, it is advised to use the pinning method for more security.
fr: Pour les certificats commerciaux, il est conseillé de faire de l'épinglage pour plus de sécurité.

source: Two methods are available for verifying the SSL/ TLS certificates:
fr: Deux méthodes sont possibles pour vérifier le certificat SSL / TLS :

source: by default (``verify_cert`` = 1) with the certificate *bundle* contained in the standard Python :program:`certifi` module;
fr: par défaut (``verify_cert`` = 1) à l'aide du *bundle* de certificats contenu en standard dans le module Python :program:`certifi` : :file:`C:\Program Files (x86)\wapt\lib\site-packages\certifi\cacert.pem` ;

source: by specifying the bundle that will be downloaded and activated with the command ``wapt-get enable-check-certificate`` (certificate pinning);
fr: en utilisant le pinning de certificat en spécifiant un *bundle* précis qui sera téléchargé et activé à l'aide de la commande : :file:`wapt-get enable-check-certificate` ;

source: Pinning the certificate
fr: Epingler le certificat

source: The *pinning of certificate* consists of verifying the SSL/ TLS certificate with a well defined and restricted bundle, instead of relying on the bundles from Certificate Authorities contained in the certificate store provided by default with Windows of with your Linux distribution.
fr: L'*épinglage de certificats* consiste à vérifier le certificat SSL / TLS à partir d'un bundle défini et restreint, plutôt que de s'appuyer sur les bundle de CA du magasin de certificats livré en standard avec Windows ou bien avec votre distribution Linux.

source: This method is useful even when using a certificate issued by a Trusted Authority.
fr: Cette configuration est utile même si vous utilisez un certificat généré par un tiers de confiance.

source: By specifying a bundle with the ``enable-check-certificate`` command, you restrict the list of Certificate Authorities that you trust.
fr: En indiquant un bundle avec la commande :command:`enable-check-certificate`, vous réduisez la liste des émetteurs de confiance que vous autorisez.

source: **The pinning of certificates issued by a Certificate Authority trusted by the Organization is the best method**.
fr: **L'épinglage de certificats obtenus auprès d'une Autorité de Certification reconnue par l'Organisation est la méthode recommandée**.

source: For this, you need to launch the following commands in the Windows :program:`cmd.exe` shell (with elevated privileges if UAC is active).
fr: Pour cela vous devez lancer les commandes suivantes dans un shell :program:`cmd.exe` (avec élévation de privilège si l'UAC est activée).

source: If you already have a Windows :program:`cmd.exe` shell open, close it and open a new shell so to take into account the updated environment variables:
fr: Si vous avez déjà un :program:`cmd.exe` ouvert, fermez le et ouvrez en un nouveau pour prendre en compte la mise à jour des variables d'environment ``%PATH%``.

source: Modify (:file:`C:\\Program Files (x86)\\wapt\\ssl\\srvwapt.mydomain.lan.crt`) to add inside it the certificate of the ':term:`Certificate Authority`:
fr: Modifier le certificat obtenu (:file:`C:\\Program Files (x86)\\wapt\\ssl\\srvwapt.mydomain.lan.crt`) pour y ajouter le certificat de l\':term:`Autorité de Certification` :

source: Validate the certificate by using the following command:
fr: Vérifier que la validation est effective en utilisant la commande :

source: When you have executed the :command:`update` command, make sure that everything has gone well, and if in doubt check :ref:`error_run_check_cert`.
fr: Lorsque vous avez executé la commande :command:`update`, assurez vous que tout s'est bien déroulé, sinon visitez :ref:`error_run_check_cert`.

source: the command *enable-check-certificate* downloads the certificate :file:`srvwapt.mydomain.lan.crt` in the folder :file:`C:\\Program Files (x86)\\WAPT\\ssl` ;
fr: La commande :command:`enable-check-certificate` permet de télécharger le certificat :file:`srvwapt.mydomain.lan.crt` dans le répertoire :file:`C:\\Program Files (x86)\\wapt\\ssl` ;

source: it then modifies the file :file:`wapt-get.ini` to specify the value ``verify_cert`` = :file:`C:\\Program Files (x86)\\wapt\\ssl\\srvwapt.mydomain.lan.crt` ;
fr: Elle inscrit ensuite dans le fichier :file:`wapt-get.ini` la valeur ``verify_cert`` = :file:`C:\\Program Files (x86)\\wapt\\ssl\\srvwapt.mydomain.lan.crt` ;

source: the WAPT agent will now verify certificates using the pinned certificate;
fr: L'agent WAPT vérifiera désormais le certificat SSL / TLS avec le bundle de certificats *épinglés* ;

source: If you use the *certificate pinning* method, be reminded to archive the :file:`/opt/wapt/waptserver/ssl` folder on your WAPT Server.
fr: Si vous faites de l'*épinglagle de certificat*, pensez bien à sauvegarder le dossier :file:`/opt/wapt/waptserver/ssl` du serveur WAPT.

source: The file will have to be restored on your server if you migrate or upgrade your WAPT Server, if you want the WAPT agents to continue being able to establish trusted HTTPS connections.
fr: En effet il vous faudra le restaurer sur votre serveur et cas de migration ou de restauration pour que les client puissent vérifier la connexion HTTPS avec le serveur.

source: Certificate verification
fr: Vérification du cert

source: Verifying the certificate in the WAPT console
fr: Certificat dans la console WAPT

source: When the WAPT console first starts, it reads the content of :file:`C:\\Program Files (x86)\\WAPT\\wapt-get.ini` and it builds its configuration file :file:`C:\\Users\\admin\\AppData\\Local\\waptconsole\\waptconsole.ini`.
fr: Lorsque la console WAPT démarre, elle lira le fichier de configuration de l'agent WAPT :file:`C:\\Program Files (x86)\\WAPT\\wapt-get.ini` pour construire le fichier de configuration de la console WAPT :file:`C:\\Users\\admin\\AppData\\Local\\waptconsole\\waptconsole.ini`.

source: We find the ``verify_cert`` attribute that defines the behavior of the WAPT console in regards the HTTPS connection with the WAPT Server.
fr: On retrouve la ligne ``verify_cert`` dans le fichier :file:`waptconsole.ini` qui définit comment la console WAPT vérifie le certificat SSL / TLS du serveur WAPT.

source: You may now proceed to the next step and :ref:`start the WAPT console <starting-waptconsole>`.
fr: Vous pouvez maintenant passer à la suite de la configuration en :ref:`lançant la console WAPT <starting-waptconsole>`.
