Repository: tranquilit/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/security/security-configuration-certificate-authentication.po
Languages: fr

source: Using valid SSL / TLS certificates for the WAPT Server
fr: Utiliser des certificats SSL / TLS valides pour le serveur WAPT

source: certificat, WAPT, SSL / TLS, Certificate Authority, documentation
fr: certificat, WAPT, SSL / TLS, Autorité de Certification, documentation

source: Configure Client-Side Certificate Authentication
fr: Configurer le certificat d'authentification client

source: Feature only available with WAPT **Enterprise**.
fr: Cette fonctionnalité est disponible uniquement dans la version **WAPT Enterprise**.

source: If your business need a public WAPT server on Internet, it can be secured with **Client-Side Certificate Authentication**.
fr: Si votre organisation veut déployer un serveur WAPT directement accessible sur Internet, il peut être sécurisé avec un **certificat d'authentification client**.

source: That configuration restricts the visibility of WAPT Server to registered clients only, using the Agent private key generated during registration.
fr: Cette configuration restreint la visibilité du serveur WAPT aux seuls clients dont l'agent s'est correctement authentifiés avec sa clé privée générée au moment de leur enregistrement avec le serveur WAPT.

source: The agent sends a CSR to WAPT server which is signed and sent back to WAPT agent.
fr: L'agent envoie une :abbr:`(CSR Certificate Signing Request)` au serveur WAPT que le serveur signe et renvoie signée à l'agent.

source: Using that signed certificate, the agent can access protected parts of Nginx server
fr: En présentant son certificat signé, l'agent a accès aux espaces protégés du serveur Nginx.

source: We advise you to enabe Kerberos or login/password registration in WAPT Server post-configuration.
fr: Il est recommandé d'activer l'enregistrement par Kerberos ou par identifiant / mot de passe lors de la post-configuration du serveur WAPT.

source: Generate Certificate Authority for Nginx
fr: Générer l'Autorité de Certification pour Nginx

source: Using :file:`wapt-get.exe` command, generate the Certificate Authority for Nginx :
fr: En utilisant la commande :command:`wapt-get.exe`, générer l'Autorité de Certification pour Nginx :

source: Transfer the two generated files on WAPT Server, set **clients_signing_key** and **clients_signing_certificate** values in :file:`/opt/waptserver/conf/waptserver.ini`
fr: Transférer les deux fichiers générés sur le serveur WAPT et configurer les valeurs de **clients_signing_key** et de **clients_signing_certificate** dans :file:`/opt/waptserver/conf/waptserver.ini`.

source: Enabling Client-Side Certificate Authentication
fr: Activer l'authentification par certificat client

source: Add a Nginx configuration file :file:`/etc/nginx/certificate-auth.conf`. This file is used to restrict access to specific actions with Certificate Authentication
fr: Ajouter le fichier de configuration :file:`/etc/nginx/certificate-auth.conf` au serveur Nginx. Ce fichier est utilisé pour restreindre certaines actions authentifiées par certificat.

source: Example config file :
fr: Exemple de fichier de configuration :
